0010/**********************************************************************
0020/* NDVSINTA: Example for Interaction handling
0030/*---------------------------------------------------------------------
0040/* Note:
0050/* For more information see also A-README in SYSEXNDC in
0060/* Natural Studio 62 and above.
0070/**********************************************************************
0080/*---------------------------------------------------------------------
0090/*---------------- Compiler options -----------------------------------
0100/*---------------------------------------------------------------------
0110OPTIONS LOWSRCE=ON
0120/*---------------------------------------------------------------------
0130/*---------------- Data definitions -----------------------------------
0140/*---------------------------------------------------------------------
0150DEFINE DATA
0160/*---------------------------------------------------------------------
0170/*---------------- Independent data -----------------------------------
0180/*---------------------------------------------------------------------
0190INDEPENDENT
02001 +User-TRACE-LEVEL                   (I2)
0210/*---------------------------------------------------------------------
0220/*---------------- Local data -----------------------------------------
0230/*---------------------------------------------------------------------
0240LOCAL
02501 Local-Buffer                        (A1/1:5000)
02601 Redefine Local-Buffer
0270  2 Filler                            20X
0280  2 Local-Buffer-Header-Data          (A1/1:480)
0290  2 Redefine Local-Buffer-Header-Data
0300    3 Local-Buffer-Caller-Name        (A8)
0310    3 Local-Buffer-Function-Code      (A2)
0320    3 Local-Buffer-Return-Code-Sign   (A1)
0330    3 Local-Buffer-Return-Code        (N4)
0340  2 Local-Buffer-Function-Data        (A1/1:4500)
0350  2 Redefine Local-Buffer-Function-Data
0360    3 LBFD-Fct-Line-1                 (A250/1:18)
0370/*---------------------------------------------------------------------
0380/* Parameter for NDVS004N
0390/*---------------------------------------------------------------------
04001 NDVS004N-Function                   (A2)  /* ST = Set Trace level
04101 NDVS004N-Para                       (A332)
04201 Redefine NDVS004N-Para                    /* For funtion 'WT'
0430  2 NDVS004N-Trace-Msg                (A230)
04401 NDVS004N-RETURN-CODE                (I4)
0450/*---------------------------------------------------------------------
0460/* Other local data
0470/*---------------------------------------------------------------------
04801 Call-Counter                        (I2)
04901 Error-Text-1                        (A250)
05001 Return-Code                         (I4)
0510END-DEFINE
0520/**********************************************************************
0530/*---------------------------------------------------------------------
0540/*---------------- Start of main program ------------------------------
0550/*---------------------------------------------------------------------
0560/*---------------------------------------------------------------------
0570/* Init Communication (set steplibs, check for trace and set the
0580/* +User-TRACE-LEVEL variable)
0590/*---------------------------------------------------------------------
0600Callnat 'NDVS001N'
0610        Return-Code
0620        Error-Text-1
0630If (Return-Code <> 0)
0640  *Error-Nr := 999
0650End-If
0660/*---------------------------------------------------------------------
0670/* Write a user trace message
0680/*---------------------------------------------------------------------
0690If (+User-TRACE-LEVEL > 0)               /* set in NDVS001N
0700  NDVS004N-Trace-Msg :=
0710                   'Example function ''Interaction handling'' started.'
0720  NDVS004N-Function  := 'WT'              /* Write Trace
0730  CALLNAT 'NDVS004N'
0740          NDVS004N-Function
0750          NDVS004N-Para
0760          NDVS004N-RETURN-CODE
0770End-If
0780/*---------------------------------------------------------------------
0790/* Main processing loop
0800/*---------------------------------------------------------------------
0810Main-Repeat.
0820Repeat
0830  /*-------------------------------------------------------------------
0840  /* Read data sent from client
0850  /*-------------------------------------------------------------------
0860  Callnat 'NDVS003N'
0870          Local-Buffer (*)
0880          'G'                            /* Get
0890          Return-Code
0900          Error-Text-1
0910  If (Return-Code <> 0)
0920    Local-Buffer-Function-Code := 'ER'   /* Error
0930    Compress *Program ':' Error-Text-1 into LBFD-Fct-Line-1 (1)
0940    Escape Bottom (Main-Repeat.)
0950  End-If
0960  /*-------------------------------------------------------------------
0970  /* Check what to do
0980  /*-------------------------------------------------------------------
0990  Decide on first value of Local-Buffer-Function-Code
1000    Value 'SC'               /* Single call
1010          Compress *Program 'function ''SC'', data for client:'
1020                   'date' *DATN 'time' *TIMN
1030                   into LBFD-Fct-Line-1 (1)
1040          Local-Buffer-Return-Code-Sign := ' '
1050          Local-Buffer-Return-Code      := 0
1060          Escape Bottom (Main-Repeat.)
1070    Value 'LC'               /* Last call
1080          Compress *Program 'function ''LC'', last data for client:'
1090                   'date' *DATN 'time' *TIMN
1100                   into LBFD-Fct-Line-1 (1)
1110          Local-Buffer-Return-Code-Sign := ' '
1120          Local-Buffer-Return-Code      := 0
1130          Escape Bottom (Main-Repeat.)
1140    Value 'MC'               /* Multiple call
1150          Add 1 to Call-Counter
1160          Compress numeric *Program 'function ''MC'', call number'
1170                   Call-Counter 'data for client:'
1180                   'date' *DATN 'time' *TIMN
1190                   into LBFD-Fct-Line-1 (1)
1200          Local-Buffer-Return-Code-Sign := ' '
1210          Local-Buffer-Return-Code      := 0
1220          /*-----------------------------------------------------------
1230          /* sent data to client
1240          /*-----------------------------------------------------------
1250          Callnat 'NDVS003N'
1260                  Local-Buffer (*)
1270                  'A'                    /* Put + Interaction
1280                  Return-Code
1290                  Error-Text-1
1300    None value
1310          Compress *Program ': unknown/invalid function code'
1320                   Local-Buffer-Function-Code 'received.'
1330                   into LBFD-Fct-Line-1 (1)
1340          Local-Buffer-Function-Code    := 'ER'   /* Error
1350          Local-Buffer-Return-Code-Sign := ' '
1360          Local-Buffer-Return-Code      := 999
1370          Escape Bottom (Main-Repeat.)
1380  End-Decide
1390End-Repeat /* (Main-Repeat.)
1400/*---------------------------------------------------------------------
1410/* Return last data to client
1420/*---------------------------------------------------------------------
1430Callnat 'NDVS003N'
1440        Local-Buffer (*)
1450        'P'                              /* Put
1460        Return-Code
1470        Error-Text-1
1480/*---------------------------------------------------------------------
1490/* Write a trace message
1500/*---------------------------------------------------------------------
1510If (+User-TRACE-LEVEL > 4)
1520  NDVS004N-Trace-Msg :=
1530                    'End of example function ''Interaction handling''.'
1540  NDVS004N-Function  := 'WT'              /* Write Trace
1550  CALLNAT 'NDVS004N'
1560          NDVS004N-Function
1570          NDVS004N-Para
1580          NDVS004N-RETURN-CODE
1590End-If
1600/*---------------------------------------------------------------------
1610/* Delete the steplibs and leave here
1620/*---------------------------------------------------------------------
1630CALLNAT 'NDVS002N'                       /* Cleanup
1640Stop
1650/*---------------------------------------------------------------------
1660/*---------------- End of main program --------------------------------
1670/*---------------------------------------------------------------------
1680/**********************************************************************
1690/**********************************************************************
1700END
