0010/**********************************************************************
0020/* NDVSPING: Example for the PING function
0030/*---------------------------------------------------------------------
0040/* Note:
0050/* For more information see also A-README in SYSEXNDC in
0060/* Natural Studio 62 and above.
0070/**********************************************************************
0080/*---------------------------------------------------------------------
0090/*---------------- Compiler options -----------------------------------
0100/*---------------------------------------------------------------------
0110OPTIONS LOWSRCE=ON
0120/*---------------------------------------------------------------------
0130/*---------------- Data definitions -----------------------------------
0140/*---------------------------------------------------------------------
0150DEFINE DATA
0160/*---------------------------------------------------------------------
0170/*---------------- Independent data -----------------------------------
0180/*---------------------------------------------------------------------
0190INDEPENDENT
02001 +User-TRACE-LEVEL                   (I2)
0210/*---------------------------------------------------------------------
0220/*---------------- Local data -----------------------------------------
0230/*---------------------------------------------------------------------
0240LOCAL
02501 Local-Buffer                        (A1/1:5000)
02601 Redefine Local-Buffer
0270  2 Filler                            20X
0280  2 Local-Buffer-Header-Data          (A1/1:480)
0290  2 Redefine Local-Buffer-Header-Data
0300    3 Local-Buffer-Caller-Name        (A8)
0310    3 Local-Buffer-Function-Code      (A2)
0320    3 Local-Buffer-Return-Code-Sign   (A1)
0330    3 Local-Buffer-Return-Code        (N4)
0340  2 Local-Buffer-Function-Data        (A1/1:4500)
0350  2 Redefine Local-Buffer-Function-Data
0360    3 LBFD-Fct-Line-1                 (A250)
0370/*---------------------------------------------------------------------
0380/* Parameter for NDVS004N
0390/*---------------------------------------------------------------------
04001 NDVS004N-Function                   (A2)  /* ST = Set Trace level
04101 NDVS004N-Para                       (A332)
04201 Redefine NDVS004N-Para                     /* For funtion 'WT'
0430  2 NDVS004N-Trace-Msg                (A230)
04401 NDVS004N-RETURN-CODE                (I4)
0450/*---------------------------------------------------------------------
0460/* Other local data
0470/*---------------------------------------------------------------------
04801 Error-Text-1                        (A250)
04901 Return-Code                         (I4)
0500END-DEFINE
0510/**********************************************************************
0520/*---------------------------------------------------------------------
0530/*---------------- Start of main program ------------------------------
0540/*---------------------------------------------------------------------
0550/*---------------------------------------------------------------------
0560/* Init Communication (set steplibs, check for trace and set the
0570/* +User-TRACE-LEVEL variable)
0580/*---------------------------------------------------------------------
0590Callnat 'NDVS001N'
0600        Return-Code
0610        Error-Text-1
0620If (Return-Code <> 0)
0630  *Error-Nr := 999
0640End-If
0650/*---------------------------------------------------------------------
0660/* Write a user trace message
0670/*---------------------------------------------------------------------
0680If (+User-TRACE-LEVEL > 0)               /* set in NDVS001N
0690  NDVS004N-Trace-Msg := 'Example function ''PING'' started.'
0700  NDVS004N-Function  := 'WT'              /* Write Trace
0710  CALLNAT 'NDVS004N'
0720          NDVS004N-Function
0730          NDVS004N-Para
0740          NDVS004N-RETURN-CODE
0750End-If
0760/*---------------------------------------------------------------------
0770/* Read data sent from client
0780/*---------------------------------------------------------------------
0790Callnat 'NDVS003N'
0800        Local-Buffer (*)
0810        'G'                              /* Get
0820        Return-Code
0830        Error-Text-1
0840/*---------------------------------------------------------------------
0850/* Fill Buffer
0860/*---------------------------------------------------------------------
0870If (Return-Code = 0)
0880  Local-Buffer-Function-Code := 'DA'     /* Data
0890  Compress *Program 'sends data: *HOSTNAME:' *HOSTNAME '*OS:' *OS
0900           '*MACHINE-CLASS:' *MACHINE-CLASS '*NATVERS:' *NATVERS
0910           '*PATCH-LEVEL:' *PATCH-LEVEL '*DATN:' *DATN '*TIMN:' *TIMN
0920           into LBFD-Fct-Line-1
0930Else
0940  Local-Buffer-Function-Code := 'ER'     /* Error
0950  Compress *Program ':' Error-Text-1 into LBFD-Fct-Line-1
0960End-If
0970/*---------------------------------------------------------------------
0980/* Return values to client
0990/*---------------------------------------------------------------------
1000Callnat 'NDVS003N'
1010        Local-Buffer (*)
1020        'P'                              /* Put
1030        Return-Code
1040        Error-Text-1
1050/*---------------------------------------------------------------------
1060/* Write a trace message
1070/*---------------------------------------------------------------------
1080If (+User-TRACE-LEVEL > 4)
1090  NDVS004N-Trace-Msg := 'End of example function ''PING''.'
1100  NDVS004N-Function  := 'WT'              /* Write Trace
1110  CALLNAT 'NDVS004N'
1120          NDVS004N-Function
1130          NDVS004N-Para
1140          NDVS004N-RETURN-CODE
1150End-If
1160/*---------------------------------------------------------------------
1170/* Delete the steplibs and leave here
1180/*---------------------------------------------------------------------
1190CALLNAT 'NDVS002N'                       /* Cleanup
1200Stop
1210/*---------------------------------------------------------------------
1220/*---------------- End of main program --------------------------------
1230/*---------------------------------------------------------------------
1240/**********************************************************************
1250/**********************************************************************
1260END
