0010DEFINE DATA
0020PARAMETER
00301 #BYVAL   (A32) BY VALUE
00401 REDEFINE #BYVAL
00502 #BYVAL1  (A16)
00602 #BYVAL2  (A16)
00701 #BYREF   (A32)
00801 REDEFINE #BYREF
00902 #BYREF1  (A16)
01002 #BYREF2  (A16)
01101 #RESULT  (A32) BY VALUE RESULT
01201 REDEFINE #RESULT
01302 #RESULT1 (A16)
01402 #RESULT2 (A16)
0150END-DEFINE
0160*
0170#RESULT1 := #BYVAL2
0180#RESULT2 := #BYVAL1
0190#BYREF1  := #BYVAL2
0200#BYREF2  := #BYVAL1
0210*
0220END
0230
