0010DEFINE DATA
0020PARAMETER
00301 #BYVAL(I4/1:2,1:3,1:4) BY VALUE
00401 #BYREF(I4/1:2,1:3,1:4)
00501 #RESULT(I4/1:2,1:3,1:4) BY VALUE RESULT
0060END-DEFINE
0070*
0080#RESULT(*,*,*) := #BYVAL(*,*,*)
0090#BYREF(*,*,*) := #BYVAL(*,*,*)
0100*
0110END
0120
