0010DEFINE DATA
0020PARAMETER
00301 #BYVAL(A) DYNAMIC BY VALUE
00401 #BYREF(A) DYNAMIC
00501 #RESULT(A) DYNAMIC BY VALUE RESULT
0060END-DEFINE
0070*
0080COMPRESS #BYVAL #BYVAL TO #RESULT LEAVING NO
0090COMPRESS #BYVAL #BYVAL TO #BYREF LEAVING NO
0100*
0110END
0120
