0010DEFINE DATA
0020PARAMETER
00301 #BYVAL(B) DYNAMIC BY VALUE
00401 #BYREF(B) DYNAMIC
00501 #RESULT(B) DYNAMIC BY VALUE RESULT
0060END-DEFINE
0070*
0080COMPRESS #BYVAL #BYVAL TO #RESULT LEAVING NO
0090COMPRESS #BYVAL #BYVAL TO #BYREF LEAVING NO
0100*
0110END
0120
