0010DEFINE DATA
0020PARAMETER
00301 #BYVAL(C) BY VALUE
00401 #BYREF(C)
00501 #RESULT(C) BY VALUE RESULT
0060END-DEFINE
0070*
0080#RESULT := (AD=P)
0090#BYREF  := (AD=P)
0100*
0110END
0120
