0010DEFINE DATA
0020PARAMETER
00301 #BYVAL(F4) BY VALUE
00401 #BYREF(F4)
00501 #RESULT(F4) BY VALUE RESULT
0060END-DEFINE
0070*
0080#RESULT := #BYVAL * 2
0090#BYREF  := #BYVAL * 2
0100*
0110END
0120
