0010DEFINE DATA
0020PARAMETER
00301 #BYVAL(I1) BY VALUE
00401 #BYREF(I1)
00501 #RESULT(I1) BY VALUE RESULT
0060END-DEFINE
0070*
0080#RESULT := (#BYVAL - 1) * 2 + 1
0090#BYREF  := (#BYVAL - 1) * 2 + 1
0100*
0110END
0120
