0010DEFINE DATA
0020PARAMETER
00301 #BYVAL(I2) BY VALUE
00401 #BYREF(I2)
00501 #RESULT(I2) BY VALUE RESULT
0060END-DEFINE
0070*
0080#RESULT := (#BYVAL - 1) * 2 + 1
0090#BYREF  := (#BYVAL - 1) * 2 + 1
0100*
0110END
0120
