0010DEFINE DATA
0020PARAMETER
00301 #BYVAL(L) BY VALUE
00401 #BYREF(L)
00501 #RESULT(L) BY VALUE RESULT
0060END-DEFINE
0070*
0080IF #BYVAL
0090  #RESULT := FALSE
0100ELSE
0110  #RESULT := TRUE
0120END-IF
0130*
0140IF #BYVAL
0150  #BYREF := FALSE
0160ELSE
0170  #BYREF := TRUE
0180END-IF
0190*
0200END
0210
