0010DEFINE DATA
0020PARAMETER
00301 #BYVAL(T) BY VALUE
00401 #BYREF(T)
00501 #RESULT(T) BY VALUE RESULT
0060END-DEFINE
0070*
0080#RESULT := #BYVAL + 270
0090#BYREF  := #BYVAL + 270
0100*
0110END
0120
