0010DEFINE DATA
0020PARAMETER
00301 #BYVAL(A/1:*,1:*,1:*) DYNAMIC BY VALUE
00401 #BYREF(A/1:*,1:*,1:*) DYNAMIC
00501 #RESULT(A/1:*,1:*,1:*) DYNAMIC BY VALUE RESULT
0060END-DEFINE
0070*
0080RESIZE ARRAY #BYREF TO (1:2,1:3,1:4)
0090#BYREF(*,*,*) := #BYVAL(*,*,*)
0100* *
0110RESIZE ARRAY #RESULT TO (1:2,1:3,1:4)
0120#RESULT(*,*,*) := #BYVAL(*,*,*)
0130*
0140END
0150
