0010** Example 'ACREX1': ACCEPT
0020************************************************************************
0030DEFINE DATA LOCAL
00401 EMPLOY-VIEW VIEW OF EMPLOYEES
0050  2 NAME
0060  2 SEX
0070  2 MAR-STAT
0080END-DEFINE
0090*
0100LIMIT 50
0110READ EMPLOY-VIEW
0120  ACCEPT IF SEX='M' AND MAR-STAT = 'S'
0130  WRITE  NOTITLE '=' NAME '=' SEX 5X '=' MAR-STAT
0140END-READ
0150END
