0010** Example 'ATBEX1S': AT BREAK (structured mode)
0020************************************************************************
0030DEFINE DATA LOCAL
00401 EMPLOY-VIEW VIEW OF EMPLOYEES
0050  2 CITY
0060  2 COUNTRY
0070  2 NAME
0080END-DEFINE
0090*
0100LIMIT 10
0110READ EMPLOY-VIEW BY CITY
0120  AT BREAK OF CITY
0130    SKIP 1
0140  END-BREAK
0150  DISPLAY NOTITLE CITY (IS=ON) COUNTRY (IS=ON) NAME
0160END-READ
0170*
0180END
