0010** Example 'ATBEX2': AT BREAK (with /n/ notation)
0020************************************************************************
0030DEFINE DATA LOCAL
00401 EMPLOY-VIEW VIEW OF EMPLOYEES
0050  2 DEPT
0060  2 NAME
0070END-DEFINE
0080*
0090LIMIT 10
0100READ EMPLOY-VIEW BY DEPT STARTING FROM 'A'
0110  AT BREAK OF DEPT /4/
0120    SKIP 1
0130  END-BREAK
0140  DISPLAY NOTITLE DEPT NAME
0150END-READ
0160*
0170END
