0010** Example 'CMPEX1': COMPRESS
0020************************************************************************
0030DEFINE DATA LOCAL
00401 EMPLOY-VIEW VIEW OF EMPLOYEES
0050  2 NAME
0060  2 FIRST-NAME
0070  2 MIDDLE-I
0080*
00901 #COMPRESSED-NAME (A20)
0100END-DEFINE
0110*
0120LIMIT 4
0130READ EMPLOY-VIEW BY NAME
0140  COMPRESS FIRST-NAME MIDDLE-I NAME INTO #COMPRESSED-NAME
0150  DISPLAY NOTITLE
0160          FIRST-NAME MIDDLE-I NAME 5X #COMPRESSED-NAME
0170END-READ
0180*
0190END
