0010** Example 'CNTEX1N': CALLNAT  (called by CNTEX1)
0020************************************************************************
0030DEFINE DATA PARAMETER
00401 #FIELDA (N6)
00501 #FIELDB (A20)
00601 #FIELDC (A10)
00701 #FIELDD (A7)
0080END-DEFINE
0090*
0100*
0110#FIELDA := 4711
0120*
0130#FIELDB := 'HALLO'
0140*
0150#FIELDC := 'ABC'
0160*
0170WRITE '=' #FIELDA '=' #FIELDB '=' #FIELDC '=' #FIELDD
0180*
0190END
