0010** Example 'CNTEX1': CALLNAT
0020************************************************************************
0030DEFINE DATA LOCAL
00401 #FIELD1 (N6)
00501 #FIELD2 (A20)
00601 #FIELD3 (A10)
0070END-DEFINE
0080*
0090CALLNAT 'CNTEX1N' #FIELD1 (AD=M) #FIELD2 (AD=O) #FIELD3 'P4 TEXT'
0100*
0110WRITE '=' #FIELD1 '=' #FIELD2 '=' #FIELD3
0120*
0130END
