0010** Example 'CNTEX2': CALLNAT
0020************************************************************************
0030DEFINE DATA LOCAL
00401 #ARRAY1  (N4/1:10,1:10)
00501 #NUM     (N2)
0060END-DEFINE
0070*
0080*
0090CALLNAT 'CNTEX2N' #ARRAY1 (2:5,*)
0100*
0110FOR #NUM 1 TO 10
0120  WRITE #NUM #ARRAY1(#NUM,1:10)
0130END-FOR
0140*
0150END
