0010** Example 'DELEX1': DELETE
0020**
0030** CAUTION: Executing this example will modify the database records!
0040************************************************************************
0050DEFINE DATA LOCAL
00601 EMPLOY-VIEW VIEW OF EMPLOYEES
0070  2 NAME
0080END-DEFINE
0090*
0100FIND EMPLOY-VIEW WITH NAME = 'ALDEN'
0110  /*
0120  DELETE
0130  END TRANSACTION
0140  /*
0150  AT END OF DATA
0160    WRITE NOTITLE *NUMBER 'RECORDS DELETED'
0170  END-ENDDATA
0180END-FIND
0190END
