0010** Example 'DFUEX2': DEFINE FUNCTION
0020************************************************************************
0030DEFINE FUNCTION F#FACTOR
0040  RETURNS (I2/1:3)
0050  DEFINE DATA PARAMETER
0060    1 #VALUE (I2)
0070  END-DEFINE
0080  /*
0090  F#FACTOR(1) := #VALUE * 1
0100  F#FACTOR(2) := #VALUE * 2
0110  F#FACTOR(3) := #VALUE * 3
0120  /*
0130END-FUNCTION
0140*
0150END
