0010** Example 'DISEX7': DISPLAY (with parameters for statement/element)
0020************************************************************************
0030DEFINE DATA LOCAL
00401 EMPL-VIEW VIEW OF EMPLOYEES
0050  2 NAME
0060  2 PERSONNEL-ID
0070  2 TELEPHONE
0080    3 AREA-CODE
0090    3 PHONE
0100END-DEFINE
0110*
0120LIMIT 3
0130READ EMPL-VIEW BY NAME
0140  DISPLAY NOTITLE (AL=16 GC=+ NL=8 SF=3 UC==)
0150          PERSONNEL-ID NAME TELEPHONE (LC=< TC=>)
0160END-READ
0170END
