0010** Example 'DISEX1': DISPLAY (with nX, nT notation)
0020************************************************************************
0030DEFINE DATA LOCAL
00401 EMPL-VIEW VIEW OF EMPLOYEES
0050  2 NAME
0060  2 JOB-TITLE
0070END-DEFINE
0080*
0090LIMIT 4
0100READ EMPL-VIEW BY NAME
0110  DISPLAY NOTITLE 5X NAME 50T JOB-TITLE
0120END-READ
0130*
0140END
