0010** Example 'DISEX5': DISPLAY (horizontal display)
0020************************************************************************
0030DEFINE DATA LOCAL
00401 EMPL-VIEW VIEW OF EMPLOYEES
0050  2 NAME
0060  2 JOB-TITLE
0070  2 SALARY    (1:2)
0080  2 CURR-CODE (1:2)
0090END-DEFINE
0100*
0110LIMIT 4
0120READ EMPL-VIEW BY NAME
0130  DISPLAY NOTITLE NAME JOB-TITLE SALARY (1:2) CURR-CODE (1:2)
0140  SKIP 1
0150END-READ
0160*
0170END
