0010** Example 'DPREX1': DEFINE PRINTER
0020************************************************************************
0030DEFINE DATA LOCAL
00401 EMPL-VIEW VIEW OF EMPLOYEES
0050  2 NAME
0060END-DEFINE
0070*
0080*  USE SESSION WITH DEFINED PRINTER 1
0090*
0100DEFINE PRINTER (INVOICE-LIST=1) OUTPUT 'OUTQ1'
0110LIMIT 5
0120READ EMPL-VIEW BY NAME
0130  WRITE (INVOICE-LIST) NAME
0140END-READ
0150*
0160END
