0010** Example 'DPTEX1': DEFINE PROTOTYPE and function call
0020************************************************************************
0030DEFINE DATA LOCAL
0040  1 #NUM  (I2)
0050END-DEFINE
0060*
0070DEFINE PROTOTYPE F#FACTOR
0080  RETURNS (I2/1:3)
0090  DEFINE DATA PARAMETER
0100    1 #VALUE (I2)
0110  END-DEFINE
0120END-PROTOTYPE
0130*
0140#NUM  := 3
0150*
0160WRITE 'Function call:' F#FACTOR(<#NUM>)(*)
0170*
0180END
