0010** Example 'DPTEX2': DEFINE PROTOTYPE and function call
0020************************************************************************
0030DEFINE DATA LOCAL
0040  1 #NAME (A20)
0050  1 #TEXT (A10)
0060END-DEFINE
0070*
0080DEFINE PROTOTYPE VARIABLE #NAME
0090  RETURNS #RETURN (A1)
0100  DEFINE DATA PARAMETER
0110    1 #IN (A10)
0120  END-DEFINE
0130END-PROTOTYPE
0140*
0150#NAME := 'F#FIRST-CHAR'
0160#TEXT := 'ABCDEFGHIJ'
0170*
0180WRITE 'First character:' #NAME(<#TEXT>)
0190*
0200END
