0010** Example 'DWDEX1': DEFINE WINDOW
0020************************************************************************
0030DEFINE DATA LOCAL
004001 #I (P3)
0050END-DEFINE
0060*
0070SET KEY PF1='%W<<' PF2='%W>>' PF4='%W--' PF5='%W++'
0080*
0090DEFINE WINDOW WIND1
0100       SIZE QUARTER
0110       BASE TOP RIGHT
0120       FRAMED ON POSITION SYMBOL AUTO
0130*
0140SET WINDOW 'WIND1'
0150FOR #I = 1 TO 10
0160  WRITE 25X #I 'THIS IS SOME LONG TEXT' #I
0170END-FOR
0180*
0190END
