0010** Example 'FETEXAD': FETCH (called by FETEX1)
0020************************************************************************
0030DEFINE DATA LOCAL
00401 #PERS-NR (N8)
0050END-DEFINE
0060*
0070INPUT #PERS-NR
0080*
0090WRITE *PROGRAM 'Record added with personnel number:' #PERS-NR
0100*
0110END
