0010** Example 'FNDSOR': FIND (with SORTED BY clause)
0020************************************************************************
0030DEFINE DATA LOCAL
00401 EMPLOY-VIEW VIEW OF EMPLOYEES
0050  2 CITY
0060  2 NAME
0070  2 FIRST-NAME
0080  2 PERSONNEL-ID
0090END-DEFINE
0100*
0110LIMIT 10
0120FIND EMPLOY-VIEW WITH CITY = 'FRANKFURT'
0130                 SORTED BY NAME PERSONNEL-ID
0140  DISPLAY NOTITLE NAME (IS=ON) FIRST-NAME PERSONNEL-ID
0150END-FIND
0160*
0170END
