0010** Example 'FNDVAR': FIND (using *ISN, *NUMBER, *COUNTER)
0020************************************************************************
0030DEFINE DATA LOCAL
00401 EMPLOY-VIEW VIEW OF EMPLOYEES
0050  2 PERSONNEL-ID
0060  2 NAME
0070  2 CITY
0080END-DEFINE
0090*
0100LIMIT 3
0110FIND EMPLOY-VIEW WITH CITY = 'MADRID'
0120  DISPLAY NOTITLE PERSONNEL-ID NAME
0130                  *ISN *NUMBER *COUNTER
0140END-FIND
0150*
0160END
