0010** Example 'FNDWHE': FIND (with WHERE clause)
0020************************************************************************
0030DEFINE DATA LOCAL
00401 EMPLOY-VIEW VIEW OF EMPLOYEES
0050  2 PERSONNEL-ID
0060  2 NAME
0070  2 JOB-TITLE
0080  2 CITY
0090END-DEFINE
0100*
0110FIND EMPLOY-VIEW WITH CITY = 'PARIS'
0120                 WHERE JOB-TITLE = 'INGENIEUR COMMERCIAL'
0130  DISPLAY NOTITLE
0140          CITY JOB-TITLE PERSONNEL-ID NAME
0150END-FIND
0160*
0170END
