0010** Example 'FOREX1S': FOR (structured mode)
0020************************************************************************
0030DEFINE DATA LOCAL
00401 #INDEX (I1)
00501 #ROOT  (N2.7)
0060END-DEFINE
0070*
0080FOR #INDEX 1 TO 5
0090  COMPUTE #ROOT = SQRT (#INDEX)
0100  WRITE NOTITLE '=' #INDEX 3X '=' #ROOT
0110END-FOR
0120*
0130SKIP 1
0140FOR #INDEX 1 TO 5 STEP 2
0150  COMPUTE #ROOT = SQRT (#INDEX)
0160  WRITE '=' #INDEX 3X '=' #ROOT
0170END-FOR
0180*
0190END
