0010** Example 'HSTDSCND': HISTOGRAM (with DESCENDING)
0020***********************************************************************
0030DEFINE DATA LOCAL
00401 EMPL VIEW OF EMPLOYEES
0050  2 NAME
0060END-DEFINE
0070*
0080HISTOGRAM (10) EMPL IN DESCENDING SEQUENCE FOR NAME FROM 'ZZZ'
0090  DISPLAY NAME *NUMBER
0100END-HISTOGRAM
0110END
