0010** Example 'HSTEX1S': HISTOGRAM (structured mode)
0020************************************************************************
0030DEFINE DATA LOCAL
00401 EMPLOY-VIEW VIEW OF EMPLOYEES
0050  2 CITY
0060END-DEFINE
0070*
0080LIMIT 8
0090HISTOGRAM EMPLOY-VIEW CITY STARTING FROM 'M'
0100  DISPLAY NOTITLE
0110          CITY 'NUMBER OF/PERSONS' *NUMBER *COUNTER
0120END-HISTOGRAM
0130*
0140END
