0010** Example 'INCEX2': INCLUDE  (include copycode with parameters)
0020************************************************************************
0030DEFINE DATA LOCAL
00401 EMPL-VIEW VIEW OF EMPLOYEES
0050  2 NAME
0060END-DEFINE
0070*
0080*
0090INCLUDE INCEX2C 'EMPL-VIEW' 'NAME' '''ARCHER''' '20' '''BAILLET'''
0100*
0110END
