0010** Example 'INPEX2': INPUT (with POSITION)
0020************************************************************************
0030DEFINE DATA LOCAL
00401 #START (A30)
0050END-DEFINE
0060*
0070ASSIGN #START = 'EXAM_'
0080*
0090INPUT (AD=M) MARK POSITION 5 IN *#START
0100     / 'PLEASE COMPLETE START VALUE FOR SEARCH'
0110     / 5X #START
0120END
