0010** Example 'INPEX1': INPUT (with DEFINE WINDOW statement)
0020************************************************************************
0030DEFINE DATA LOCAL
00401 #STRING (A15)
0050END-DEFINE
0060*
0070DEFINE WINDOW WIND1
0080  SIZE 10 * 40
0090  BASE 5 / 10
0100  FRAMED ON POSITION TEXT
0110*
0120INPUT WINDOW='WIND1'
0130      'PLEASE ENTER HERE:' / #STRING
0140*
0150END
