0010** Example 'LMTEX2': LIMIT (valid for two database loops)
0020************************************************************************
0030DEFINE DATA LOCAL
00401 EMPLOY-VIEW VIEW OF EMPLOYEES
0050  2 NAME
0060END-DEFINE
0070*
0080LIMIT 3
0090*
0100FIND EMPLOY-VIEW WITH NAME > 'A'
0110  READ EMPLOY-VIEW BY NAME STARTING FROM 'BAKER'
0120    DISPLAY NOTITLE 'CNT(0100)' *COUNTER(0100)
0130                    'CNT(0110)' *COUNTER(0110)
0140  END-READ
0150END-FIND
0160*
0170END
