0010** Example 'LMTEX1': LIMIT
0020************************************************************************
0030DEFINE DATA LOCAL
00401 EMPLOY-VIEW VIEW OF EMPLOYEES
0050  2 PERSONNEL-ID
0060  2 NAME
0070  2 CITY
0080END-DEFINE
0090*
0100LIMIT 4
0110*
0120READ EMPLOY-VIEW BY NAME STARTING FROM 'BAKER'
0130  DISPLAY NOTITLE
0140          NAME PERSONNEL-ID CITY *COUNTER
0150END-READ
0160*
0170END
