0010** Example 'OCC1P': *OCCURRENCE
0020************************************************************************
0030DEFINE DATA LOCAL
00401 #N1 (N7/1:10)
00501 #N2 (N7/1:10,1:10)
00601 #N3 (N7/1:10,1:10,1:10)
0070END-DEFINE
0080*
0090CALLNAT 'OCC1N' #N1(*) #N2(1:2,1:4) #N3(1:6,1:7,1:8)
0100*
0110END
