0010** Example 'PWDEX1': PASSW
0020************************************************************************
0030DEFINE DATA LOCAL
00401 EMPLOY-VIEW VIEW OF EMPLOYEES
0050  2 PERSONNEL-ID
0060  2 NAME
0070END-DEFINE
0080*
0090PASSW='PASSW1'
0100*
0110LIMIT 5
0120READ EMPLOY-VIEW
0130 DISPLAY NOTITLE PERSONNEL-ID NAME
0140END-READ
0150*
0160END
