0010** Example 'READSCND': READ (with DESCENDING SEQUENCE)
0020************************************************************************
0030DEFINE DATA LOCAL
00401 EMPL VIEW OF EMPLOYEES
0050  2 NAME
0060  2 FIRST-NAME
0070  2 BIRTH
0080END-DEFINE
0090*
0100READ (10) EMPL IN DESCENDING SEQUENCE BY NAME FROM 'ZZZ'
0110  DISPLAY *ISN NAME FIRST-NAME BIRTH (EM=YYYY-MM-DD)
0120END-READ
0130END
