0010** Example 'RPTEX2S': REPEAT (with WHILE and UNTIL option)
0020************************************************************************
0030DEFINE DATA LOCAL
00401 #X (I1) INIT <0>
00501 #Y (I1) INIT <0>
0060END-DEFINE
0070*
0080REPEAT WHILE #X <= 5
0090  ADD 1 TO #X
0100  WRITE NOTITLE '=' #X
0110END-REPEAT
0120*
0130SKIP 3
0140REPEAT
0150  ADD 1 TO #Y
0160  WRITE '=' #Y
0170  UNTIL #Y = 6
0180END-REPEAT
0190*
0200END
