0010** Example 'RUNEXFND': RUN (program executed with RUN in RUNEX1)
0020************************************************************************
0030DEFINE DATA
0040GLOBAL
0050  USING RUNEXGDA
0060LOCAL
00701 EMPLOY-VIEW VIEW OF EMPLOYEES
0080  2 NAME
0090  2 CITY
0100END-DEFINE
0110*
0120* &CRITERIA filled with  "NAME = 'xxxxx' AND CITY = 'xxxx'"
0130*
0140FIND NUMBER EMPLOY-VIEW WITH &CRITERIA
0150     RETAIN AS 'EMP-SET'
0160DISPLAY *NUMBER
0170*
0180END
