0010** Example 'SKPEX1': SKIP
0020************************************************************************
0030DEFINE DATA LOCAL
00401 EMPL-VIEW VIEW OF EMPLOYEES
0050  2 CITY
0060  2 COUNTRY
0070  2 NAME
0080END-DEFINE
0090*
0100LIMIT 7
0110READ EMPL-VIEW BY CITY STARTING FROM 'W'
0120  AT BREAK OF CITY
0130    SKIP 2
0140  END-BREAK
0150  DISPLAY NOTITLE CITY (IS=ON) COUNTRY (IS=ON) NAME
0160  /*
0170END-READ
0180END
