0010** Example 'SRTEX2': SORT
0020************************************************************************
0030DEFINE DATA LOCAL
00401 VEHIC-VIEW VIEW OF VEHICLES
0050  2 MAKE
0060  2 YEAR
0070END-DEFINE
0080*
0090LIMIT 10
0100*
0110READ VEHIC-VIEW
0120END-ALL
0130SORT BY MAKE YEAR USING KEY
0140  DISPLAY NOTITLE (AL=15) MAKE (IS=ON) YEAR
0150  AT BREAK OF MAKE
0160    WRITE '-' (20)
0170  END-BREAK
0180END-SORT
0190END
