0010** Example 'STIEX1': SETTIME
0020************************************************************************
0030DEFINE DATA LOCAL
00401 EMPLOY-VIEW VIEW OF EMPLOYEES
0050  2 NAME
0060END-DEFINE
0070*
0080ST. SETTIME
0090WRITE 10X 'START TIME:' *TIME
0100*
0110READ (100) EMPLOY-VIEW BY NAME
0120END-READ
0130*
0140WRITE NOTITLE 10X 'END TIME:  ' *TIME
0150WRITE         10X 'ELAPSED TIME TO READ 100 RECORDS'
0160                  '(HH:II:SS.T) :' *TIMD (ST.) (EM=99:99:99'.'9)
0170*
0180END
