0010** Example 'WRTEX3': WRITE (with T* notation)
0020************************************************************************
0030DEFINE DATA LOCAL
00401 EMPL-VIEW VIEW OF EMPLOYEES
0050  2 NAME
0060  2 CITY
0070  2 SALARY (1)
0080END-DEFINE
0090*
0100LIMIT 5
0110READ EMPL-VIEW BY CITY STARTING FROM 'ALBU'
0120  DISPLAY NOTITLE CITY NAME SALARY (1)
0130  AT BREAK CITY
0140    /*
0150    WRITE / 'CITY AVERAGE:' T*SALARY (1) AVER(SALARY(1)) //
0160    /*
0170  END-BREAK
0180END-READ
0190END
