0010** Example 'WRTEX5': WRITE (using '=', statement/element parameters)
0020************************************************************************
0030DEFINE DATA LOCAL
00401 EMPL-VIEW VIEW OF EMPLOYEES
0050  2 NAME
0060  2 PERSONNEL-ID
0070  2 PHONE
0080END-DEFINE
0090*
0100LIMIT 2
0110READ EMPL-VIEW BY NAME
0120  WRITE NOTITLE (AL=16 NL=8)
0130        '=' PERSONNEL-ID '=' NAME '=' PHONE (AL=10 EM=XXX-XXXXXXX)
0140END-READ
0150END
