0010** Example 'WWFEX1': WRITE WORK FILE
0020************************************************************************
0030DEFINE DATA LOCAL
00401 EMPLOY-VIEW VIEW OF EMPLOYEES
0050  2 PERSONNEL-ID
0060  2 NAME
0070END-DEFINE
0080*
0090FIND EMPLOY-VIEW WITH CITY = 'LONDON'
0100  WRITE WORK FILE 1
0110        PERSONNEL-ID NAME
0120END-FIND
0130*
0140END
