0010* MAP2: PROTOTYPE
0020* INPUT USING MAP 'XXXXXXXX'
0030*     ACCOUNTING.#CC ACCOUNTING.#CPU-SRB ACCOUNTING.#CPU-TCB
0040*     ACCOUNTING.#DD-CARDS ACCOUNTING.#INPUT-CLASS ACCOUNTING.#JOB-NAME
0050*     ACCOUNTING.#JOB-SERVICE ACCOUNTING.#PERFORM ACCOUNTING.#PRIO
0060*     ACCOUNTING.#PROGRAMMER ACCOUNTING.#START-DATE
0070*     ACCOUNTING.#START-TIME ACCOUNTING.#STEPS ACCOUNTING.#STOP-DATE
0080*     ACCOUNTING.#STOP-TIME ACCOUNTING.#STORAGE-KEY
0090*     ACCOUNTING.#SYSTEM-ID ACCOUNTING.#TIME-IN-STORAGE
0100*     ACCOUNTING.#TRANSACTION-TIME ACCOUNTING.#USER
0110DEFINE DATA PARAMETER
01201 ACCOUNTING.#CC (B002)
01301 ACCOUNTING.#CPU-SRB (B003)
01401 ACCOUNTING.#CPU-TCB (B003)
01501 ACCOUNTING.#DD-CARDS (B004)
01601 ACCOUNTING.#INPUT-CLASS (A001)
01701 ACCOUNTING.#JOB-NAME (A008)
01801 ACCOUNTING.#JOB-SERVICE (B004)
01901 ACCOUNTING.#PERFORM (B002)
02001 ACCOUNTING.#PRIO (B001)
02101 ACCOUNTING.#PROGRAMMER (A020)
02201 ACCOUNTING.#START-DATE (P07.0)
02301 ACCOUNTING.#START-TIME (B004)
02401 ACCOUNTING.#STEPS (B001)
02501 ACCOUNTING.#STOP-DATE (P07.0)
02601 ACCOUNTING.#STOP-TIME (B004)
02701 ACCOUNTING.#STORAGE-KEY (B001)
02801 ACCOUNTING.#SYSTEM-ID (A004)
02901 ACCOUNTING.#TIME-IN-STORAGE (B004)
03001 ACCOUNTING.#TRANSACTION-TIME (B004)
03101 ACCOUNTING.#USER (A008)
0320END-DEFINE
0330FORMAT PS=023 LS=080 ZP=OFF SG=OFF KD=OFF IP=OFF
0340* MAP2: MAP PROFILES *****************************        410***********
0350* .TTAA  MOO   D I D I     I D I        ?_)  :+(                       *
0360* 023079        N0NNUCN             X        01 SYSPROF NL           1 *
0370************************************************************************
0380INPUT          (     IP=OFF                                           /*
0390                                                                       )
0400/
0410/
0420/
0430 025T 'DD:'
0440 029T ACCOUNTING.#DD-CARDS  (AD=MILT ) /*.99U008 B004 .
0450 048T 'CPU-SRB:'
0460 057T ACCOUNTING.#CPU-SRB  (AD=MILT ) /*.99U006 B003 .
0470/
0480 025T 'CC:'
0490 029T ACCOUNTING.#CC  (AD=MILT ) /*.99U004 B002 .
0500 048T 'JOB-SERVICE:'
0510 061T ACCOUNTING.#JOB-SERVICE  (AD=MILT ) /*.99U008 B004 .
0520/
0530 001T 'SYSTEM-ID:'
0540 012T ACCOUNTING.#SYSTEM-ID  (AD=MILT ) /*.99U004 A004 .
0550 025T 'PRIO:'
0560 031T ACCOUNTING.#PRIO  (AD=MILT ) /*.99U002 B001 .
0570 048T 'TRANS-TIME:'
0580 060T ACCOUNTING.#TRANSACTION-TIME  (AD=MILT ) /*.99D008 B004 .
0590/
0600 001T 'JOB-NAME:'
0610 011T ACCOUNTING.#JOB-NAME  (AD=MILT ) /*.99U008 A008 .
0620 025T 'ETIME:'
0630 032T ACCOUNTING.#STOP-TIME  (AD=MILT ) /*.99U008 B004 .
0640 048T 'PERFORM:'
0650 057T ACCOUNTING.#PERFORM  (AD=MILT ) /*.99D004 B002 .
0660/
0670 001T 'USER:'
0680 007T ACCOUNTING.#USER  (AD=MILT ) /*.99U008 A008 .
0690 025T 'EDATE:'
0700 032T ACCOUNTING.#STOP-DATE  (AD=MILT ) /*.99U007 P07.0.
0710 048T 'PROGRAMMER:'
0720 060T ACCOUNTING.#PROGRAMMER  (AD=MILT ) /*.99D020 A020 .
0730/
0740 001T 'STEPS:'
0750 008T ACCOUNTING.#STEPS  (AD=MILT ) /*.99U002 B001 .
0760 025T 'STOR-TIME:'
0770 036T ACCOUNTING.#TIME-IN-STORAGE  (AD=MILT ) /*.99U008 B004 .
0780 048T 'CPU-TCB:'
0790 057T ACCOUNTING.#CPU-TCB  (AD=MILT ) /*.99D006 B003 .
0800/
0810 001T 'STIME:'
0820 008T ACCOUNTING.#START-TIME  (AD=MILT ) /*.99U008 B004 .
0830 025T 'INPUT-CLASS:'
0840 038T ACCOUNTING.#INPUT-CLASS  (AD=MILT ) /*.99U001 A001 .
0850/
0860 001T 'SDATE:'
0870 008T ACCOUNTING.#START-DATE  (AD=MILT ) /*.99U007 P07.0.
0880 025T 'STOR-KEY:'
0890 035T ACCOUNTING.#STORAGE-KEY  (AD=MILT ) /*.99U002 B001 .
0900/
0910/
0920/
0930/
0940/
0950/
0960/
0970/
0980/
0990/
1000/
1010/
1020* MAP2: VALIDATION *****************************************************
1030RULEVAR D01ACCOUNTING.#DD-CARDS
1040INCDIR ACCOUNTING                       #05-DD-CARDS                    ;
1050RULEVAR D01ACCOUNTING.#CPU-SRB
1060INCDIR ACCOUNTING                       #05-CPU-SRB                     ;
1070RULEVAR D01ACCOUNTING.#CC
1080INCDIR ACCOUNTING                       #05-CC                          ;
1090RULEVAR D01ACCOUNTING.#JOB-SERVICE
1100INCDIR ACCOUNTING                       #05-JOB-SERVICE                 ;
1110RULEVAR D01ACCOUNTING.#SYSTEM-ID
1120INCDIR ACCOUNTING                       #05-SYSTEM-ID                   ;
1130RULEVAR D01ACCOUNTING.#PRIO
1140INCDIR ACCOUNTING                       #05-PRIO                        ;
1150RULEVAR D01ACCOUNTING.#TRANSACTION-TIME
1160INCDIR ACCOUNTING                       #TRANSACTION-TIME               ;
1170RULEVAR D01ACCOUNTING.#JOB-NAME
1180INCDIR ACCOUNTING                       #05-JOB-NAME                    ;
1190RULEVAR D01ACCOUNTING.#STOP-TIME
1200INCDIR ACCOUNTING                       #05-END-TIME                    ;
1210RULEVAR D01ACCOUNTING.#PERFORM
1220INCDIR ACCOUNTING                       #PERFORM                        ;
1230RULEVAR D01ACCOUNTING.#USER
1240INCDIR ACCOUNTING                       #05-USER                        ;
1250RULEVAR D01ACCOUNTING.#STOP-DATE
1260INCDIR ACCOUNTING                       #05-END-DATE                    ;
1270RULEVAR D01ACCOUNTING.#PROGRAMMER
1280INCDIR ACCOUNTING                       #PROGRAMMER                     ;
1290RULEVAR D01ACCOUNTING.#STEPS
1300INCDIR ACCOUNTING                       #05-STEPS                       ;
1310RULEVAR D01ACCOUNTING.#TIME-IN-STORAGE
1320INCDIR ACCOUNTING                       #05-TIME-IN-STORAGE             ;
1330RULEVAR D01ACCOUNTING.#CPU-TCB
1340INCDIR ACCOUNTING                       #CPU-TCB                        ;
1350RULEVAR D01ACCOUNTING.#START-TIME
1360INCDIR ACCOUNTING                       #05-START-TIME                  ;
1370RULEVAR D01ACCOUNTING.#INPUT-CLASS
1380INCDIR ACCOUNTING                       #05-INPUT-CLASS                 ;
1390RULEVAR D01ACCOUNTING.#START-DATE
1400INCDIR ACCOUNTING                       #05-START-DATE                  ;
1410RULEVAR D01ACCOUNTING.#STORAGE-KEY
1420INCDIR ACCOUNTING                       #05-STORAGE-KEY                 ;
1430* MAP2: END OF MAP *****************************************************
1440END
