0010* MAP2: PROTOTYPE
0020* INPUT USING MAP 'XXXXXXXX'
0030*     ##TITLE #CPU #CVAR #DISPLAY.ACCOUNT-NUMBER(*) #DISPLAY.CPU-M(*)
0040*     #DISPLAY.CPU-USED(*) #DISPLAY.JOB-ID(*) #DISPLAY.JOB-NAME(*)
0050*     #DISPLAY.TYPE(*) #DISPLAY.TYPE-NUMBER(*) #DISPLAY.USER(*)
0060*     #JOB-NAME #USER
0070DEFINE DATA PARAMETER
00801 ##TITLE (A078)
00901 #CPU (N07.2)
01001  #CVAR (C)
01101 #DISPLAY.ACCOUNT-NUMBER (A008/00001:00015)
01201 #DISPLAY.CPU-M (A010/00001:00015)
01301 #DISPLAY.CPU-USED (N07.2/00001:00015)
01401 #DISPLAY.JOB-ID (A005/00001:00015)
01501 #DISPLAY.JOB-NAME (A008/    1:00015)
01601 #DISPLAY.TYPE (A007/00001:00015)
01701 #DISPLAY.TYPE-NUMBER (N01.0/00001:00015)
01801 #DISPLAY.USER (A008/00001:00015)
01901 #JOB-NAME (A008)
02001 #USER (A008)
0210END-DEFINE
0220FORMAT PS=021 LS=080 ZP=OFF SG=OFF KD=ON  IP=OFF
0230* MAP2: MAP PROFILES *****************************        410***********
0240* .TTAAAMMOO   D I D I N D I D I        ?_)¬&:+(                       *
0250* 023079        N0NNUCN             X        01 SYSPROF YL   #CVAR   1 *
0260************************************************************************
0270INPUT          (     CV=#CVAR                                         /*
0280                                                                       )
0290 002T ##TITLE  (AD=ODL ) /*.01D078 A078 .
0300/
0310/
0320 005T 'UserID'
0330 014T 'Job-Name'
0340 024T 'TSN'
0350 030T 'T Type'
0360 040T 'CPU used'
0370 051T 'Account'
0380 060T 'CPU max'
0390/
0400 005T #USER  (AD=MYLT'_' CV=#CVAR ) /*.99D008 A008 .
0410 014T #JOB-NAME  (AD=MYLT'_' CV=#CVAR ) /*.99D008 A008 .
0420 023T '______ _ _______'
0430 040T #CPU  (AD=MYRT'_' CV=#CVAR ) /*.99D010 N07.2.
0440 051T '________ __________'
0450/
0460 005T #DISPLAY.USER (1+000)  (AD=ODL ) /*.01D008 A008 .
0470   /* A1000150000100001000010000100001100015001000001H
0480 014T #DISPLAY.JOB-NAME (1+000)  (AD=ODL ) /*.01D008 A008 .
0490   /* A1000150000100001    10000100001100015001000001H
0500 024T #DISPLAY.JOB-ID (1+000)  (AD=ODL ) /*.01U005 A005 .
0510   /* A1000150000100001    10000100001100015001000001H
0520 030T #DISPLAY.TYPE-NUMBER (1+000)  (AD=ODL ) /*.01U001 N01.0.
0530   /* A1000150000100001    10000100001100015001000001H
0540 032T #DISPLAY.TYPE (1+000)  (AD=ODL ) /*.02D007 A007 .
0550   /* A1000150000100001000010000100001100015001000001H
0560 040T #DISPLAY.CPU-USED (1+000)  (AD=ODR ) /*.01D010 N07.2.
0570   /* A1000150000100001000010000100001100015001000001H
0580 051T #DISPLAY.ACCOUNT-NUMBER (1+000)  (AD=ODR ) /*.01U008 A008 .
0590   /* A1000150000100001    10000100001100015001000001H
0600 060T #DISPLAY.CPU-M (1+000)  (AD=ODR ) /*.01U010 A010 .
0610   /* A1000150000100001    10000100001100015001000001H
0620/
0630 005T #DISPLAY.USER (1+001)  (AD=ODL ) /*.01D008 A008 .
0640 014T #DISPLAY.JOB-NAME (1+001)  (AD=ODL ) /*.01D008 A008 .
0650 024T #DISPLAY.JOB-ID (1+001)  (AD=ODL ) /*.01U005 A005 .
0660 030T #DISPLAY.TYPE-NUMBER (1+001)  (AD=ODL ) /*.01U001 N01.0.
0670 032T #DISPLAY.TYPE (1+001)  (AD=ODL ) /*.02D007 A007 .
0680 040T #DISPLAY.CPU-USED (1+001)  (AD=ODR ) /*.01D010 N07.2.
0690 051T #DISPLAY.ACCOUNT-NUMBER (1+001)  (AD=ODR ) /*.01U008 A008 .
0700 060T #DISPLAY.CPU-M (1+001)  (AD=ODR ) /*.01U010 A010 .
0710/
0720 005T #DISPLAY.USER (1+002)  (AD=ODL ) /*.01D008 A008 .
0730 014T #DISPLAY.JOB-NAME (1+002)  (AD=ODL ) /*.01D008 A008 .
0740 024T #DISPLAY.JOB-ID (1+002)  (AD=ODL ) /*.01U005 A005 .
0750 030T #DISPLAY.TYPE-NUMBER (1+002)  (AD=ODL ) /*.01U001 N01.0.
0760 032T #DISPLAY.TYPE (1+002)  (AD=ODL ) /*.02D007 A007 .
0770 040T #DISPLAY.CPU-USED (1+002)  (AD=ODR ) /*.01D010 N07.2.
0780 051T #DISPLAY.ACCOUNT-NUMBER (1+002)  (AD=ODR ) /*.01U008 A008 .
0790 060T #DISPLAY.CPU-M (1+002)  (AD=ODR ) /*.01U010 A010 .
0800/
0810 005T #DISPLAY.USER (1+003)  (AD=ODL ) /*.01D008 A008 .
0820 014T #DISPLAY.JOB-NAME (1+003)  (AD=ODL ) /*.01D008 A008 .
0830 024T #DISPLAY.JOB-ID (1+003)  (AD=ODL ) /*.01U005 A005 .
0840 030T #DISPLAY.TYPE-NUMBER (1+003)  (AD=ODL ) /*.01U001 N01.0.
0850 032T #DISPLAY.TYPE (1+003)  (AD=ODL ) /*.02D007 A007 .
0860 040T #DISPLAY.CPU-USED (1+003)  (AD=ODR ) /*.01D010 N07.2.
0870 051T #DISPLAY.ACCOUNT-NUMBER (1+003)  (AD=ODR ) /*.01U008 A008 .
0880 060T #DISPLAY.CPU-M (1+003)  (AD=ODR ) /*.01U010 A010 .
0890/
0900 005T #DISPLAY.USER (1+004)  (AD=ODL ) /*.01D008 A008 .
0910 014T #DISPLAY.JOB-NAME (1+004)  (AD=ODL ) /*.01D008 A008 .
0920 024T #DISPLAY.JOB-ID (1+004)  (AD=ODL ) /*.01U005 A005 .
0930 030T #DISPLAY.TYPE-NUMBER (1+004)  (AD=ODL ) /*.01U001 N01.0.
0940 032T #DISPLAY.TYPE (1+004)  (AD=ODL ) /*.02D007 A007 .
0950 040T #DISPLAY.CPU-USED (1+004)  (AD=ODR ) /*.01D010 N07.2.
0960 051T #DISPLAY.ACCOUNT-NUMBER (1+004)  (AD=ODR ) /*.01U008 A008 .
0970 060T #DISPLAY.CPU-M (1+004)  (AD=ODR ) /*.01U010 A010 .
0980/
0990 005T #DISPLAY.USER (1+005)  (AD=ODL ) /*.01D008 A008 .
1000 014T #DISPLAY.JOB-NAME (1+005)  (AD=ODL ) /*.01D008 A008 .
1010 024T #DISPLAY.JOB-ID (1+005)  (AD=ODL ) /*.01U005 A005 .
1020 030T #DISPLAY.TYPE-NUMBER (1+005)  (AD=ODL ) /*.01U001 N01.0.
1030 032T #DISPLAY.TYPE (1+005)  (AD=ODL ) /*.02D007 A007 .
1040 040T #DISPLAY.CPU-USED (1+005)  (AD=ODR ) /*.01D010 N07.2.
1050 051T #DISPLAY.ACCOUNT-NUMBER (1+005)  (AD=ODR ) /*.01U008 A008 .
1060 060T #DISPLAY.CPU-M (1+005)  (AD=ODR ) /*.01U010 A010 .
1070/
1080 005T #DISPLAY.USER (1+006)  (AD=ODL ) /*.01D008 A008 .
1090 014T #DISPLAY.JOB-NAME (1+006)  (AD=ODL ) /*.01D008 A008 .
1100 024T #DISPLAY.JOB-ID (1+006)  (AD=ODL ) /*.01U005 A005 .
1110 030T #DISPLAY.TYPE-NUMBER (1+006)  (AD=ODL ) /*.01U001 N01.0.
1120 032T #DISPLAY.TYPE (1+006)  (AD=ODL ) /*.02D007 A007 .
1130 040T #DISPLAY.CPU-USED (1+006)  (AD=ODR ) /*.01D010 N07.2.
1140 051T #DISPLAY.ACCOUNT-NUMBER (1+006)  (AD=ODR ) /*.01U008 A008 .
1150 060T #DISPLAY.CPU-M (1+006)  (AD=ODR ) /*.01U010 A010 .
1160/
1170 005T #DISPLAY.USER (1+007)  (AD=ODL ) /*.01D008 A008 .
1180 014T #DISPLAY.JOB-NAME (1+007)  (AD=ODL ) /*.01D008 A008 .
1190 024T #DISPLAY.JOB-ID (1+007)  (AD=ODL ) /*.01U005 A005 .
1200 030T #DISPLAY.TYPE-NUMBER (1+007)  (AD=ODL ) /*.01U001 N01.0.
1210 032T #DISPLAY.TYPE (1+007)  (AD=ODL ) /*.02D007 A007 .
1220 040T #DISPLAY.CPU-USED (1+007)  (AD=ODR ) /*.01D010 N07.2.
1230 051T #DISPLAY.ACCOUNT-NUMBER (1+007)  (AD=ODR ) /*.01U008 A008 .
1240 060T #DISPLAY.CPU-M (1+007)  (AD=ODR ) /*.01U010 A010 .
1250/
1260 005T #DISPLAY.USER (1+008)  (AD=ODL ) /*.01D008 A008 .
1270 014T #DISPLAY.JOB-NAME (1+008)  (AD=ODL ) /*.01D008 A008 .
1280 024T #DISPLAY.JOB-ID (1+008)  (AD=ODL ) /*.01U005 A005 .
1290 030T #DISPLAY.TYPE-NUMBER (1+008)  (AD=ODL ) /*.01U001 N01.0.
1300 032T #DISPLAY.TYPE (1+008)  (AD=ODL ) /*.02D007 A007 .
1310 040T #DISPLAY.CPU-USED (1+008)  (AD=ODR ) /*.01D010 N07.2.
1320 051T #DISPLAY.ACCOUNT-NUMBER (1+008)  (AD=ODR ) /*.01U008 A008 .
1330 060T #DISPLAY.CPU-M (1+008)  (AD=ODR ) /*.01U010 A010 .
1340/
1350 005T #DISPLAY.USER (1+009)  (AD=ODL ) /*.01D008 A008 .
1360 014T #DISPLAY.JOB-NAME (1+009)  (AD=ODL ) /*.01D008 A008 .
1370 024T #DISPLAY.JOB-ID (1+009)  (AD=ODL ) /*.01U005 A005 .
1380 030T #DISPLAY.TYPE-NUMBER (1+009)  (AD=ODL ) /*.01U001 N01.0.
1390 032T #DISPLAY.TYPE (1+009)  (AD=ODL ) /*.02D007 A007 .
1400 040T #DISPLAY.CPU-USED (1+009)  (AD=ODR ) /*.01D010 N07.2.
1410 051T #DISPLAY.ACCOUNT-NUMBER (1+009)  (AD=ODR ) /*.01U008 A008 .
1420 060T #DISPLAY.CPU-M (1+009)  (AD=ODR ) /*.01U010 A010 .
1430/
1440 005T #DISPLAY.USER (1+010)  (AD=ODL ) /*.01D008 A008 .
1450 014T #DISPLAY.JOB-NAME (1+010)  (AD=ODL ) /*.01D008 A008 .
1460 024T #DISPLAY.JOB-ID (1+010)  (AD=ODL ) /*.01U005 A005 .
1470 030T #DISPLAY.TYPE-NUMBER (1+010)  (AD=ODL ) /*.01U001 N01.0.
1480 032T #DISPLAY.TYPE (1+010)  (AD=ODL ) /*.02D007 A007 .
1490 040T #DISPLAY.CPU-USED (1+010)  (AD=ODR ) /*.01D010 N07.2.
1500 051T #DISPLAY.ACCOUNT-NUMBER (1+010)  (AD=ODR ) /*.01U008 A008 .
1510 060T #DISPLAY.CPU-M (1+010)  (AD=ODR ) /*.01U010 A010 .
1520/
1530 005T #DISPLAY.USER (1+011)  (AD=ODL ) /*.01D008 A008 .
1540 014T #DISPLAY.JOB-NAME (1+011)  (AD=ODL ) /*.01D008 A008 .
1550 024T #DISPLAY.JOB-ID (1+011)  (AD=ODL ) /*.01U005 A005 .
1560 030T #DISPLAY.TYPE-NUMBER (1+011)  (AD=ODL ) /*.01U001 N01.0.
1570 032T #DISPLAY.TYPE (1+011)  (AD=ODL ) /*.02D007 A007 .
1580 040T #DISPLAY.CPU-USED (1+011)  (AD=ODR ) /*.01D010 N07.2.
1590 051T #DISPLAY.ACCOUNT-NUMBER (1+011)  (AD=ODR ) /*.01U008 A008 .
1600 060T #DISPLAY.CPU-M (1+011)  (AD=ODR ) /*.01U010 A010 .
1610/
1620 005T #DISPLAY.USER (1+012)  (AD=ODL ) /*.01D008 A008 .
1630 014T #DISPLAY.JOB-NAME (1+012)  (AD=ODL ) /*.01D008 A008 .
1640 024T #DISPLAY.JOB-ID (1+012)  (AD=ODL ) /*.01U005 A005 .
1650 030T #DISPLAY.TYPE-NUMBER (1+012)  (AD=ODL ) /*.01U001 N01.0.
1660 032T #DISPLAY.TYPE (1+012)  (AD=ODL ) /*.02D007 A007 .
1670 040T #DISPLAY.CPU-USED (1+012)  (AD=ODR ) /*.01D010 N07.2.
1680 051T #DISPLAY.ACCOUNT-NUMBER (1+012)  (AD=ODR ) /*.01U008 A008 .
1690 060T #DISPLAY.CPU-M (1+012)  (AD=ODR ) /*.01U010 A010 .
1700/
1710 005T #DISPLAY.USER (1+013)  (AD=ODL ) /*.01D008 A008 .
1720 014T #DISPLAY.JOB-NAME (1+013)  (AD=ODL ) /*.01D008 A008 .
1730 024T #DISPLAY.JOB-ID (1+013)  (AD=ODL ) /*.01U005 A005 .
1740 030T #DISPLAY.TYPE-NUMBER (1+013)  (AD=ODL ) /*.01U001 N01.0.
1750 032T #DISPLAY.TYPE (1+013)  (AD=ODL ) /*.02D007 A007 .
1760 040T #DISPLAY.CPU-USED (1+013)  (AD=ODR ) /*.01D010 N07.2.
1770 051T #DISPLAY.ACCOUNT-NUMBER (1+013)  (AD=ODR ) /*.01U008 A008 .
1780 060T #DISPLAY.CPU-M (1+013)  (AD=ODR ) /*.01U010 A010 .
1790/
1800 005T #DISPLAY.USER (1+014)  (AD=ODL ) /*.01D008 A008 .
1810 014T #DISPLAY.JOB-NAME (1+014)  (AD=ODL ) /*.01D008 A008 .
1820 024T #DISPLAY.JOB-ID (1+014)  (AD=ODL ) /*.01U005 A005 .
1830 030T #DISPLAY.TYPE-NUMBER (1+014)  (AD=ODL ) /*.01U001 N01.0.
1840 032T #DISPLAY.TYPE (1+014)  (AD=ODL ) /*.02D007 A007 .
1850 040T #DISPLAY.CPU-USED (1+014)  (AD=ODR ) /*.01D010 N07.2.
1860 051T #DISPLAY.ACCOUNT-NUMBER (1+014)  (AD=ODR ) /*.01U008 A008 .
1870 060T #DISPLAY.CPU-M (1+014)  (AD=ODR ) /*.01U010 A010 .
1880/
1890/
1900* MAP2: VALIDATION *****************************************************
1910* MAP2: END OF MAP *****************************************************
1920END
