0010* MAP2: PROTOTYPE
0020* INPUT USING MAP 'XXXXXXXX'
0030*     ##TITLE #CPU #CVAR #DISPLAY.ACCOUNT-NUMBER(*) #DISPLAY.CPU-M(*)
0040*     #DISPLAY.CPU-USED(*) #DISPLAY.JOB-ID(*) #DISPLAY.JOB-NAME(*)
0050*     #DISPLAY.TYPE(*) #DISPLAY.TYPE-NUMBER(*) #DISPLAY.USER(*)
0060*     #JOB-NAME #USER
0070DEFINE DATA PARAMETER
00801 ##TITLE (A078)
00901 #CPU (N07.2)
01001  #CVAR (C)
01101 #DISPLAY.ACCOUNT-NUMBER (A008/00001:00015)
01201 #DISPLAY.CPU-M (A010/00001:00015)
01301 #DISPLAY.CPU-USED (N07.2/00001:00015)
01401 #DISPLAY.JOB-ID (A005/00001:00015)
01501 #DISPLAY.JOB-NAME (A008/    1:00015)
01601 #DISPLAY.TYPE (A007/00001:00015)
01701 #DISPLAY.TYPE-NUMBER (N01.0/00001:00015)
01801 #DISPLAY.USER (A008/00001:00015)
01901 #JOB-NAME (A008)
02001 #USER (A008)
0210END-DEFINE
0220FORMAT PS=021 LS=080 ZP=OFF SG=OFF KD=ON  IP=OFF
0230* MAP2: MAP PROFILES *****************************        410***********
0240* .TTAAAMMOO   D I D I N D I D I        ?_)¬&:+(                       *
0250* 023079        N0NNUCN             X        01 SYSPROF YL   #CVAR   1 *
0260************************************************************************
0270INPUT          (     CV=#CVAR                                         /*
0280                                                                       )
0290 002T ##TITLE  (AD=ODL ) /*.01D078 A078 .
0300/
0310/
0320 005T 'UserID'
0330 014T 'Job-Name TSN'
0340 030T 'T Typ'
0350 040T 'CPU verbr. Account'
0360 060T 'CPU max.'
0370/
0380 005T #USER  (AD=MYLT'_' CV=#CVAR ) /*.99D008 A008 .
0390 014T #JOB-NAME  (AD=MYLT'_' CV=#CVAR ) /*.99D008 A008 .
0400 023T '______ _ _______'
0410 040T #CPU  (AD=MYRT'_' CV=#CVAR ) /*.99D010 N07.2.
0420 051T '________ __________'
0430/
0440 005T #DISPLAY.USER (1+000)  (AD=ODL ) /*.01D008 A008 .
0450   /* A1000150000100001000010000100001100015001000001H
0460 014T #DISPLAY.JOB-NAME (1+000)  (AD=ODL ) /*.01D008 A008 .
0470   /* A1000150000100001    10000100001100015001000001H
0480 024T #DISPLAY.JOB-ID (1+000)  (AD=ODL ) /*.01U005 A005 .
0490   /* A1000150000100001    10000100001100015001000001H
0500 030T #DISPLAY.TYPE-NUMBER (1+000)  (AD=ODL ) /*.01U001 N01.0.
0510   /* A1000150000100001    10000100001100015001000001H
0520 032T #DISPLAY.TYPE (1+000)  (AD=ODL ) /*.02D007 A007 .
0530   /* A1000150000100001000010000100001100015001000001H
0540 040T #DISPLAY.CPU-USED (1+000)  (AD=ODR ) /*.01D010 N07.2.
0550   /* A1000150000100001000010000100001100015001000001H
0560 051T #DISPLAY.ACCOUNT-NUMBER (1+000)  (AD=ODR ) /*.01U008 A008 .
0570   /* A1000150000100001    10000100001100015001000001H
0580 060T #DISPLAY.CPU-M (1+000)  (AD=ODR ) /*.01U010 A010 .
0590   /* A1000150000100001    10000100001100015001000001H
0600/
0610 005T #DISPLAY.USER (1+001)  (AD=ODL ) /*.01D008 A008 .
0620 014T #DISPLAY.JOB-NAME (1+001)  (AD=ODL ) /*.01D008 A008 .
0630 024T #DISPLAY.JOB-ID (1+001)  (AD=ODL ) /*.01U005 A005 .
0640 030T #DISPLAY.TYPE-NUMBER (1+001)  (AD=ODL ) /*.01U001 N01.0.
0650 032T #DISPLAY.TYPE (1+001)  (AD=ODL ) /*.02D007 A007 .
0660 040T #DISPLAY.CPU-USED (1+001)  (AD=ODR ) /*.01D010 N07.2.
0670 051T #DISPLAY.ACCOUNT-NUMBER (1+001)  (AD=ODR ) /*.01U008 A008 .
0680 060T #DISPLAY.CPU-M (1+001)  (AD=ODR ) /*.01U010 A010 .
0690/
0700 005T #DISPLAY.USER (1+002)  (AD=ODL ) /*.01D008 A008 .
0710 014T #DISPLAY.JOB-NAME (1+002)  (AD=ODL ) /*.01D008 A008 .
0720 024T #DISPLAY.JOB-ID (1+002)  (AD=ODL ) /*.01U005 A005 .
0730 030T #DISPLAY.TYPE-NUMBER (1+002)  (AD=ODL ) /*.01U001 N01.0.
0740 032T #DISPLAY.TYPE (1+002)  (AD=ODL ) /*.02D007 A007 .
0750 040T #DISPLAY.CPU-USED (1+002)  (AD=ODR ) /*.01D010 N07.2.
0760 051T #DISPLAY.ACCOUNT-NUMBER (1+002)  (AD=ODR ) /*.01U008 A008 .
0770 060T #DISPLAY.CPU-M (1+002)  (AD=ODR ) /*.01U010 A010 .
0780/
0790 005T #DISPLAY.USER (1+003)  (AD=ODL ) /*.01D008 A008 .
0800 014T #DISPLAY.JOB-NAME (1+003)  (AD=ODL ) /*.01D008 A008 .
0810 024T #DISPLAY.JOB-ID (1+003)  (AD=ODL ) /*.01U005 A005 .
0820 030T #DISPLAY.TYPE-NUMBER (1+003)  (AD=ODL ) /*.01U001 N01.0.
0830 032T #DISPLAY.TYPE (1+003)  (AD=ODL ) /*.02D007 A007 .
0840 040T #DISPLAY.CPU-USED (1+003)  (AD=ODR ) /*.01D010 N07.2.
0850 051T #DISPLAY.ACCOUNT-NUMBER (1+003)  (AD=ODR ) /*.01U008 A008 .
0860 060T #DISPLAY.CPU-M (1+003)  (AD=ODR ) /*.01U010 A010 .
0870/
0880 005T #DISPLAY.USER (1+004)  (AD=ODL ) /*.01D008 A008 .
0890 014T #DISPLAY.JOB-NAME (1+004)  (AD=ODL ) /*.01D008 A008 .
0900 024T #DISPLAY.JOB-ID (1+004)  (AD=ODL ) /*.01U005 A005 .
0910 030T #DISPLAY.TYPE-NUMBER (1+004)  (AD=ODL ) /*.01U001 N01.0.
0920 032T #DISPLAY.TYPE (1+004)  (AD=ODL ) /*.02D007 A007 .
0930 040T #DISPLAY.CPU-USED (1+004)  (AD=ODR ) /*.01D010 N07.2.
0940 051T #DISPLAY.ACCOUNT-NUMBER (1+004)  (AD=ODR ) /*.01U008 A008 .
0950 060T #DISPLAY.CPU-M (1+004)  (AD=ODR ) /*.01U010 A010 .
0960/
0970 005T #DISPLAY.USER (1+005)  (AD=ODL ) /*.01D008 A008 .
0980 014T #DISPLAY.JOB-NAME (1+005)  (AD=ODL ) /*.01D008 A008 .
0990 024T #DISPLAY.JOB-ID (1+005)  (AD=ODL ) /*.01U005 A005 .
1000 030T #DISPLAY.TYPE-NUMBER (1+005)  (AD=ODL ) /*.01U001 N01.0.
1010 032T #DISPLAY.TYPE (1+005)  (AD=ODL ) /*.02D007 A007 .
1020 040T #DISPLAY.CPU-USED (1+005)  (AD=ODR ) /*.01D010 N07.2.
1030 051T #DISPLAY.ACCOUNT-NUMBER (1+005)  (AD=ODR ) /*.01U008 A008 .
1040 060T #DISPLAY.CPU-M (1+005)  (AD=ODR ) /*.01U010 A010 .
1050/
1060 005T #DISPLAY.USER (1+006)  (AD=ODL ) /*.01D008 A008 .
1070 014T #DISPLAY.JOB-NAME (1+006)  (AD=ODL ) /*.01D008 A008 .
1080 024T #DISPLAY.JOB-ID (1+006)  (AD=ODL ) /*.01U005 A005 .
1090 030T #DISPLAY.TYPE-NUMBER (1+006)  (AD=ODL ) /*.01U001 N01.0.
1100 032T #DISPLAY.TYPE (1+006)  (AD=ODL ) /*.02D007 A007 .
1110 040T #DISPLAY.CPU-USED (1+006)  (AD=ODR ) /*.01D010 N07.2.
1120 051T #DISPLAY.ACCOUNT-NUMBER (1+006)  (AD=ODR ) /*.01U008 A008 .
1130 060T #DISPLAY.CPU-M (1+006)  (AD=ODR ) /*.01U010 A010 .
1140/
1150 005T #DISPLAY.USER (1+007)  (AD=ODL ) /*.01D008 A008 .
1160 014T #DISPLAY.JOB-NAME (1+007)  (AD=ODL ) /*.01D008 A008 .
1170 024T #DISPLAY.JOB-ID (1+007)  (AD=ODL ) /*.01U005 A005 .
1180 030T #DISPLAY.TYPE-NUMBER (1+007)  (AD=ODL ) /*.01U001 N01.0.
1190 032T #DISPLAY.TYPE (1+007)  (AD=ODL ) /*.02D007 A007 .
1200 040T #DISPLAY.CPU-USED (1+007)  (AD=ODR ) /*.01D010 N07.2.
1210 051T #DISPLAY.ACCOUNT-NUMBER (1+007)  (AD=ODR ) /*.01U008 A008 .
1220 060T #DISPLAY.CPU-M (1+007)  (AD=ODR ) /*.01U010 A010 .
1230/
1240 005T #DISPLAY.USER (1+008)  (AD=ODL ) /*.01D008 A008 .
1250 014T #DISPLAY.JOB-NAME (1+008)  (AD=ODL ) /*.01D008 A008 .
1260 024T #DISPLAY.JOB-ID (1+008)  (AD=ODL ) /*.01U005 A005 .
1270 030T #DISPLAY.TYPE-NUMBER (1+008)  (AD=ODL ) /*.01U001 N01.0.
1280 032T #DISPLAY.TYPE (1+008)  (AD=ODL ) /*.02D007 A007 .
1290 040T #DISPLAY.CPU-USED (1+008)  (AD=ODR ) /*.01D010 N07.2.
1300 051T #DISPLAY.ACCOUNT-NUMBER (1+008)  (AD=ODR ) /*.01U008 A008 .
1310 060T #DISPLAY.CPU-M (1+008)  (AD=ODR ) /*.01U010 A010 .
1320/
1330 005T #DISPLAY.USER (1+009)  (AD=ODL ) /*.01D008 A008 .
1340 014T #DISPLAY.JOB-NAME (1+009)  (AD=ODL ) /*.01D008 A008 .
1350 024T #DISPLAY.JOB-ID (1+009)  (AD=ODL ) /*.01U005 A005 .
1360 030T #DISPLAY.TYPE-NUMBER (1+009)  (AD=ODL ) /*.01U001 N01.0.
1370 032T #DISPLAY.TYPE (1+009)  (AD=ODL ) /*.02D007 A007 .
1380 040T #DISPLAY.CPU-USED (1+009)  (AD=ODR ) /*.01D010 N07.2.
1390 051T #DISPLAY.ACCOUNT-NUMBER (1+009)  (AD=ODR ) /*.01U008 A008 .
1400 060T #DISPLAY.CPU-M (1+009)  (AD=ODR ) /*.01U010 A010 .
1410/
1420 005T #DISPLAY.USER (1+010)  (AD=ODL ) /*.01D008 A008 .
1430 014T #DISPLAY.JOB-NAME (1+010)  (AD=ODL ) /*.01D008 A008 .
1440 024T #DISPLAY.JOB-ID (1+010)  (AD=ODL ) /*.01U005 A005 .
1450 030T #DISPLAY.TYPE-NUMBER (1+010)  (AD=ODL ) /*.01U001 N01.0.
1460 032T #DISPLAY.TYPE (1+010)  (AD=ODL ) /*.02D007 A007 .
1470 040T #DISPLAY.CPU-USED (1+010)  (AD=ODR ) /*.01D010 N07.2.
1480 051T #DISPLAY.ACCOUNT-NUMBER (1+010)  (AD=ODR ) /*.01U008 A008 .
1490 060T #DISPLAY.CPU-M (1+010)  (AD=ODR ) /*.01U010 A010 .
1500/
1510 005T #DISPLAY.USER (1+011)  (AD=ODL ) /*.01D008 A008 .
1520 014T #DISPLAY.JOB-NAME (1+011)  (AD=ODL ) /*.01D008 A008 .
1530 024T #DISPLAY.JOB-ID (1+011)  (AD=ODL ) /*.01U005 A005 .
1540 030T #DISPLAY.TYPE-NUMBER (1+011)  (AD=ODL ) /*.01U001 N01.0.
1550 032T #DISPLAY.TYPE (1+011)  (AD=ODL ) /*.02D007 A007 .
1560 040T #DISPLAY.CPU-USED (1+011)  (AD=ODR ) /*.01D010 N07.2.
1570 051T #DISPLAY.ACCOUNT-NUMBER (1+011)  (AD=ODR ) /*.01U008 A008 .
1580 060T #DISPLAY.CPU-M (1+011)  (AD=ODR ) /*.01U010 A010 .
1590/
1600 005T #DISPLAY.USER (1+012)  (AD=ODL ) /*.01D008 A008 .
1610 014T #DISPLAY.JOB-NAME (1+012)  (AD=ODL ) /*.01D008 A008 .
1620 024T #DISPLAY.JOB-ID (1+012)  (AD=ODL ) /*.01U005 A005 .
1630 030T #DISPLAY.TYPE-NUMBER (1+012)  (AD=ODL ) /*.01U001 N01.0.
1640 032T #DISPLAY.TYPE (1+012)  (AD=ODL ) /*.02D007 A007 .
1650 040T #DISPLAY.CPU-USED (1+012)  (AD=ODR ) /*.01D010 N07.2.
1660 051T #DISPLAY.ACCOUNT-NUMBER (1+012)  (AD=ODR ) /*.01U008 A008 .
1670 060T #DISPLAY.CPU-M (1+012)  (AD=ODR ) /*.01U010 A010 .
1680/
1690 005T #DISPLAY.USER (1+013)  (AD=ODL ) /*.01D008 A008 .
1700 014T #DISPLAY.JOB-NAME (1+013)  (AD=ODL ) /*.01D008 A008 .
1710 024T #DISPLAY.JOB-ID (1+013)  (AD=ODL ) /*.01U005 A005 .
1720 030T #DISPLAY.TYPE-NUMBER (1+013)  (AD=ODL ) /*.01U001 N01.0.
1730 032T #DISPLAY.TYPE (1+013)  (AD=ODL ) /*.02D007 A007 .
1740 040T #DISPLAY.CPU-USED (1+013)  (AD=ODR ) /*.01D010 N07.2.
1750 051T #DISPLAY.ACCOUNT-NUMBER (1+013)  (AD=ODR ) /*.01U008 A008 .
1760 060T #DISPLAY.CPU-M (1+013)  (AD=ODR ) /*.01U010 A010 .
1770/
1780 005T #DISPLAY.USER (1+014)  (AD=ODL ) /*.01D008 A008 .
1790 014T #DISPLAY.JOB-NAME (1+014)  (AD=ODL ) /*.01D008 A008 .
1800 024T #DISPLAY.JOB-ID (1+014)  (AD=ODL ) /*.01U005 A005 .
1810 030T #DISPLAY.TYPE-NUMBER (1+014)  (AD=ODL ) /*.01U001 N01.0.
1820 032T #DISPLAY.TYPE (1+014)  (AD=ODL ) /*.02D007 A007 .
1830 040T #DISPLAY.CPU-USED (1+014)  (AD=ODR ) /*.01D010 N07.2.
1840 051T #DISPLAY.ACCOUNT-NUMBER (1+014)  (AD=ODR ) /*.01U008 A008 .
1850 060T #DISPLAY.CPU-M (1+014)  (AD=ODR ) /*.01U010 A010 .
1860/
1870/
1880* MAP2: VALIDATION *****************************************************
1890* MAP2: END OF MAP *****************************************************
1900END
