0010*
0020* Data set allocation
0030*
0040DEFINE DATA GLOBAL USING TUTO
0050            LOCAL  USING BALLOC-L
0060            LOCAL
0070*
008001 #DSNAME                  (A54)
009001 #VOLSER                  (A6)
010001 #PASSWORD                (A8)
011001 #RECFM                   (A4)
012001 #LRECL                   (N5)
013001 #BLKSIZE                 (N5)
014001 #BLOCK-CONTROL           (A6)
015001 #PRIMARY-ALLOCATION      (N7)
016001 #SECONDARY-ALLOCATION    (N7)
017001 #ISAM-KEY-POSITION       (N5)
018001 #ISAM-KEY-LENGTH         (N5)
019001 #DSORG                   (A4)
020001 #REPLACE                 (A3)
021001 #ALLOCATION-TYPE         (A4)
022001 #PRODUCT                 (A1)
0230END-DEFINE
0240PERFORM PF-KEY
0250*
0260* ------------------------------ MAIN LOOP ----------------------------
0270*
0280REPEAT
0290  PERFORM SCREEN-IO
0300  PROCESS FILE-ALLOCATE
0310          USING NODE                  = ##NODE
0320            ,   DSNAME                = #DSNAME
0330            ,   DSORG                 = #DSORG
0340            ,   REPLACE               = #REPLACE
0350            ,   VOLSER                = #VOLSER
0360            ,   RECFM                 = #RECFM
0370            ,   LRECL                 = #LRECL
0380            ,   BLKSIZE               = #BLKSIZE
0390            ,   ALLOCATION-TYPE       = #ALLOCATION-TYPE
0400            ,   PRIMARY-ALLOCATION    = #PRIMARY-ALLOCATION
0410            ,   SECONDARY-ALLOCATION  = #SECONDARY-ALLOCATION
0420            ,   ISAM-KEY-POSITION     = #ISAM-KEY-POSITION
0430            ,   ISAM-KEY-LENGTH       = #ISAM-KEY-LENGTH
0440            ,   BLOCK-CONTROL         = #BLOCK-CONTROL
0450            ,   PRODUCT               = #PRODUCT
0460         GIVING ERROR-CODE
0470                ERROR-TEXT
0480                SYSTEM-CODE
0490  IF ERROR-CODE NE 0
0500     INCLUDE BERR---C
0510    ELSE
0520     ASSIGN ##MSG-NR = 1007
0530  END-IF
0540END-REPEAT
0550*
0560* ------------------------------ SCREEN-IO ----------------------------
0570*
0580DEFINE SUBROUTINE SCREEN-IO
0590INPUT WITH TEXT *##MSG-NR,
0600                 ##MSG-TXT1,
0610                 ##MSG-TXT2
0620      USING MAP 'BALLOC-&'
0630RESET ##MSG
0640END-SUBROUTINE
0650*
0660* ------------------------------ PF-KEY -------------------------------
0670*
0680INCLUDE C-PFKEY
0690END
