0010* MAP2: PROTOTYPE
0020* INPUT USING MAP 'XXXXXXXX'
0030*     ##TITLE #CREATION-DATE #CVAR #DISPLAY.CREATION-DATE(*)
0040*     #DISPLAY.DSNAME(*) #DISPLAY.DSORG(*) #DISPLAY.VOLSER(*) #DSNAME
0050DEFINE DATA PARAMETER
00601 ##TITLE (A078)
00701 #CREATION-DATE (A009)
00801  #CVAR (C)
00901 #DISPLAY.CREATION-DATE (A008/    1:00015)
01001 #DISPLAY.DSNAME (A054/    1:00015)
01101 #DISPLAY.DSORG (A004/00001:00015)
01201 #DISPLAY.VOLSER (A006/    1:00015)
01301 #DSNAME (A054)
0140END-DEFINE
0150FORMAT PS=021 LS=080 ZP=OFF SG=OFF KD=ON  IP=OFF
0160* MAP2: MAP PROFILES *****************************        410***********
0170* .TTAAAMMOO   D I D I N D I D I        ?_)¬&:+(                       *
0180* 023079        N0NNUCN             X        01 SYSPROF YL   #CVAR   1 *
0190************************************************************************
0200INPUT          (     CV=#CVAR                                         /*
0210                                                                       )
0220 002T ##TITLE  (AD=ODL ) /*.01D078 A078 .
0230/
0240/
0250 002T 'Dateiname'
0260 057T 'Volume FCB'
0270 069T 'erzeugt am'
0280/
0290 002T #DSNAME  (AD=MYLT'_' CV=#CVAR ) /*.99D054 A054 .
0300 057T '______ ____'
0310 069T #CREATION-DATE  (AD=MYLT'_' CV=#CVAR ) /*.99D009 A009 .
0320/
0330 002T #DISPLAY.DSNAME (1+000)  (AD=ODL ) /*.01D054 A054 .
0340   /* A1000150000100001    10000100001100015001000001H
0350 057T #DISPLAY.VOLSER (1+000)  (AD=ODL ) /*.01D006 A006 .
0360   /* A1000150000100001    10000100001100015001000001H
0370 064T #DISPLAY.DSORG (1+000)  (AD=ODL ) /*.01U004 A004 .
0380   /* A1000150000100001    10000100001100015001000001H
0390 070T #DISPLAY.CREATION-DATE (1+000)  (AD=ODL ) /*.01D008 A008 .
0400   /* A1000150000100001    10000100001100015001000001H
0410/
0420 002T #DISPLAY.DSNAME (1+001)  (AD=ODL ) /*.01D054 A054 .
0430 057T #DISPLAY.VOLSER (1+001)  (AD=ODL ) /*.01D006 A006 .
0440 064T #DISPLAY.DSORG (1+001)  (AD=ODL ) /*.01U004 A004 .
0450 070T #DISPLAY.CREATION-DATE (1+001)  (AD=ODL ) /*.01D008 A008 .
0460/
0470 002T #DISPLAY.DSNAME (1+002)  (AD=ODL ) /*.01D054 A054 .
0480 057T #DISPLAY.VOLSER (1+002)  (AD=ODL ) /*.01D006 A006 .
0490 064T #DISPLAY.DSORG (1+002)  (AD=ODL ) /*.01U004 A004 .
0500 070T #DISPLAY.CREATION-DATE (1+002)  (AD=ODL ) /*.01D008 A008 .
0510/
0520 002T #DISPLAY.DSNAME (1+003)  (AD=ODL ) /*.01D054 A054 .
0530 057T #DISPLAY.VOLSER (1+003)  (AD=ODL ) /*.01D006 A006 .
0540 064T #DISPLAY.DSORG (1+003)  (AD=ODL ) /*.01U004 A004 .
0550 070T #DISPLAY.CREATION-DATE (1+003)  (AD=ODL ) /*.01D008 A008 .
0560/
0570 002T #DISPLAY.DSNAME (1+004)  (AD=ODL ) /*.01D054 A054 .
0580 057T #DISPLAY.VOLSER (1+004)  (AD=ODL ) /*.01D006 A006 .
0590 064T #DISPLAY.DSORG (1+004)  (AD=ODL ) /*.01U004 A004 .
0600 070T #DISPLAY.CREATION-DATE (1+004)  (AD=ODL ) /*.01D008 A008 .
0610/
0620 002T #DISPLAY.DSNAME (1+005)  (AD=ODL ) /*.01D054 A054 .
0630 057T #DISPLAY.VOLSER (1+005)  (AD=ODL ) /*.01D006 A006 .
0640 064T #DISPLAY.DSORG (1+005)  (AD=ODL ) /*.01U004 A004 .
0650 070T #DISPLAY.CREATION-DATE (1+005)  (AD=ODL ) /*.01D008 A008 .
0660/
0670 002T #DISPLAY.DSNAME (1+006)  (AD=ODL ) /*.01D054 A054 .
0680 057T #DISPLAY.VOLSER (1+006)  (AD=ODL ) /*.01D006 A006 .
0690 064T #DISPLAY.DSORG (1+006)  (AD=ODL ) /*.01U004 A004 .
0700 070T #DISPLAY.CREATION-DATE (1+006)  (AD=ODL ) /*.01D008 A008 .
0710/
0720 002T #DISPLAY.DSNAME (1+007)  (AD=ODL ) /*.01D054 A054 .
0730 057T #DISPLAY.VOLSER (1+007)  (AD=ODL ) /*.01D006 A006 .
0740 064T #DISPLAY.DSORG (1+007)  (AD=ODL ) /*.01U004 A004 .
0750 070T #DISPLAY.CREATION-DATE (1+007)  (AD=ODL ) /*.01D008 A008 .
0760/
0770 002T #DISPLAY.DSNAME (1+008)  (AD=ODL ) /*.01D054 A054 .
0780 057T #DISPLAY.VOLSER (1+008)  (AD=ODL ) /*.01D006 A006 .
0790 064T #DISPLAY.DSORG (1+008)  (AD=ODL ) /*.01U004 A004 .
0800 070T #DISPLAY.CREATION-DATE (1+008)  (AD=ODL ) /*.01D008 A008 .
0810/
0820 002T #DISPLAY.DSNAME (1+009)  (AD=ODL ) /*.01D054 A054 .
0830 057T #DISPLAY.VOLSER (1+009)  (AD=ODL ) /*.01D006 A006 .
0840 064T #DISPLAY.DSORG (1+009)  (AD=ODL ) /*.01U004 A004 .
0850 070T #DISPLAY.CREATION-DATE (1+009)  (AD=ODL ) /*.01D008 A008 .
0860/
0870 002T #DISPLAY.DSNAME (1+010)  (AD=ODL ) /*.01D054 A054 .
0880 057T #DISPLAY.VOLSER (1+010)  (AD=ODL ) /*.01D006 A006 .
0890 064T #DISPLAY.DSORG (1+010)  (AD=ODL ) /*.01U004 A004 .
0900 070T #DISPLAY.CREATION-DATE (1+010)  (AD=ODL ) /*.01D008 A008 .
0910/
0920 002T #DISPLAY.DSNAME (1+011)  (AD=ODL ) /*.01D054 A054 .
0930 057T #DISPLAY.VOLSER (1+011)  (AD=ODL ) /*.01D006 A006 .
0940 064T #DISPLAY.DSORG (1+011)  (AD=ODL ) /*.01U004 A004 .
0950 070T #DISPLAY.CREATION-DATE (1+011)  (AD=ODL ) /*.01D008 A008 .
0960/
0970 002T #DISPLAY.DSNAME (1+012)  (AD=ODL ) /*.01D054 A054 .
0980 057T #DISPLAY.VOLSER (1+012)  (AD=ODL ) /*.01D006 A006 .
0990 064T #DISPLAY.DSORG (1+012)  (AD=ODL ) /*.01U004 A004 .
1000 070T #DISPLAY.CREATION-DATE (1+012)  (AD=ODL ) /*.01D008 A008 .
1010/
1020 002T #DISPLAY.DSNAME (1+013)  (AD=ODL ) /*.01D054 A054 .
1030 057T #DISPLAY.VOLSER (1+013)  (AD=ODL ) /*.01D006 A006 .
1040 064T #DISPLAY.DSORG (1+013)  (AD=ODL ) /*.01U004 A004 .
1050 070T #DISPLAY.CREATION-DATE (1+013)  (AD=ODL ) /*.01D008 A008 .
1060/
1070 002T #DISPLAY.DSNAME (1+014)  (AD=ODL ) /*.01D054 A054 .
1080 057T #DISPLAY.VOLSER (1+014)  (AD=ODL ) /*.01D006 A006 .
1090 064T #DISPLAY.DSORG (1+014)  (AD=ODL ) /*.01U004 A004 .
1100 070T #DISPLAY.CREATION-DATE (1+014)  (AD=ODL ) /*.01D008 A008 .
1110/
1120/
1130* MAP2: VALIDATION *****************************************************
1140* MAP2: END OF MAP *****************************************************
1150END
