0010* MAP2: PROTOTYPE
0020* INPUT USING MAP 'XXXXXXXX'
0030*     ##TITLE #CREATION-DATE #CVAR #DISPLAY.CREATION-DATE(*)
0040*     #DISPLAY.DSNAME(*) #DISPLAY.DSORG(*) #DISPLAY.VOLSER(*) #DSNAME
0050DEFINE DATA PARAMETER
00601 ##TITLE (A078)
00701 #CREATION-DATE (A009)
00801  #CVAR (C)
00901 #DISPLAY.CREATION-DATE (A008/    1:00015)
01001 #DISPLAY.DSNAME (A054/    1:00015)
01101 #DISPLAY.DSORG (A004/00001:00015)
01201 #DISPLAY.VOLSER (A006/    1:00015)
01301 #DSNAME (A054)
0140END-DEFINE
0150FORMAT PS=021 LS=080 ZP=OFF SG=OFF KD=ON  IP=OFF
0160* MAP2: MAP PROFILES *****************************        410***********
0170* .TTAAAMMOO   D I D I N D I D I        ?_)¬&:+(                       *
0180* 023079        N0NNUCN             X        01 SYSPROF YL   #CVAR   1 *
0190************************************************************************
0200INPUT          (     CV=#CVAR                                         /*
0210                                                                       )
0220 002T ##TITLE  (AD=ODL ) /*.01D078 A078 .
0230/
0240/
0250 002T 'Dsname'
0260 057T 'Volume FCB  Creation'
0270/
0280 002T #DSNAME  (AD=MYLT'_' CV=#CVAR ) /*.99D054 A054 .
0290 057T '______ ____'
0300 069T #CREATION-DATE  (AD=MYLT'_' CV=#CVAR ) /*.99D009 A009 .
0310/
0320 002T #DISPLAY.DSNAME (1+000)  (AD=ODL ) /*.01D054 A054 .
0330   /* A1000150000100001    10000100001100015001000001H
0340 057T #DISPLAY.VOLSER (1+000)  (AD=ODL ) /*.01D006 A006 .
0350   /* A1000150000100001    10000100001100015001000001H
0360 064T #DISPLAY.DSORG (1+000)  (AD=ODL ) /*.01U004 A004 .
0370   /* A1000150000100001    10000100001100015001000001H
0380 070T #DISPLAY.CREATION-DATE (1+000)  (AD=ODL ) /*.01D008 A008 .
0390   /* A1000150000100001    10000100001100015001000001H
0400/
0410 002T #DISPLAY.DSNAME (1+001)  (AD=ODL ) /*.01D054 A054 .
0420 057T #DISPLAY.VOLSER (1+001)  (AD=ODL ) /*.01D006 A006 .
0430 064T #DISPLAY.DSORG (1+001)  (AD=ODL ) /*.01U004 A004 .
0440 070T #DISPLAY.CREATION-DATE (1+001)  (AD=ODL ) /*.01D008 A008 .
0450/
0460 002T #DISPLAY.DSNAME (1+002)  (AD=ODL ) /*.01D054 A054 .
0470 057T #DISPLAY.VOLSER (1+002)  (AD=ODL ) /*.01D006 A006 .
0480 064T #DISPLAY.DSORG (1+002)  (AD=ODL ) /*.01U004 A004 .
0490 070T #DISPLAY.CREATION-DATE (1+002)  (AD=ODL ) /*.01D008 A008 .
0500/
0510 002T #DISPLAY.DSNAME (1+003)  (AD=ODL ) /*.01D054 A054 .
0520 057T #DISPLAY.VOLSER (1+003)  (AD=ODL ) /*.01D006 A006 .
0530 064T #DISPLAY.DSORG (1+003)  (AD=ODL ) /*.01U004 A004 .
0540 070T #DISPLAY.CREATION-DATE (1+003)  (AD=ODL ) /*.01D008 A008 .
0550/
0560 002T #DISPLAY.DSNAME (1+004)  (AD=ODL ) /*.01D054 A054 .
0570 057T #DISPLAY.VOLSER (1+004)  (AD=ODL ) /*.01D006 A006 .
0580 064T #DISPLAY.DSORG (1+004)  (AD=ODL ) /*.01U004 A004 .
0590 070T #DISPLAY.CREATION-DATE (1+004)  (AD=ODL ) /*.01D008 A008 .
0600/
0610 002T #DISPLAY.DSNAME (1+005)  (AD=ODL ) /*.01D054 A054 .
0620 057T #DISPLAY.VOLSER (1+005)  (AD=ODL ) /*.01D006 A006 .
0630 064T #DISPLAY.DSORG (1+005)  (AD=ODL ) /*.01U004 A004 .
0640 070T #DISPLAY.CREATION-DATE (1+005)  (AD=ODL ) /*.01D008 A008 .
0650/
0660 002T #DISPLAY.DSNAME (1+006)  (AD=ODL ) /*.01D054 A054 .
0670 057T #DISPLAY.VOLSER (1+006)  (AD=ODL ) /*.01D006 A006 .
0680 064T #DISPLAY.DSORG (1+006)  (AD=ODL ) /*.01U004 A004 .
0690 070T #DISPLAY.CREATION-DATE (1+006)  (AD=ODL ) /*.01D008 A008 .
0700/
0710 002T #DISPLAY.DSNAME (1+007)  (AD=ODL ) /*.01D054 A054 .
0720 057T #DISPLAY.VOLSER (1+007)  (AD=ODL ) /*.01D006 A006 .
0730 064T #DISPLAY.DSORG (1+007)  (AD=ODL ) /*.01U004 A004 .
0740 070T #DISPLAY.CREATION-DATE (1+007)  (AD=ODL ) /*.01D008 A008 .
0750/
0760 002T #DISPLAY.DSNAME (1+008)  (AD=ODL ) /*.01D054 A054 .
0770 057T #DISPLAY.VOLSER (1+008)  (AD=ODL ) /*.01D006 A006 .
0780 064T #DISPLAY.DSORG (1+008)  (AD=ODL ) /*.01U004 A004 .
0790 070T #DISPLAY.CREATION-DATE (1+008)  (AD=ODL ) /*.01D008 A008 .
0800/
0810 002T #DISPLAY.DSNAME (1+009)  (AD=ODL ) /*.01D054 A054 .
0820 057T #DISPLAY.VOLSER (1+009)  (AD=ODL ) /*.01D006 A006 .
0830 064T #DISPLAY.DSORG (1+009)  (AD=ODL ) /*.01U004 A004 .
0840 070T #DISPLAY.CREATION-DATE (1+009)  (AD=ODL ) /*.01D008 A008 .
0850/
0860 002T #DISPLAY.DSNAME (1+010)  (AD=ODL ) /*.01D054 A054 .
0870 057T #DISPLAY.VOLSER (1+010)  (AD=ODL ) /*.01D006 A006 .
0880 064T #DISPLAY.DSORG (1+010)  (AD=ODL ) /*.01U004 A004 .
0890 070T #DISPLAY.CREATION-DATE (1+010)  (AD=ODL ) /*.01D008 A008 .
0900/
0910 002T #DISPLAY.DSNAME (1+011)  (AD=ODL ) /*.01D054 A054 .
0920 057T #DISPLAY.VOLSER (1+011)  (AD=ODL ) /*.01D006 A006 .
0930 064T #DISPLAY.DSORG (1+011)  (AD=ODL ) /*.01U004 A004 .
0940 070T #DISPLAY.CREATION-DATE (1+011)  (AD=ODL ) /*.01D008 A008 .
0950/
0960 002T #DISPLAY.DSNAME (1+012)  (AD=ODL ) /*.01D054 A054 .
0970 057T #DISPLAY.VOLSER (1+012)  (AD=ODL ) /*.01D006 A006 .
0980 064T #DISPLAY.DSORG (1+012)  (AD=ODL ) /*.01U004 A004 .
0990 070T #DISPLAY.CREATION-DATE (1+012)  (AD=ODL ) /*.01D008 A008 .
1000/
1010 002T #DISPLAY.DSNAME (1+013)  (AD=ODL ) /*.01D054 A054 .
1020 057T #DISPLAY.VOLSER (1+013)  (AD=ODL ) /*.01D006 A006 .
1030 064T #DISPLAY.DSORG (1+013)  (AD=ODL ) /*.01U004 A004 .
1040 070T #DISPLAY.CREATION-DATE (1+013)  (AD=ODL ) /*.01D008 A008 .
1050/
1060 002T #DISPLAY.DSNAME (1+014)  (AD=ODL ) /*.01D054 A054 .
1070 057T #DISPLAY.VOLSER (1+014)  (AD=ODL ) /*.01D006 A006 .
1080 064T #DISPLAY.DSORG (1+014)  (AD=ODL ) /*.01U004 A004 .
1090 070T #DISPLAY.CREATION-DATE (1+014)  (AD=ODL ) /*.01D008 A008 .
1100/
1110/
1120* MAP2: VALIDATION *****************************************************
1130* MAP2: END OF MAP *****************************************************
1140END
