0010* Catalog Maintenance
0020*
0030DEFINE DATA GLOBAL USING TUTO
0040            LOCAL USING BCATUPDL
0050            LOCAL
0060*
007001  #DSNAME                  (A54)
008001  #SHARE                   (A3)
009001  #ACCESS-TYPE             (A5)
010001  #READ-PASSWORD           (A8)
011001  #WRITE-PASSWORD          (A8)
012001  #EXECUTION-PASSWORD      (A8)
013001  #RETPD                   (N4)
014001  #BACKUP-TYPE             (A1)
015001  #DESTROY                 (A3)
016001  #PASSWORD                (A8)
0170END-DEFINE
0180*
0190REPEAT
0200*
0210INPUT WITH TEXT *##MSG-NR,
0220                 ##MSG-TXT1,
0230                 ##MSG-TXT2
0240      USING MAP 'BCATUPD&'
0250*
0260RESET ##MSG
0270*
0280   PROCESS CATALOG-UPDATE
0290      USING NODE                = ##NODE
0300        ,   DSNAME              = #DSNAME
0310        ,   PASSWORD            = #PASSWORD
0320        ,   ACCESS-TYPE         = #ACCESS-TYPE
0330        ,   SHARE               = #SHARE
0340        ,   READ-PASSWORD       = #READ-PASSWORD
0350        ,   WRITE-PASSWORD      = #WRITE-PASSWORD
0360        ,   EXECUTION-PASSWORD  = #EXECUTION-PASSWORD
0370        ,   RETPD               = #RETPD
0380        ,   BACKUP-TYPE         = #BACKUP-TYPE
0390        ,   DESTROY             = #DESTROY
0400     GIVING ERROR-CODE
0410            ERROR-TEXT
0420*
0430   IF SYSTEM-CODE NE 0 OR ERROR-CODE NE 0
0440      INCLUDE BERR---C
0450   END-IF
0460*
0470   RESET #PASSWORD #READ-PASSWORD #WRITE-PASSWORD #EXECUTION-PASSWORD
0480*
0490   IF ##MSG-NR = 0
0500      ASSIGN ##MSG-NR = 1007
0510   END-IF
0520*
0530END-REPEAT
0540END
