0010* MAP2: PROTOTYPE
0020* INPUT USING MAP 'XXXXXXXX'
0030*     ##TITLE #CVAR #DATA #DATA-ID #DELETE-ENTRY
0040*     #DISPLAY.CURRENT-ENTRIES(*) #DISPLAY.DATA-ID(*)
0050*     #DISPLAY.ENTRY-LENGTH(*) #DISPLAY.NUMBER-OF-ENTRIES(*)
0060*     #ENTRY-LENGTH #ENTRY-NUMBER #FUNCTION #NUMBER-OF-ENTRIES
0070DEFINE DATA PARAMETER
00801 ##TITLE (A078)
00901  #CVAR (C)
01001 #DATA (A250)
01101 #DATA-ID (A012)
01201 #DELETE-ENTRY (A001)
01301 #DISPLAY.CURRENT-ENTRIES (N05.0/00001:00008)
01401 #DISPLAY.DATA-ID (A012/00001:00008)
01501 #DISPLAY.ENTRY-LENGTH (N03.0/00001:00008)
01601 #DISPLAY.NUMBER-OF-ENTRIES (N05.0/00001:00008)
01701 #ENTRY-LENGTH (N03.0)
01801 #ENTRY-NUMBER (N05.0)
01901 #FUNCTION (A008)
02001 #NUMBER-OF-ENTRIES (N05.0)
0210END-DEFINE
0220FORMAT PS=021 LS=080 ZP=OFF SG=OFF KD=ON  IP=OFF
0230* MAP2: MAP PROFILES *****************************        410***********
0240* .TTAAAMMOO   D I D I N D I D I        ?_)¬&:+(                       *
0250* 023079        N0NNUCN             X        01 SYSPROF YL   #CVAR   1 *
0260************************************************************************
0270INPUT          (     CV=#CVAR                                         /*
0280                                                                       )
0290 002T ##TITLE  (AD=ODL ) /*.01D078 A078 .
0300/
0310/
0320 002T 'Funktion'
0330 011T '.' (018)
0340 030T #FUNCTION  (AD=MYLT'_' CV=#CVAR ) /*.99D008 A008 .
0350 048T '(CREATE/DELETE/MODIFY/GET/CLOSE)'
0360/
0370 002T 'Name des Speicherbereiches'
0380 030T #DATA-ID  (AD=MILT'_' ) /*.99D012 A012 .
0390/
0400/
0410 002T 'Anzahl Eintraege ..........'
0420 030T #NUMBER-OF-ENTRIES  (AD=MILT'_' ) /*.99D005 N05.0.
0430 048T '(CREATE/DELETE/CLOSE)'
0440/
0450 002T 'Laenge eines Eintrages ....'
0460 030T #ENTRY-LENGTH  (AD=MILT'_' ) /*.99D003 N03.0.
0470/
0480/
0490 002T 'Nummer des Eintrages ......'
0500 030T #ENTRY-NUMBER  (AD=MILT'_' ) /*.99U005 N05.0.
0510 036T 'Delete'
0520 044T #DELETE-ENTRY  (AD=MIT'_' ) /*.99U001 A001 .
0530 048T '(GET/MODIFY)'
0540/
0550 002T 'Daten'
0560 008T '.' (021)
0570 030T #DATA  (AD=MILT'_' AL=040  ) /*.99U040 A250 .
0580/
0590/
0600 005T 'Speicherbereich'
0610 023T 'Eintraege insges.'
0620 042T 'hoechster Eintr. Laenge Eintrag'
0630/
0640 005T '_' (016)
0650 023T '_' (017)
0660 042T '_______________  _______________'
0670/
0680 005T #DISPLAY.DATA-ID (1+000)  (AD=ODL ) /*.01U012 A012 .
0690   /* A1000080000100001    10000100001100008001000001H
0700 035T #DISPLAY.NUMBER-OF-ENTRIES (1+000)  (AD=ODR ) /*.01U005 N05.0.
0710   /**A1000080000100001    10000100001100008001001000001000HV
0720 052T #DISPLAY.CURRENT-ENTRIES (1+000)  (AD=ODR ) /*.01U005 N05.0.
0730   /**A1000080000100001    10000100001100008001001000001000HV
0740 071T #DISPLAY.ENTRY-LENGTH (1+000)  (AD=ODR ) /*.01U003 N03.0.
0750   /* A1000080000100001    10000100001100008001000001H
0760/
0770 005T #DISPLAY.DATA-ID (1+001)  (AD=ODL ) /*.01U012 A012 .
0780 035T #DISPLAY.NUMBER-OF-ENTRIES (1+001)  (AD=ODR ) /*.01U005 N05.0.
0790 052T #DISPLAY.CURRENT-ENTRIES (1+001)  (AD=ODR ) /*.01U005 N05.0.
0800 071T #DISPLAY.ENTRY-LENGTH (1+001)  (AD=ODR ) /*.01U003 N03.0.
0810/
0820 005T #DISPLAY.DATA-ID (1+002)  (AD=ODL ) /*.01U012 A012 .
0830 035T #DISPLAY.NUMBER-OF-ENTRIES (1+002)  (AD=ODR ) /*.01U005 N05.0.
0840 052T #DISPLAY.CURRENT-ENTRIES (1+002)  (AD=ODR ) /*.01U005 N05.0.
0850 071T #DISPLAY.ENTRY-LENGTH (1+002)  (AD=ODR ) /*.01U003 N03.0.
0860/
0870 005T #DISPLAY.DATA-ID (1+003)  (AD=ODL ) /*.01U012 A012 .
0880 035T #DISPLAY.NUMBER-OF-ENTRIES (1+003)  (AD=ODR ) /*.01U005 N05.0.
0890 052T #DISPLAY.CURRENT-ENTRIES (1+003)  (AD=ODR ) /*.01U005 N05.0.
0900 071T #DISPLAY.ENTRY-LENGTH (1+003)  (AD=ODR ) /*.01U003 N03.0.
0910/
0920 005T #DISPLAY.DATA-ID (1+004)  (AD=ODL ) /*.01U012 A012 .
0930 035T #DISPLAY.NUMBER-OF-ENTRIES (1+004)  (AD=ODR ) /*.01U005 N05.0.
0940 052T #DISPLAY.CURRENT-ENTRIES (1+004)  (AD=ODR ) /*.01U005 N05.0.
0950 071T #DISPLAY.ENTRY-LENGTH (1+004)  (AD=ODR ) /*.01U003 N03.0.
0960/
0970 005T #DISPLAY.DATA-ID (1+005)  (AD=ODL ) /*.01U012 A012 .
0980 035T #DISPLAY.NUMBER-OF-ENTRIES (1+005)  (AD=ODR ) /*.01U005 N05.0.
0990 052T #DISPLAY.CURRENT-ENTRIES (1+005)  (AD=ODR ) /*.01U005 N05.0.
1000 071T #DISPLAY.ENTRY-LENGTH (1+005)  (AD=ODR ) /*.01U003 N03.0.
1010/
1020 005T #DISPLAY.DATA-ID (1+006)  (AD=ODL ) /*.01U012 A012 .
1030 035T #DISPLAY.NUMBER-OF-ENTRIES (1+006)  (AD=ODR ) /*.01U005 N05.0.
1040 052T #DISPLAY.CURRENT-ENTRIES (1+006)  (AD=ODR ) /*.01U005 N05.0.
1050 071T #DISPLAY.ENTRY-LENGTH (1+006)  (AD=ODR ) /*.01U003 N03.0.
1060/
1070 005T #DISPLAY.DATA-ID (1+007)  (AD=ODL ) /*.01U012 A012 .
1080 035T #DISPLAY.NUMBER-OF-ENTRIES (1+007)  (AD=ODR ) /*.01U005 N05.0.
1090 052T #DISPLAY.CURRENT-ENTRIES (1+007)  (AD=ODR ) /*.01U005 N05.0.
1100 071T #DISPLAY.ENTRY-LENGTH (1+007)  (AD=ODR ) /*.01U003 N03.0.
1110* MAP2: VALIDATION *****************************************************
1120* MAP2: END OF MAP *****************************************************
1130END
