0010* MAP2: PROTOTYPE
0020* INPUT USING MAP 'XXXXXXXX'
0030*     ##TITLE #CVAR #DATA #DATA-ID #DELETE-ENTRY
0040*     #DISPLAY.CURRENT-ENTRIES(*) #DISPLAY.DATA-ID(*)
0050*     #DISPLAY.ENTRY-LENGTH(*) #DISPLAY.NUMBER-OF-ENTRIES(*)
0060*     #ENTRY-LENGTH #ENTRY-NUMBER #FUNCTION #NUMBER-OF-ENTRIES
0070DEFINE DATA PARAMETER
00801 ##TITLE (A078)
00901  #CVAR (C)
01001 #DATA (A250)
01101 #DATA-ID (A012)
01201 #DELETE-ENTRY (A001)
01301 #DISPLAY.CURRENT-ENTRIES (N05.0/00001:00008)
01401 #DISPLAY.DATA-ID (A012/00001:00008)
01501 #DISPLAY.ENTRY-LENGTH (N03.0/00001:00008)
01601 #DISPLAY.NUMBER-OF-ENTRIES (N05.0/00001:00008)
01701 #ENTRY-LENGTH (N03.0)
01801 #ENTRY-NUMBER (N05.0)
01901 #FUNCTION (A008)
02001 #NUMBER-OF-ENTRIES (N05.0)
0210END-DEFINE
0220FORMAT PS=021 LS=080 ZP=OFF SG=OFF KD=ON  IP=OFF
0230* MAP2: MAP PROFILES *****************************        410***********
0240* .TTAAAMMOO   D I D I N D I D I        ?_)¬&:+(                       *
0250* 023079        N0NNUCN             X        01 SYSPROF YL   #CVAR   1 *
0260************************************************************************
0270INPUT          (     CV=#CVAR                                         /*
0280                                                                       )
0290 002T ##TITLE  (AD=ODL ) /*.01D078 A078 .
0300/
0310/
0320 002T 'Function...................'
0330 030T #FUNCTION  (AD=MYLT'_' CV=#CVAR ) /*.99D008 A008 .
0340 048T '(CREATE/DELETE/MODIFY/GET/CLOSE)'
0350/
0360 002T 'Name of Common-Data-Area ..'
0370 030T #DATA-ID  (AD=MILT'_' ) /*.99D012 A012 .
0380/
0390/
0400 002T 'Number of Entries .........'
0410 030T #NUMBER-OF-ENTRIES  (AD=MILT'_' ) /*.99D005 N05.0.
0420 048T '(CREATE/DELETE/CLOSE)'
0430/
0440 002T 'Length of Entry ...........'
0450 030T #ENTRY-LENGTH  (AD=MILT'_' ) /*.99D003 N03.0.
0460/
0470/
0480 002T 'Entry'
0490 008T '.' (021)
0500 030T #ENTRY-NUMBER  (AD=MILT'_' ) /*.99U005 N05.0.
0510 036T 'Delete'
0520 044T #DELETE-ENTRY  (AD=MIT'_' ) /*.99U001 A001 .
0530 048T '(GET/MODIFY)'
0540/
0550 002T 'Data'
0560 007T '.' (022)
0570 030T #DATA  (AD=MILT'_' AL=040  ) /*.99U040 A250 .
0580/
0590/
0600 005T 'Common-Data-Area  Number of Entries  Current Entries'
0610 059T 'Length of Entry'
0620/
0630 005T '_' (016)
0640 023T '_' (017)
0650 042T '_______________  _______________'
0660/
0670 005T #DISPLAY.DATA-ID (1+000)  (AD=ODL ) /*.01U012 A012 .
0680   /* A1000080000100001    10000100001100008001000001H
0690 035T #DISPLAY.NUMBER-OF-ENTRIES (1+000)  (AD=ODR ) /*.01U005 N05.0.
0700   /**A1000080000100001    10000100001100008001001000001000HV
0710 052T #DISPLAY.CURRENT-ENTRIES (1+000)  (AD=ODR ) /*.01U005 N05.0.
0720   /**A1000080000100001    10000100001100008001001000001000HV
0730 071T #DISPLAY.ENTRY-LENGTH (1+000)  (AD=ODR ) /*.01U003 N03.0.
0740   /* A1000080000100001    10000100001100008001000001H
0750/
0760 005T #DISPLAY.DATA-ID (1+001)  (AD=ODL ) /*.01U012 A012 .
0770 035T #DISPLAY.NUMBER-OF-ENTRIES (1+001)  (AD=ODR ) /*.01U005 N05.0.
0780 052T #DISPLAY.CURRENT-ENTRIES (1+001)  (AD=ODR ) /*.01U005 N05.0.
0790 071T #DISPLAY.ENTRY-LENGTH (1+001)  (AD=ODR ) /*.01U003 N03.0.
0800/
0810 005T #DISPLAY.DATA-ID (1+002)  (AD=ODL ) /*.01U012 A012 .
0820 035T #DISPLAY.NUMBER-OF-ENTRIES (1+002)  (AD=ODR ) /*.01U005 N05.0.
0830 052T #DISPLAY.CURRENT-ENTRIES (1+002)  (AD=ODR ) /*.01U005 N05.0.
0840 071T #DISPLAY.ENTRY-LENGTH (1+002)  (AD=ODR ) /*.01U003 N03.0.
0850/
0860 005T #DISPLAY.DATA-ID (1+003)  (AD=ODL ) /*.01U012 A012 .
0870 035T #DISPLAY.NUMBER-OF-ENTRIES (1+003)  (AD=ODR ) /*.01U005 N05.0.
0880 052T #DISPLAY.CURRENT-ENTRIES (1+003)  (AD=ODR ) /*.01U005 N05.0.
0890 071T #DISPLAY.ENTRY-LENGTH (1+003)  (AD=ODR ) /*.01U003 N03.0.
0900/
0910 005T #DISPLAY.DATA-ID (1+004)  (AD=ODL ) /*.01U012 A012 .
0920 035T #DISPLAY.NUMBER-OF-ENTRIES (1+004)  (AD=ODR ) /*.01U005 N05.0.
0930 052T #DISPLAY.CURRENT-ENTRIES (1+004)  (AD=ODR ) /*.01U005 N05.0.
0940 071T #DISPLAY.ENTRY-LENGTH (1+004)  (AD=ODR ) /*.01U003 N03.0.
0950/
0960 005T #DISPLAY.DATA-ID (1+005)  (AD=ODL ) /*.01U012 A012 .
0970 035T #DISPLAY.NUMBER-OF-ENTRIES (1+005)  (AD=ODR ) /*.01U005 N05.0.
0980 052T #DISPLAY.CURRENT-ENTRIES (1+005)  (AD=ODR ) /*.01U005 N05.0.
0990 071T #DISPLAY.ENTRY-LENGTH (1+005)  (AD=ODR ) /*.01U003 N03.0.
1000/
1010 005T #DISPLAY.DATA-ID (1+006)  (AD=ODL ) /*.01U012 A012 .
1020 035T #DISPLAY.NUMBER-OF-ENTRIES (1+006)  (AD=ODR ) /*.01U005 N05.0.
1030 052T #DISPLAY.CURRENT-ENTRIES (1+006)  (AD=ODR ) /*.01U005 N05.0.
1040 071T #DISPLAY.ENTRY-LENGTH (1+006)  (AD=ODR ) /*.01U003 N03.0.
1050/
1060 005T #DISPLAY.DATA-ID (1+007)  (AD=ODL ) /*.01U012 A012 .
1070 035T #DISPLAY.NUMBER-OF-ENTRIES (1+007)  (AD=ODR ) /*.01U005 N05.0.
1080 052T #DISPLAY.CURRENT-ENTRIES (1+007)  (AD=ODR ) /*.01U005 N05.0.
1090 071T #DISPLAY.ENTRY-LENGTH (1+007)  (AD=ODR ) /*.01U003 N03.0.
1100* MAP2: VALIDATION *****************************************************
1110* MAP2: END OF MAP *****************************************************
1120END
