0010* MAP2: PROTOTYPE
0020* INPUT USING MAP 'XXXXXXXX'
0030*     ##TITLE #DSNAME #PASSWORD #VOLSER
0040DEFINE DATA PARAMETER
00501 ##TITLE (A078)
00601 #DSNAME (A054)
00701 #PASSWORD (A008)
00801 #VOLSER (A006)
0090END-DEFINE
0100FORMAT PS=021 LS=080 ZP=OFF SG=OFF KD=ON  IP=OFF
0110* MAP2: MAP PROFILES *****************************        410***********
0120* .TTAAAMMOO   D I D I N D I D I        ?_)¬&:+(                       *
0130* 023079        N0NNUCN             X        01 SYSPROF YL           1 *
0140************************************************************************
0150INPUT          (     IP=OFF                                           /*
0160                                                                       )
0170 002T ##TITLE  (AD=ODL ) /*.01D078 A078 .
0180/
0190/
0200/
0210 002T 'Dsname .........'
0220 019T #DSNAME  (AD=MILT'_' CD=NE ) /*.99D054 A054 .
0230/
0240 002T 'Volser .........'
0250 019T #VOLSER  (AD=MILT'_' CD=NE ) /*.99D006 A006 .
0260/
0270/
0280 002T 'Password .......'
0290 019T #PASSWORD  (AD=MILT'_' CD=NE ) /*.99D008 A008 .
0300/
0310/
0320/
0330/
0340/
0350/
0360/
0370/
0380/
0390/
0400/
0410/
0420/
0430/
0440* MAP2: VALIDATION *****************************************************
0450* MAP2: END OF MAP *****************************************************
0460END
