0010* MAP2: PROTOTYPE
0020* INPUT USING MAP 'XXXXXXXX'
0030*     ##NODE #COMMAND-LINE #CV-LINE(*) #LINE(*)
0040DEFINE DATA PARAMETER
00501 ##NODE (N05.0)
00601 #COMMAND-LINE (A065)
00701  #CV-LINE (C/00001:00020)
00801 #LINE (A078/00001:00020)
0090END-DEFINE
0100FORMAT PS=023 LS=080 ZP=OFF SG=OFF KD=ON  IP=OFF
0110* MAP2: MAP PROFILES *****************************        410***********
0120* .TTAAAMMOOO  D I D I N D I D I Y      ?_)¬&:+(#                      *
0130* 025079        N0 NUCN             X        01 SYSPROF YL           1 *
0140************************************************************************
0150INPUT          (     IP=OFF                                           /*
0160                                                                       )
0170 002T '-' (029)(I)
0180 032T 'Operator-Console'(I)
0190 049T '-' (020)(I)
0200 070T 'Node'(I)
0210 075T ##NODE  (AD=OIL ) /*.01U005 N05.0.
0220/
0230 002T #LINE (001)  (AD=OY CV=#CV-LINE(001) ) /*.01U078 A078 .
0240   /* A1000200000100001000010000100001100019001000001H
0250/
0260 002T #LINE (002)  (AD=OY CV=#CV-LINE(002) ) /*.01U078 A078 .
0270/
0280 002T #LINE (003)  (AD=OY CV=#CV-LINE(003) ) /*.01U078 A078 .
0290/
0300 002T #LINE (004)  (AD=OY CV=#CV-LINE(004) ) /*.01U078 A078 .
0310/
0320 002T #LINE (005)  (AD=OY CV=#CV-LINE(005) ) /*.01U078 A078 .
0330/
0340 002T #LINE (006)  (AD=OY CV=#CV-LINE(006) ) /*.01U078 A078 .
0350/
0360 002T #LINE (007)  (AD=OY CV=#CV-LINE(007) ) /*.01U078 A078 .
0370/
0380 002T #LINE (008)  (AD=OY CV=#CV-LINE(008) ) /*.01U078 A078 .
0390/
0400 002T #LINE (009)  (AD=OY CV=#CV-LINE(009) ) /*.01U078 A078 .
0410/
0420 002T #LINE (010)  (AD=OY CV=#CV-LINE(010) ) /*.01U078 A078 .
0430/
0440 002T #LINE (011)  (AD=OY CV=#CV-LINE(011) ) /*.01U078 A078 .
0450/
0460 002T #LINE (012)  (AD=OY CV=#CV-LINE(012) ) /*.01U078 A078 .
0470/
0480 002T #LINE (013)  (AD=OY CV=#CV-LINE(013) ) /*.01U078 A078 .
0490/
0500 002T #LINE (014)  (AD=OY CV=#CV-LINE(014) ) /*.01U078 A078 .
0510/
0520 002T #LINE (015)  (AD=OY CV=#CV-LINE(015) ) /*.01U078 A078 .
0530/
0540 002T #LINE (016)  (AD=OY CV=#CV-LINE(016) ) /*.01U078 A078 .
0550/
0560 002T #LINE (017)  (AD=OY CV=#CV-LINE(017) ) /*.01U078 A078 .
0570/
0580 002T #LINE (018)  (AD=OY CV=#CV-LINE(018) ) /*.01U078 A078 .
0590/
0600 002T #LINE (019)  (AD=OY CV=#CV-LINE(019) ) /*.01U078 A078 .
0610/
0620 002T 'Command ==>'(I)
0630 014T #COMMAND-LINE  (AD=AIT ) /*.99U065 A065 .
0640/
0650/
0660* MAP2: VALIDATION *****************************************************
0670* MAP2: END OF MAP *****************************************************
0680END
