0010* MAP2: PROTOTYPE
0020* INPUT USING MAP 'XXXXXXXX'
0030*     ##TITLE #FROM-DSNAME #FROM-ELEMENT #FROM-ELEMENT-PASSWORD
0040*     #FROM-ELEMENT-TYPE #FROM-ELEMENT-VERSION #FROM-PASSWORD #REPLACE
0050*     #TO-DSNAME #TO-ELEMENT #TO-ELEMENT-PASSWORD #TO-ELEMENT-TYPE
0060*     #TO-ELEMENT-VERSION #TO-PASSWORD
0070DEFINE DATA PARAMETER
00801 ##TITLE (A078)
00901 #FROM-DSNAME (A054)
01001 #FROM-ELEMENT (A064)
01101 #FROM-ELEMENT-PASSWORD (A008)
01201 #FROM-ELEMENT-TYPE (A008)
01301 #FROM-ELEMENT-VERSION (A024)
01401 #FROM-PASSWORD (A008)
01501 #REPLACE (A003)
01601 #TO-DSNAME (A054)
01701 #TO-ELEMENT (A064)
01801 #TO-ELEMENT-PASSWORD (A008)
01901 #TO-ELEMENT-TYPE (A008)
02001 #TO-ELEMENT-VERSION (A024)
02101 #TO-PASSWORD (A008)
0220END-DEFINE
0230FORMAT PS=021 LS=080 ZP=OFF SG=OFF KD=ON  IP=OFF
0240* MAP2: MAP PROFILES *****************************        410***********
0250* .TTAAAMMOO   D I D I N D I D I        ?_)¬&:+(                       *
0260* 023079        N0NNUCN             X        01 SYSPROF YL           1 *
0270************************************************************************
0280INPUT          (     IP=OFF                                           /*
0290                                                                       )
0300 002T ##TITLE  (AD=ODL ) /*.01D078 A078 .
0310/
0320/
0330 002T 'Ueberschreiben .....'
0340 023T #REPLACE  (AD=MIT'_' ) /*.99U003 A003 .
0350 033T '(YES/NO/REP)'
0360/
0370/
0380 002T 'Von'
0390/
0400 004T 'Datei ............'
0410 023T #FROM-DSNAME  (AD=MILT'_' ) /*.99U054 A054 .
0420/
0430 004T 'Passwort .........'
0440 023T #FROM-PASSWORD  (AD=MILT'_' ) /*.99U008 A008 .
0450/
0460 004T 'Element ..........'
0470 023T #FROM-ELEMENT  (AD=MILT'_' AL=054  ) /*.99U054 A064 .
0480/
0490 004T 'Element Typ ......'
0500 023T #FROM-ELEMENT-TYPE  (AD=MILT'_' ) /*.99U008 A008 .
0510/
0520 004T 'Element Version ..'
0530 023T #FROM-ELEMENT-VERSION  (AD=MILT'_' ) /*.99U024 A024 .
0540/
0550 004T 'Element Passwort .'
0560 023T #FROM-ELEMENT-PASSWORD  (AD=MNT ) /*.99U008 A008 .
0570/
0580/
0590 001T 'Nach'
0600/
0610 004T 'Datei ............'
0620 023T #TO-DSNAME  (AD=MILT'_' ) /*.99U054 A054 .
0630/
0640 004T 'Passwort .........'
0650 023T #TO-PASSWORD  (AD=MILT'_' ) /*.99U008 A008 .
0660/
0670 004T 'Element ..........'
0680 023T #TO-ELEMENT  (AD=MILT'_' AL=054  ) /*.99U054 A064 .
0690/
0700 004T 'Element Typ ......'
0710 023T #TO-ELEMENT-TYPE  (AD=MILT'_' ) /*.99U008 A008 .
0720/
0730 004T 'Element Version ..'
0740 023T #TO-ELEMENT-VERSION  (AD=MILT'_' ) /*.99U024 A024 .
0750/
0760 004T 'Element Passwort .'
0770 023T #TO-ELEMENT-PASSWORD  (AD=MNT ) /*.99U008 A008 .
0780/
0790/
0800* MAP2: VALIDATION *****************************************************
0810* MAP2: END OF MAP *****************************************************
0820END
