0010* Copy or import OS-files
0020*
0030DEFINE DATA GLOBAL USING TUTO
0040             LOCAL  USING BCOPYFIL
0050             LOCAL
006001  #REPLACE                   (A3) INIT <'NO'>
007001  #FROM
0080    02  #FROM-NODE             (N5)    /* sju 02-02-15 was N3
0090    02  #FROM-DSNAME           (A54)
0100    02  #FROM-PASSWORD         (A8)
0110    02  #FROM-ELEMENT          (A64)
0120    02  #FROM-ELEMENT-TYPE     (A8)
0130    02  #FROM-ELEMENT-VERSION  (A24)
0140    02  #FROM-ELEMENT-PASSWORD (A8)
015001  #TO
0160    02  #TO-NODE               (N5)    /* sju 02-02-15 was N3
0170    02  #TO-DSNAME             (A54)
0180    02  #TO-PASSWORD           (A8)
0190    02  #TO-ELEMENT            (A64)
0200    02  #TO-ELEMENT-TYPE       (A8)
0210    02  #TO-ELEMENT-VERSION    (A24)
0220    02  #TO-ELEMENT-PASSWORD   (A8)
0230END-DEFINE
0240ASSIGN #FROM-NODE = ##NODE
0250ASSIGN #TO-NODE   = ##NODE
0260REPEAT
0270   INPUT TEXT *##MSG-NR, ##MSG-TXT1, ##MSG-TXT2
0280         USING MAP 'BCOPYFI&'
0290   PROCESS COPY-FILE
0300     USING NODE                  = ##NODE
0310       ,   REPLACE               = #REPLACE
0320       ,   FROM-DSNAME           = #FROM-DSNAME
0330       ,   FROM-PASSWORD         = #FROM-PASSWORD
0340       ,   FROM-ELEMENT          = #FROM-ELEMENT
0350       ,   FROM-ELEMENT-TYPE     = #FROM-ELEMENT-TYPE
0360       ,   FROM-ELEMENT-VERSION  = #FROM-ELEMENT-VERSION
0370       ,   FROM-ELEMENT-PASSWORD = #FROM-ELEMENT-PASSWORD
0380       ,   TO-DSNAME             = #TO-DSNAME
0390       ,   TO-PASSWORD           = #TO-PASSWORD
0400       ,   TO-ELEMENT            = #TO-ELEMENT
0410       ,   TO-ELEMENT-TYPE      = #TO-ELEMENT-TYPE
0420       ,   TO-ELEMENT-VERSION   = #TO-ELEMENT-VERSION
0430       ,   TO-ELEMENT-PASSWORD  = #TO-ELEMENT-PASSWORD
0440    GIVING ERROR-CODE
0450           ERROR-TEXT
0460           SYSTEM-CODE
0470*
0480     IF SYSTEM-CODE = 0 AND ERROR-CODE = 0
0490        ASSIGN ##MSG-NR = 1007
0500       ELSE
0510        INCLUDE BERR---C
0520     END-IF
0530*
0540END-REPEAT
0550END
