0010* MAP2: PROTOTYPE
0020* INPUT USING MAP 'XXXXXXXX'
0030*     ##TITLE #ACCOUNT-NUMBER #DSNAME #ELEMENT #JOB-CLASS #JOB-NAME
0040*     #JOB-VARIABLE-PASSWORD #OBJECT #PRIORITY #START-DATX
0050*     #START-OPTION #START-TIMX #SYSTEM-JOB-VARIABLE #TIME
0060*     #USER-PASSWORD #USERID
0070DEFINE DATA PARAMETER
00801 ##TITLE (A078)
00901 #ACCOUNT-NUMBER (A008)
01001 #DSNAME (A054)
01101 #ELEMENT (A064)
01201 #JOB-CLASS (A008)
01301 #JOB-NAME (A008)
01401 #JOB-VARIABLE-PASSWORD (A004)
01501 #OBJECT (A006)
01601 #PRIORITY (A003)
01701 #START-DATX (D)
01801 #START-OPTION (A017)
01901 #START-TIMX (T)
02001 #SYSTEM-JOB-VARIABLE (A054)
02101 #TIME (A005)
02201 #USER-PASSWORD (A008)
02301 #USERID (A008)
0240END-DEFINE
0250FORMAT PS=021 LS=080 ZP=OFF SG=OFF KD=ON  IP=OFF
0260* MAP2: MAP PROFILES *****************************        410***********
0270* .TTAAAMMOO   D I D I N D I D I        ?_)¬&:+(                       *
0280* 023079        N0NNUCN             X        01 SYSPROF YL           1 *
0290************************************************************************
0300INPUT          (     IP=OFF                                           /*
0310                                                                       )
0320 002T ##TITLE  (AD=ODL ) /*.01D078 A078 .
0330/
0340/
0350 002T 'Submit .........'
0360 019T #OBJECT  (AD=MILT'_' CD=NE ) /*.99U006 A006 .
0370 026T '(MEMBER/FILE)'
0380/
0390 002T 'Datei'
0400 009T '.........'
0410 019T #DSNAME  (AD=MILT'_' CD=NE ) /*.99D054 A054 .
0420/
0430 002T 'Member .........'
0440 019T #ELEMENT  (AD=MILT'_' CD=NE AL=060  ) /*.99D060 A064 .
0450/
0460 002T 'Passwort .......'
0470 019T #USER-PASSWORD  (AD=MILT'_' CD=NE ) /*.99D008 A008 .
0480/
0490/
0500 002T 'Jobname ........'
0510 019T #JOB-NAME  (AD=MILT'_' CD=NE ) /*.99U008 A008 .
0520/
0530 002T 'User-ID ........'
0540 019T #USERID  (AD=MILT'_' CD=NE ) /*.99D008 A008 .
0550/
0560 002T 'Account Nummer .'
0570 019T #ACCOUNT-NUMBER  (AD=MILT'_' CD=NE ) /*.99D008 A008 .
0580/
0590 002T 'Job Klasse .....'
0600 019T #JOB-CLASS  (AD=MILT'_' CD=NE ) /*.99D008 A008 .
0610/
0620 002T 'Prioritat ......'
0630 019T #PRIORITY  (AD=MILT'_' CD=NE ) /*.99D003 A003 .
0640/
0650 002T 'Zeit ...........'
0660 019T #TIME  (AD=MILT'_' CD=NE ) /*.99D005 A005 .
0670/
0680/
0690 002T 'Start-Option ...'
0700 019T #START-OPTION  (AD=MILT'_' CD=NE ) /*.99D017 A017 .
0710/
0720 002T 'Start Datum ....'
0730 019T #START-DATX  (AD=MILT'_' EM=DD.MM.YYYY ) /*.99D010 D    .
0740 030T '(TT.MM.JJJJ)'
0750/
0760 002T 'Start Zeit .....'
0770 019T #START-TIMX  (AD=MILT'_' EM=HH:II ) /*.99D005 T    .
0780/
0790/
0800 002T 'Monitor-JobVar .'
0810 019T #SYSTEM-JOB-VARIABLE  (AD=MILT'_' CD=NE ) /*.99D054 A054 .
0820/
0830 002T 'JobVar-Passwort'
0840 019T #JOB-VARIABLE-PASSWORD  (AD=MILT'_' CD=NE ) /*.99D004 A004 .
0850/
0860* MAP2: VALIDATION *****************************************************
0870* MAP2: END OF MAP *****************************************************
0880END
