0010* MAP2: PROTOTYPE
0020* INPUT USING MAP 'XXXXXXXX'
0030*     ##TITLE #ACCOUNT-NUMBER #DSNAME #ELEMENT #JOB-CLASS #JOB-NAME
0040*     #JOB-VARIABLE-PASSWORD #OBJECT #PRIORITY #START-DATX
0050*     #START-OPTION #START-TIMX #SYSTEM-JOB-VARIABLE #TIME
0060*     #USER-PASSWORD #USERID
0070DEFINE DATA PARAMETER
00801 ##TITLE (A078)
00901 #ACCOUNT-NUMBER (A008)
01001 #DSNAME (A054)
01101 #ELEMENT (A064)
01201 #JOB-CLASS (A008)
01301 #JOB-NAME (A008)
01401 #JOB-VARIABLE-PASSWORD (A004)
01501 #OBJECT (A006)
01601 #PRIORITY (A003)
01701 #START-DATX (D)
01801 #START-OPTION (A017)
01901 #START-TIMX (T)
02001 #SYSTEM-JOB-VARIABLE (A054)
02101 #TIME (A005)
02201 #USER-PASSWORD (A008)
02301 #USERID (A008)
0240END-DEFINE
0250FORMAT PS=021 LS=080 ZP=OFF SG=OFF KD=ON  IP=OFF
0260* MAP2: MAP PROFILES *****************************        410***********
0270* .TTAAAMMOO   D I D I N D I D I        ?_)¬&:+(                       *
0280* 023079        N0NNUCN             X        01 SYSPROF YL           1 *
0290************************************************************************
0300INPUT          (     IP=OFF                                           /*
0310                                                                       )
0320 002T ##TITLE  (AD=ODL ) /*.01D078 A078 .
0330/
0340/
0350 002T 'Submit .........'
0360 019T #OBJECT  (AD=MILT'_' CD=NE ) /*.99U006 A006 .
0370 026T '(MEMBER/FILE)'
0380/
0390 002T 'Dsname .........'
0400 019T #DSNAME  (AD=MILT'_' CD=NE ) /*.99D054 A054 .
0410/
0420 002T 'Member .........'
0430 019T #ELEMENT  (AD=MILT'_' CD=NE AL=060  ) /*.99D060 A064 .
0440/
0450 002T 'Password .......'
0460 019T #USER-PASSWORD  (AD=MILT'_' CD=NE ) /*.99D008 A008 .
0470/
0480/
0490 002T 'Jobname ........'
0500 019T #JOB-NAME  (AD=MILT'_' CD=NE ) /*.99U008 A008 .
0510/
0520 002T 'User-ID ........'
0530 019T #USERID  (AD=MILT'_' CD=NE ) /*.99D008 A008 .
0540/
0550 002T 'Account-Number .'
0560 019T #ACCOUNT-NUMBER  (AD=MILT'_' CD=NE ) /*.99D008 A008 .
0570/
0580 002T 'Job-Class ......'
0590 019T #JOB-CLASS  (AD=MILT'_' CD=NE ) /*.99D008 A008 .
0600/
0610 002T 'Priority .......'
0620 019T #PRIORITY  (AD=MILT'_' CD=NE ) /*.99D003 A003 .
0630/
0640 002T 'Time ...........'
0650 019T #TIME  (AD=MILT'_' CD=NE ) /*.99D005 A005 .
0660/
0670/
0680 002T 'Start-Option ...'
0690 019T #START-OPTION  (AD=MILT'_' CD=NE ) /*.99D017 A017 .
0700/
0710 002T 'Start-Date .....'
0720 019T #START-DATX  (AD=MILT'_' EM=YYYY-MM-DD ) /*.99D010 D    .
0730 030T '(YYYY-MM-DD)'
0740/
0750 002T 'Start-Time .....'
0760 019T #START-TIMX  (AD=MILT'_' EM=HH:II ) /*.99D005 T    .
0770/
0780/
0790 002T 'Monitor-JobVar .'
0800 019T #SYSTEM-JOB-VARIABLE  (AD=MILT'_' CD=NE ) /*.99D054 A054 .
0810/
0820 002T 'JobVar-Password'
0830 019T #JOB-VARIABLE-PASSWORD  (AD=MILT'_' CD=NE ) /*.99D004 A004 .
0840/
0850* MAP2: VALIDATION *****************************************************
0860* MAP2: END OF MAP *****************************************************
0870END
