0010* MAP2: PROTOTYPE
0020* INPUT USING MAP 'XXXXXXXX'
0030*     ##TITLE #DISPLAY.ACCESS-TYPE #DISPLAY.ALLOCATION-TYPE
0040*     #DISPLAY.BACKUP-INFO #DISPLAY.BACKUP-TYPE
0050*     #DISPLAY.BACKUP-VERSION-NUMBER #DISPLAY.BLKSIZE
0060*     #DISPLAY.CREATION-DATX #DISPLAY.DSORG #DISPLAY.EXPIRATION-DATX
0070*     #DISPLAY.FILE-SIZE #DISPLAY.KEY-LENGTH #DISPLAY.KEY-POSITION
0080*     #DISPLAY.LAST-REFERENCE-DATX #DISPLAY.LAST-TTR #DISPLAY.LRECL
0090*     #DISPLAY.MIGRATE #DISPLAY.MODIFICATION-DATX
0100*     #DISPLAY.MODIFICATION-TIMX #DISPLAY.NUMBER-OF-EXTENTS
0110*     #DISPLAY.PERCENT-USED #DISPLAY.RECFM #DISPLAY.SECONDARY-QTY
0120*     #DISPLAY.SECURITY #DISPLAY.SHARE #DISPLAY.STORAGE-LEVEL
0130*     #DISPLAY.VOLSER-ARRAY(*) #DSNAME #VOLSER
0140DEFINE DATA PARAMETER
01501 ##TITLE (A078)
01601 #DISPLAY.ACCESS-TYPE (A005)
01701 #DISPLAY.ALLOCATION-TYPE (A004)
01801 #DISPLAY.BACKUP-INFO (A019)
01901 #DISPLAY.BACKUP-TYPE (A001)
02001 #DISPLAY.BACKUP-VERSION-NUMBER (N05.0)
02101 #DISPLAY.BLKSIZE (N05.0)
02201 #DISPLAY.CREATION-DATX (D)
02301 #DISPLAY.DSORG (A004)
02401 #DISPLAY.EXPIRATION-DATX (D)
02501 #DISPLAY.FILE-SIZE (N07.0)
02601 #DISPLAY.KEY-LENGTH (N04.0)
02701 #DISPLAY.KEY-POSITION (N05.0)
02801 #DISPLAY.LAST-REFERENCE-DATX (D)
02901 #DISPLAY.LAST-TTR (N07.0)
03001 #DISPLAY.LRECL (N05.0)
03101 #DISPLAY.MIGRATE (A009)
03201 #DISPLAY.MODIFICATION-DATX (D)
03301 #DISPLAY.MODIFICATION-TIMX (T)
03401 #DISPLAY.NUMBER-OF-EXTENTS (N03.0)
03501 #DISPLAY.PERCENT-USED (N03.0)
03601 #DISPLAY.RECFM (A005)
03701 #DISPLAY.SECONDARY-QTY (N07.0)
03801 #DISPLAY.SECURITY (A005)
03901 #DISPLAY.SHARE (A004)
04001 #DISPLAY.STORAGE-LEVEL (A002)
04101 #DISPLAY.VOLSER-ARRAY (A006/00001:00005)
04201 #DSNAME (A054)
04301 #VOLSER (A006)
0440END-DEFINE
0450FORMAT PS=021 LS=080 ZP=OFF SG=OFF KD=ON  IP=OFF
0460* MAP2: MAP PROFILES *****************************        410***********
0470* .TTAAAMMOO   D I D I N D I D I        ?_)¬&:+(                       *
0480* 023079        N0NNUCN             X        01 SYSPROF YL           1 *
0490************************************************************************
0500INPUT          (     IP=OFF                                           /*
0510                                                                       )
0520 002T ##TITLE  (AD=ODL ) /*.01D078 A078 .
0530/
0540/
0550 002T 'Dateiname ............'
0560 026T #DSNAME  (AD=MILT'_' ) /*.99U054 A054 .
0570/
0580 002T 'Archivnummer .........'
0590 026T #VOLSER  (AD=MILT'_' ) /*.99D006 A006 .
0600 034T #DISPLAY.VOLSER-ARRAY (2+000)  (AD=ODLT ) /*.01D006 A006 .
0610   /* A1000050000100001000010000100001010001004000002H
0620 042T #DISPLAY.VOLSER-ARRAY (2+001)  (AD=ODLT ) /*.01D006 A006 .
0630 050T #DISPLAY.VOLSER-ARRAY (2+002)  (AD=ODLT ) /*.01D006 A006 .
0640 058T #DISPLAY.VOLSER-ARRAY (2+003)  (AD=ODLT ) /*.01D006 A006 .
0650/
0660/
0670 002T 'FCB Typ ..............'
0680 026T #DISPLAY.DSORG  (AD=ODL ) /*.01D004 A004 .
0690 046T 'Mehrbenutzbarkeit ....'
0700 070T #DISPLAY.SHARE  (AD=ODL ) /*.01D004 A004 .
0710/
0720 002T 'Satzformat ...........'
0730 026T #DISPLAY.RECFM  (AD=ODL ) /*.01D005 A005 .
0740 046T 'Zugriffsart ..........'
0750 070T #DISPLAY.ACCESS-TYPE  (AD=ODL ) /*.01D005 A005 .
0760/
0770 002T 'Satzlaenge ...........'
0780 026T #DISPLAY.LRECL  (AD=ODL ) /*.01D005 N05.0.
0790 046T 'Password-Schutz ......'
0800 070T #DISPLAY.SECURITY  (AD=ODL ) /*.01U005 A005 .
0810/
0820 002T 'Blockgroesse .........'
0830 026T #DISPLAY.BLKSIZE  (AD=ODL ) /*.01D005 N05.0.
0840 046T 'Sicherungstyp ........'
0850 070T #DISPLAY.BACKUP-TYPE  (AD=ODL ) /*.01D001 A001 .
0860/
0870/
0880 002T 'Erstellungsdatum .....'
0890 026T #DISPLAY.CREATION-DATX  (AD=ODL EM=DD.MM.YYYY ) /*.01D010 D    .
0900 046T 'Aend.datum (ab V11) ..'
0910 070T #DISPLAY.MODIFICATION-DATX  (AD=ODL EM=DD.MM.YYYY ) /*.01D010 D    .
0920/
0930 002T 'Verfallsdatum ........'
0940 026T #DISPLAY.EXPIRATION-DATX  (AD=ODL EM=DD.MM.YYYY ) /*.01D010 D    .
0950 046T 'Aend.zeit (ab V11) ...'
0960 070T #DISPLAY.MODIFICATION-TIMX  (AD=ODL EM=HH:II:SS ) /*.01D008 T    .
0970/
0980 002T 'Zuletzt benutzt ......'
0990 026T #DISPLAY.LAST-REFERENCE-DATX  (AD=ODL EM=DD.MM.YYYY ) /*.01D010 D    .
1000/
1010 046T 'ISAM-Dateien'
1020/
1030 002T 'Pam Seiten'
1040 015T #DISPLAY.ALLOCATION-TYPE  (AD=ODL ) /*.01D004 A004 .
1050 049T 'Schluesselposition.'
1060 070T #DISPLAY.KEY-POSITION  (AD=ODL ) /*.01D005 N05.0.
1070/
1080 004T 'insgesamt ..........'
1090 026T #DISPLAY.FILE-SIZE  (AD=ODL ) /*.01D007 N07.0.
1100 049T 'Schluessellaenge ..'
1110 070T #DISPLAY.KEY-LENGTH  (AD=ODL ) /*.01D004 N04.0.
1120/
1130 004T 'belegt .............'
1140 026T #DISPLAY.LAST-TTR  (AD=ODL ) /*.01D007 N07.0.
1150/
1160 004T 'belegt in % ........'
1170 026T #DISPLAY.PERCENT-USED  (AD=ODL ) /*.01D003 N03.0.
1180 046T 'Backup Info ..........'
1190 070T #DISPLAY.BACKUP-INFO  (AD=ODL AL=010  ) /*.01D010 A019 .
1200/
1210 002T 'Sekundaerzuweisung ...'
1220 026T #DISPLAY.SECONDARY-QTY  (AD=ODL ) /*.01U007 N07.0.
1230 046T 'Backup Versionsnummer.'
1240 070T #DISPLAY.BACKUP-VERSION-NUMBER  (AD=ODL ) /*.01D005 N05.0.
1250/
1260 002T 'Anzahl der Extents ...'
1270 026T #DISPLAY.NUMBER-OF-EXTENTS  (AD=ODL ) /*.01D003 N03.0.
1280 046T 'Migrate ..............'
1290 070T #DISPLAY.MIGRATE  (AD=ODL ) /*.01D009 A009 .
1300/
1310 046T 'Storage level ........'
1320 070T #DISPLAY.STORAGE-LEVEL  (AD=ODL ) /*.01D002 A002 .
1330* MAP2: VALIDATION *****************************************************
1340* MAP2: END OF MAP *****************************************************
1350END
