0010* MAP2: PROTOTYPE
0020* INPUT USING MAP 'XXXXXXXX'
0030*     ##TITLE #DISPLAY.ACCESS-TYPE #DISPLAY.ALLOCATION-TYPE
0040*     #DISPLAY.BACKUP-INFO #DISPLAY.BACKUP-TYPE
0050*     #DISPLAY.BACKUP-VERSION-NUMBER #DISPLAY.BLKSIZE
0060*     #DISPLAY.CREATION-DATX #DISPLAY.DSORG #DISPLAY.EXPIRATION-DATX
0070*     #DISPLAY.FILE-SIZE #DISPLAY.KEY-LENGTH #DISPLAY.KEY-POSITION
0080*     #DISPLAY.LAST-REFERENCE-DATX #DISPLAY.LAST-TTR #DISPLAY.LRECL
0090*     #DISPLAY.MIGRATE #DISPLAY.MODIFICATION-DATX
0100*     #DISPLAY.MODIFICATION-TIMX #DISPLAY.NUMBER-OF-EXTENTS
0110*     #DISPLAY.PERCENT-USED #DISPLAY.RECFM #DISPLAY.SECONDARY-QTY
0120*     #DISPLAY.SECURITY #DISPLAY.SHARE #DISPLAY.STORAGE-LEVEL
0130*     #DISPLAY.VOLSER-ARRAY(*) #DSNAME #VOLSER
0140DEFINE DATA PARAMETER
01501 ##TITLE (A078)
01601 #DISPLAY.ACCESS-TYPE (A005)
01701 #DISPLAY.ALLOCATION-TYPE (A004)
01801 #DISPLAY.BACKUP-INFO (A019)
01901 #DISPLAY.BACKUP-TYPE (A001)
02001 #DISPLAY.BACKUP-VERSION-NUMBER (N05.0)
02101 #DISPLAY.BLKSIZE (N05.0)
02201 #DISPLAY.CREATION-DATX (D)
02301 #DISPLAY.DSORG (A004)
02401 #DISPLAY.EXPIRATION-DATX (D)
02501 #DISPLAY.FILE-SIZE (N07.0)
02601 #DISPLAY.KEY-LENGTH (N04.0)
02701 #DISPLAY.KEY-POSITION (N05.0)
02801 #DISPLAY.LAST-REFERENCE-DATX (D)
02901 #DISPLAY.LAST-TTR (N07.0)
03001 #DISPLAY.LRECL (N05.0)
03101 #DISPLAY.MIGRATE (A009)
03201 #DISPLAY.MODIFICATION-DATX (D)
03301 #DISPLAY.MODIFICATION-TIMX (T)
03401 #DISPLAY.NUMBER-OF-EXTENTS (N03.0)
03501 #DISPLAY.PERCENT-USED (N03.0)
03601 #DISPLAY.RECFM (A005)
03701 #DISPLAY.SECONDARY-QTY (N07.0)
03801 #DISPLAY.SECURITY (A005)
03901 #DISPLAY.SHARE (A004)
04001 #DISPLAY.STORAGE-LEVEL (A002)
04101 #DISPLAY.VOLSER-ARRAY (A006/00001:00005)
04201 #DSNAME (A054)
04301 #VOLSER (A006)
0440END-DEFINE
0450FORMAT PS=021 LS=080 ZP=OFF SG=OFF KD=ON  IP=OFF
0460* MAP2: MAP PROFILES *****************************        410***********
0470* .TTAAAMMOO   D I D I N D I D I        ?_)¬&:+(                       *
0480* 023079        N0NNUCN             X        01 SYSPROF YL           1 *
0490************************************************************************
0500INPUT          (     IP=OFF                                           /*
0510                                                                       )
0520 002T ##TITLE  (AD=ODL ) /*.01D078 A078 .
0530/
0540/
0550 002T 'Dsname ...............'
0560 026T #DSNAME  (AD=MILT'_' ) /*.99U054 A054 .
0570/
0580 002T 'Volser ...............'
0590 026T #VOLSER  (AD=MILT'_' ) /*.99D006 A006 .
0600 034T #DISPLAY.VOLSER-ARRAY (2+000)  (AD=ODLT ) /*.01D006 A006 .
0610   /* A1000050000100001000010000100001010001004000002H
0620 042T #DISPLAY.VOLSER-ARRAY (2+001)  (AD=ODLT ) /*.01D006 A006 .
0630 050T #DISPLAY.VOLSER-ARRAY (2+002)  (AD=ODLT ) /*.01D006 A006 .
0640 058T #DISPLAY.VOLSER-ARRAY (2+003)  (AD=ODLT ) /*.01D006 A006 .
0650/
0660/
0670 002T 'Dsorg'
0680 008T '.' (016)
0690 026T #DISPLAY.DSORG  (AD=ODL ) /*.01D004 A004 .
0700 046T 'Share'
0710 052T '.' (016)
0720 070T #DISPLAY.SHARE  (AD=ODL ) /*.01D004 A004 .
0730/
0740 002T 'Recform ..............'
0750 026T #DISPLAY.RECFM  (AD=ODL ) /*.01D005 A005 .
0760 046T 'Access ...............'
0770 070T #DISPLAY.ACCESS-TYPE  (AD=ODL ) /*.01D005 A005 .
0780/
0790 002T 'Recsize ..............'
0800 026T #DISPLAY.LRECL  (AD=ODL ) /*.01D005 N05.0.
0810 046T 'Security .............'
0820 070T #DISPLAY.SECURITY  (AD=ODL ) /*.01U005 A005 .
0830/
0840 002T 'Blksize ..............'
0850 026T #DISPLAY.BLKSIZE  (AD=ODL ) /*.01D005 N05.0.
0860 046T 'Backup-Type ..........'
0870 070T #DISPLAY.BACKUP-TYPE  (AD=ODL ) /*.01D001 A001 .
0880/
0890/
0900 002T 'Creation-Date ........'
0910 026T #DISPLAY.CREATION-DATX  (AD=ODL EM=YYYY-MM-DD ) /*.01D010 D    .
0920 046T 'Mod.-Date (from V11) .'
0930 070T #DISPLAY.MODIFICATION-DATX  (AD=ODL EM=YYYY-MM-DD ) /*.01D010 D    .
0940/
0950 002T 'Expiration-Date ......'
0960 026T #DISPLAY.EXPIRATION-DATX  (AD=ODL EM=YYYY-MM-DD ) /*.01D010 D    .
0970 046T 'Mod.-Time (from V11) .'
0980 070T #DISPLAY.MODIFICATION-TIMX  (AD=ODL EM=HH:II:SS ) /*.01D008 T    .
0990/
1000 002T 'Last-Reference .......'
1010 026T #DISPLAY.LAST-REFERENCE-DATX  (AD=ODL EM=YYYY-MM-DD ) /*.01D010 D    .
1020/
1030 046T 'ISAM-Files'
1040/
1050 002T 'Pam Pages'
1060 015T #DISPLAY.ALLOCATION-TYPE  (AD=ODL ) /*.01D004 A004 .
1070 049T 'Keypos ............'
1080 070T #DISPLAY.KEY-POSITION  (AD=ODL ) /*.01D005 N05.0.
1090/
1100 004T 'allocated ..........'
1110 026T #DISPLAY.FILE-SIZE  (AD=ODL ) /*.01D007 N07.0.
1120 049T 'Keylen ............'
1130 070T #DISPLAY.KEY-LENGTH  (AD=ODL ) /*.01D004 N04.0.
1140/
1150 004T 'used Pages .........'
1160 026T #DISPLAY.LAST-TTR  (AD=ODL ) /*.01D007 N07.0.
1170/
1180 004T 'used in % ..........'
1190 026T #DISPLAY.PERCENT-USED  (AD=ODL ) /*.01D003 N03.0.
1200 046T 'Backup Info ..........'
1210 070T #DISPLAY.BACKUP-INFO  (AD=ODL AL=010  ) /*.01D010 A019 .
1220/
1230 002T 'Secondary Space ......'
1240 026T #DISPLAY.SECONDARY-QTY  (AD=ODL ) /*.01U007 N07.0.
1250 046T 'Backup version .......'
1260 070T #DISPLAY.BACKUP-VERSION-NUMBER  (AD=ODL ) /*.01D005 N05.0.
1270/
1280 002T 'Number of Extents ....'
1290 026T #DISPLAY.NUMBER-OF-EXTENTS  (AD=ODL ) /*.01D003 N03.0.
1300 046T 'Migrate ..............'
1310 070T #DISPLAY.MIGRATE  (AD=ODL ) /*.01D009 A009 .
1320/
1330 046T 'Storage level ........'
1340 070T #DISPLAY.STORAGE-LEVEL  (AD=ODL ) /*.01D002 A002 .
1350* MAP2: VALIDATION *****************************************************
1360* MAP2: END OF MAP *****************************************************
1370END
