0010* MAP2: PROTOTYPE
0020* INPUT USING MAP 'XXXXXXXX'
0030*     ##TITLE #CV-ID #LINES(*) #MESSAGE-ID
0040DEFINE DATA PARAMETER
00501 ##TITLE (A078)
00601  #CV-ID (C)
00701 #LINES (A079/00001:00015)
00801 #MESSAGE-ID (A007)
0090END-DEFINE
0100FORMAT PS=021 LS=080 ZP=OFF SG=OFF KD=ON  IP=OFF
0110* MAP2: MAP PROFILES *****************************        410***********
0120* .TTAAAMMOO   D I D I N D I D I        ?_)¬&:+(                       *
0130* 023080        N1NNUCN             X        01 SYSPROF YL           1 *
0140************************************************************************
0150INPUT          (     IP=OFF                                           /*
0160                                                                       )
0170 001T ##TITLE  (AD=ODL ) /*.01U078 A078 .
0180/
0190/
0200 001T 'MessageID ....'
0210 016T #MESSAGE-ID  (AD=MYLT'_' CD=NE CV=#CV-ID ) /*.99U007 A007 .
0220/
0230/
0240/
0250 001T #LINES (001)  (AD=ODL ) /*.01U079 A079 .
0260   /* A1000150000100001000010000100001100015001000001H
0270/
0280 001T #LINES (002)  (AD=ODL ) /*.01U079 A079 .
0290/
0300 001T #LINES (003)  (AD=ODL ) /*.01U079 A079 .
0310/
0320 001T #LINES (004)  (AD=ODL ) /*.01U079 A079 .
0330/
0340 001T #LINES (005)  (AD=ODL ) /*.01U079 A079 .
0350/
0360 001T #LINES (006)  (AD=ODL ) /*.01U079 A079 .
0370/
0380 001T #LINES (007)  (AD=ODL ) /*.01U079 A079 .
0390/
0400 001T #LINES (008)  (AD=ODL ) /*.01U079 A079 .
0410/
0420 001T #LINES (009)  (AD=ODL ) /*.01U079 A079 .
0430/
0440 001T #LINES (010)  (AD=ODL ) /*.01U079 A079 .
0450/
0460 001T #LINES (011)  (AD=ODL ) /*.01U079 A079 .
0470/
0480 001T #LINES (012)  (AD=ODL ) /*.01U079 A079 .
0490/
0500 001T #LINES (013)  (AD=ODL ) /*.01U079 A079 .
0510/
0520 001T #LINES (014)  (AD=ODL ) /*.01U079 A079 .
0530/
0540 001T #LINES (015)  (AD=ODL ) /*.01U079 A079 .
0550/
0560* MAP2: VALIDATION *****************************************************
0570* MAP2: END OF MAP *****************************************************
0580END
