0010DEFINE DATA GLOBAL USING TUTO
0020            LOCAL
003001  P-NODE                              (N5)     /* sju 02-02-15 was N3
004001  P-ERROR-CODE                        (N4)
005001  P-ERROR-TEXT                        (A70)
006001  #MESSAGE-ID                        (A7)
0070*
0080            LOCAL USING BHELP--L
0090            LOCAL
010001  #CV-ID (C)
011001  #LANGUAGE                           (N1)
012001  #LINES                              (A79/1:15)
013001  #I                                  (P2)
014001  #COUNT                              (P2)
015001  END-OF-PROCESSING                   (L)
0160*
017001  #MSG-NR                             (N4)
018001  #MSG-TXT                            (A60)
0190END-DEFINE
0200* ------------------------------ main ---------------------------------
0210PERFORM PF-KEY
0220SET KEY PF3=PGM
0230ASSIGN #LANGUAGE = *LANGUAGE
0240*
0250ASSIGN P-NODE = 148
0260ASSIGN P-ERROR-CODE = 5599
0270ASSIGN P-ERROR-TEXT = 'Internal Error'
0280ASSIGN #MESSAGE-ID = 'DMS0D9A'
0290*
0300REP.
0310REPEAT
0320UNTIL END-OF-PROCESSING
0330  FIND HELP-INFO
0340       WITH NODE        = P-NODE
0350        AND LANGUAGE-ID = #LANGUAGE
0360        AND MESSAGE-ID  = #MESSAGE-ID
0370*
0380    IF ERROR-CODE NE 0
0390       ASSIGN #MSG-NR  = 1000
0400       ASSIGN #MSG-TXT = ERROR-TEXT
0410       WRITE ERROR-CODE ERROR-TEXT (AL=50)
0420       ESCAPE BOTTOM (REP.)
0430    END-IF
0440*
0450DISPLAY LINE
0460    IF #I = 15
0470       PERFORM SCREEN-IO
0480       IF END-OF-PROCESSING
0490          ESCAPE BOTTOM (REP.)
0500       END-IF
0510    END-IF
0520*
0530    ADD 1 TO #I
0540    ADD 1 TO #COUNT
0550    MOVE LINE TO #LINES (#I)
0560  END-FIND
0570  DECIDE FOR FIRST CONDITION
0580    WHEN #MSG-NR NE 0                     /* ERROR OCCURED
0590         IGNORE
0600    WHEN #I > 0
0610         ASSIGN #MSG-NR = 1030            /* BOTTOM OF DATA
0620    WHEN #COUNT = 0
0630         ASSIGN #MSG-NR = 1031            /* NOTHING FOUND
0640    WHEN ANY
0650         PERFORM SCREEN-IO
0660    WHEN NONE
0670         IGNORE
0680  END-DECIDE
0690  RESET #COUNT
0700END-REPEAT
0710* ------------------------------ screen io ----------------------------
0720DEFINE SUBROUTINE SCREEN-IO
0730INPUT USING MAP 'BHELP--1'
0740    ##TITLE
0750     #CV-ID
0760      #LINES(*)
0770       #MESSAGE-ID
0780* ##TITLE (A078)
0790* #CV-ID (C)
0800* #LINES (A079/00001:00015)
0810* #MESSAGE-ID (A007)
0820*
0830IF *PF-KEY = 'PF3'
0840   ASSIGN END-OF-PROCESSING = TRUE
0850END-IF
0860*
0870RESET #MSG-NR #MSG-TXT
0880RESET #I #LINES (*)
0890END-SUBROUTINE
0900* ------------------------------ pf key -------------------------------
0910INCLUDE C-PFKEY
0920END
