0010*
0020* Display Help Info
0030*
0040DEFINE DATA GLOBAL USING TUTO
0050            LOCAL  USING BHELP--L
0060            LOCAL
0070*
008001  #MESSAGE-ID     (A7)
009001  #LANGUAGE-ID    (N1)
0100*
011001  #LINES          (A79/1:15)
012001  #I              (P2)
013001  #CV-ID          (C)
0140END-DEFINE
0150ASSIGN #LANGUAGE-ID = *LANGUAGE
0160PERFORM PF-KEY
0170*
0180* ------------------------------ MAIN LOOP ----------------------------
0190*
0200REPEAT
0210ASSIGN #CV-ID = (AD=I)
0220PERFORM SCREEN-IO
0230FND.
0240FIND HELP-INFO WITH NODE        =  ##NODE
0250               AND  MESSAGE-ID  =  #MESSAGE-ID
0260               AND  LANGUAGE-ID =  #LANGUAGE-ID
0270  IF ERROR-CODE NE 0 OR SYSTEM-CODE NE 0
0280     INCLUDE BERR---C
0290     ESCAPE BOTTOM (FND.)
0300  END-IF
0310*
0320  IF #I = 15
0330     ASSIGN #CV-ID = (AD=DP)
0340     PERFORM SCREEN-IO
0350  END-IF
0360*
0370  ADD 1 TO #I
0380  ASSIGN #LINES (#I) = LINE
0390END-FIND
0400END-REPEAT
0410*
0420* ------------------------------ SCREEN-IO ----------------------------
0430*
0440DEFINE SUBROUTINE SCREEN-IO
0450INPUT WITH TEXT *##MSG-NR,
0460                 ##MSG-TXT1,
0470                 ##MSG-TXT2
0480      USING MAP 'BHELP--&'
0490RESET ##MSG
0500RESET #I #LINES (*)
0510END-SUBROUTINE
0520*
0530* ------------------------------ PF-KEY -------------------------------
0540*
0550INCLUDE C-PFKEY
0560*
0570WRITE TITLE ##TITLE
0580      SKIP 1
0590END
