0010* MAP2: PROTOTYPE
0020* INPUT USING MAP 'XXXXXXXX'
0030*     ##TITLE #ERASE #EVENT-SHORT-NAME #FUNCTION #ITC-NAME
0040*     #MESSAGE-LENGTH #MSG-TEXT(*) #POINTER-TO-WORKAREA
0050*     #WAITING-TIME-ALLOWED
0060DEFINE DATA PARAMETER
00701 ##TITLE (A078)
00801 #ERASE (A003)
00901 #EVENT-SHORT-NAME (A004)
01001 #FUNCTION (A008)
01101 #ITC-NAME (A008)
01201 #MESSAGE-LENGTH (N06.0)
01301 #MSG-TEXT (A050/00001:00005)
01401 #POINTER-TO-WORKAREA (B004)
01501 #WAITING-TIME-ALLOWED (B004)
0160END-DEFINE
0170FORMAT PS=021 LS=080 ZP=OFF SG=OFF KD=ON  IP=OFF
0180* MAP2: MAP PROFILES *****************************        410***********
0190* .TTAAAMMOO   D I D I N D I D I        ?_)¬&:+(                       *
0200* 023079        N0 NUCN             X        01 SYSPROF YL           1 *
0210************************************************************************
0220INPUT          (     IP=OFF                                           /*
0230                                                                       )
0240 002T ##TITLE  (AD=OD ) /*.01U078 A078 .
0250/
0260/
0270/
0280 002T 'Function............'
0290 023T #FUNCTION  (AD=MILT'_' ) /*.99U008 A008 .
0300 034T '(OPEN/CLOSE/DELMSG/RECVMSG/SENDMSG/ENDSEND)'
0310/
0320/
0330 002T 'ITC Name............'
0340 023T #ITC-NAME  (AD=MILT'_' ) /*.99U008 A008 .
0350/
0360 002T 'Event short name....'
0370 023T #EVENT-SHORT-NAME  (AD=MILT'_' ) /*.99U004 A004 .
0380/
0390/
0400 002T 'Erase...............'
0410 023T #ERASE  (AD=MILT'_' ) /*.99U003 A003 .
0420/
0430 002T 'Message length......'
0440 023T #MESSAGE-LENGTH  (AD=MILT'_' ) /*.99U006 N06.0.
0450/
0460/
0470 002T 'Message Text........'
0480 023T #MSG-TEXT (001)  (AD=MILT'_' ) /*.99U050 A050 .
0490   /* A1000050000100001000010000100001100005001000001H
0500/
0510 023T #MSG-TEXT (002)  (AD=MILT'_' ) /*.99U050 A050 .
0520/
0530 023T #MSG-TEXT (003)  (AD=MILT'_' ) /*.99U050 A050 .
0540/
0550 023T #MSG-TEXT (004)  (AD=MILT'_' ) /*.99U050 A050 .
0560/
0570 023T #MSG-TEXT (005)  (AD=MILT'_' ) /*.99U050 A050 .
0580/
0590/
0600 002T 'Waiting Time.....'
0610 023T #WAITING-TIME-ALLOWED  (AD=MIT ) /*.99U008 B004 .
0620/
0630 002T 'Pointer to Workarea.'
0640 023T #POINTER-TO-WORKAREA  (AD=MIT ) /*.99U008 B004 .
0650/
0660/
0670* MAP2: VALIDATION *****************************************************
0680* MAP2: END OF MAP *****************************************************
0690END
