0010* MAP2: PROTOTYPE
0020* INPUT USING MAP 'XXXXXXXX'
0030*     ##TITLE #CVAR #DISPLAY.NAME(*) #DISPLAY.SELECTION(*) #NAME CV(*)
0040DEFINE DATA PARAMETER
00501 ##TITLE (A078)
00601  #CVAR (C)
00701 #DISPLAY.NAME (A054/00001:00015)
00801 #DISPLAY.SELECTION (A001/00001:00016)
00901 #NAME (A054)
01001  CV (C/00001:00016)
0110END-DEFINE
0120FORMAT PS=021 LS=080 ZP=OFF SG=OFF KD=ON  IP=OFF
0130* MAP2: MAP PROFILES *****************************        410***********
0140* .TTAAAMMOO   D I D I N D I D I        ?_)¬&:+(                       *
0150* 023079        N0NNUCN             X        01 SYSPROF YL   #CVAR   1 *
0160************************************************************************
0170INPUT          (     CV=#CVAR                                         /*
0180                                                                       )
0190 002T ##TITLE  (AD=ODL ) /*.01D078 A078 .
0200/
0210/
0220 006T 'Job variable'
0230/
0240 004T #DISPLAY.SELECTION (1+015)  (AD=MYLT'_' CV=CV(1+015) ) /*.99U001 A001 .
0250 006T #NAME  (AD=MYLT'_' CV=#CVAR ) /*.99U054 A054 .
0260/
0270 004T #DISPLAY.SELECTION (1+000)  (AD=MYLT'_' CV=CV(1+000) ) /*.99U001 A001 .
0280   /* A1000160000100001000010000100001100016001000001H
0290 006T #DISPLAY.NAME (1+000)  (AD=ODL CD=NE ) /*.01D054 A054 .
0300   /* A1000150000100001000010000100001100015001000001H
0310/
0320 004T #DISPLAY.SELECTION (1+001)  (AD=MYLT'_' CV=CV(1+001) ) /*.99U001 A001 .
0330 006T #DISPLAY.NAME (1+001)  (AD=ODL CD=NE ) /*.01D054 A054 .
0340/
0350 004T #DISPLAY.SELECTION (1+002)  (AD=MYLT'_' CV=CV(1+002) ) /*.99U001 A001 .
0360 006T #DISPLAY.NAME (1+002)  (AD=ODL CD=NE ) /*.01D054 A054 .
0370/
0380 004T #DISPLAY.SELECTION (1+003)  (AD=MYLT'_' CV=CV(1+003) ) /*.99U001 A001 .
0390 006T #DISPLAY.NAME (1+003)  (AD=ODL CD=NE ) /*.01D054 A054 .
0400/
0410 004T #DISPLAY.SELECTION (1+004)  (AD=MYLT'_' CV=CV(1+004) ) /*.99U001 A001 .
0420 006T #DISPLAY.NAME (1+004)  (AD=ODL CD=NE ) /*.01D054 A054 .
0430/
0440 004T #DISPLAY.SELECTION (1+005)  (AD=MYLT'_' CV=CV(1+005) ) /*.99U001 A001 .
0450 006T #DISPLAY.NAME (1+005)  (AD=ODL CD=NE ) /*.01D054 A054 .
0460/
0470 004T #DISPLAY.SELECTION (1+006)  (AD=MYLT'_' CV=CV(1+006) ) /*.99U001 A001 .
0480 006T #DISPLAY.NAME (1+006)  (AD=ODL CD=NE ) /*.01D054 A054 .
0490/
0500 004T #DISPLAY.SELECTION (1+007)  (AD=MYLT'_' CV=CV(1+007) ) /*.99U001 A001 .
0510 006T #DISPLAY.NAME (1+007)  (AD=ODL CD=NE ) /*.01D054 A054 .
0520/
0530 004T #DISPLAY.SELECTION (1+008)  (AD=MYLT'_' CV=CV(1+008) ) /*.99U001 A001 .
0540 006T #DISPLAY.NAME (1+008)  (AD=ODL CD=NE ) /*.01D054 A054 .
0550/
0560 004T #DISPLAY.SELECTION (1+009)  (AD=MYLT'_' CV=CV(1+009) ) /*.99U001 A001 .
0570 006T #DISPLAY.NAME (1+009)  (AD=ODL CD=NE ) /*.01D054 A054 .
0580/
0590 004T #DISPLAY.SELECTION (1+010)  (AD=MYLT'_' CV=CV(1+010) ) /*.99U001 A001 .
0600 006T #DISPLAY.NAME (1+010)  (AD=ODL CD=NE ) /*.01D054 A054 .
0610/
0620 004T #DISPLAY.SELECTION (1+011)  (AD=MYLT'_' CV=CV(1+011) ) /*.99U001 A001 .
0630 006T #DISPLAY.NAME (1+011)  (AD=ODL CD=NE ) /*.01D054 A054 .
0640/
0650 004T #DISPLAY.SELECTION (1+012)  (AD=MYLT'_' CV=CV(1+012) ) /*.99U001 A001 .
0660 006T #DISPLAY.NAME (1+012)  (AD=ODL CD=NE ) /*.01D054 A054 .
0670/
0680 004T #DISPLAY.SELECTION (1+013)  (AD=MYLT'_' CV=CV(1+013) ) /*.99U001 A001 .
0690 006T #DISPLAY.NAME (1+013)  (AD=ODL CD=NE ) /*.01D054 A054 .
0700/
0710 004T #DISPLAY.SELECTION (1+014)  (AD=MYLT'_' CV=CV(1+014) ) /*.99U001 A001 .
0720 006T #DISPLAY.NAME (1+014)  (AD=ODL CD=NE ) /*.01D054 A054 .
0730/
0740 004T 'c=contents'
0750/
0760 004T 'a=attributes'
0770* MAP2: VALIDATION *****************************************************
0780* MAP2: END OF MAP *****************************************************
0790END
