0010* MAP2: PROTOTYPE
0020* INPUT USING MAP 'XXXXXXXX'
0030*     ##TITLE #ACCESS #CVAR #DISPLAY.ACCESS #DISPLAY.CREATION-DATX
0040*     #DISPLAY.EXPIRATION-DATX #DISPLAY.JV-TYPE #DISPLAY.LENGTH
0050*     #DISPLAY.READ-PASSWORD #DISPLAY.SHARE #DISPLAY.WRITE-PASSWORD
0060*     #FUNCTION #NAME #PASSWORD #READ-PASSWORD #REPLACE
0070*     #RETENTION-PERIOD #SECOND-NAME #SHARE #WRITE-PASSWORD
0080DEFINE DATA PARAMETER
00901 ##TITLE (A078)
01001 #ACCESS (A005)
01101  #CVAR (C)
01201 #DISPLAY.ACCESS (A005)
01301 #DISPLAY.CREATION-DATX (D)
01401 #DISPLAY.EXPIRATION-DATX (D)
01501 #DISPLAY.JV-TYPE (A010)
01601 #DISPLAY.LENGTH (N03.0)
01701 #DISPLAY.READ-PASSWORD (A004)
01801 #DISPLAY.SHARE (A003)
01901 #DISPLAY.WRITE-PASSWORD (A004)
02001 #FUNCTION (A008)
02101 #NAME (A054)
02201 #PASSWORD (A008)
02301 #READ-PASSWORD (A008)
02401 #REPLACE (A003)
02501 #RETENTION-PERIOD (N05.0)
02601 #SECOND-NAME (A054)
02701 #SHARE (A003)
02801 #WRITE-PASSWORD (A008)
0290END-DEFINE
0300FORMAT PS=021 LS=080 ZP=OFF SG=OFF KD=ON  IP=OFF
0310* MAP2: MAP PROFILES *****************************        410***********
0320* .TTAAAMMOO   D I D I N D I D I        ?_)¬&:+(                       *
0330* 023079        N0NNUCN             X        01 SYSPROF YL   #CVAR   1 *
0340************************************************************************
0350INPUT          (     CV=#CVAR                                         /*
0360                                                                       )
0370 002T ##TITLE  (AD=ODL ) /*.01D078 A078 .
0380/
0390/
0400 002T 'JV-Name...............'
0410 025T #NAME  (AD=MYLT'_' CD=NE CV=#CVAR ) /*.99U054 A054 .
0420/
0430 002T 'Function..............'
0440 025T #FUNCTION  (AD=MIT'_' CD=NE ) /*.99U008 A008 .
0450 035T '(attrib/alloc/modattr/erase)'
0460/
0470 002T 'Password .............'
0480 025T #PASSWORD  (AD=MNLT'_' CD=NE ) /*.99U008 A008 .
0490/
0500/
0510 002T 'Creation Date.........'
0520 025T #DISPLAY.CREATION-DATX  (AD=ODL EM=YYYY-MM-DD ) /*.01D010 D    .
0530 037T 'Share..........'
0540 053T #DISPLAY.SHARE  (AD=ODL CD=NE ) /*.01D003 A003 .
0550 059T 'Length....'
0560 070T #DISPLAY.LENGTH  (AD=ODR CD=NE ) /*.01D003 N03.0.
0570/
0580 002T 'Expiration Date.......'
0590 025T #DISPLAY.EXPIRATION-DATX  (AD=ODL EM=YYYY-MM-DD ) /*.01D010 D    .
0600 037T 'READ-Password..'
0610 053T #DISPLAY.READ-PASSWORD  (AD=ODL CD=NE ) /*.01D004 A004 .
0620 059T 'JV Type...'
0630 070T #DISPLAY.JV-TYPE  (AD=ODL CD=NE ) /*.01U010 A010 .
0640/
0650 037T 'WRITE-Password.'
0660 053T #DISPLAY.WRITE-PASSWORD  (AD=ODL CD=NE ) /*.01D004 A004 .
0670 059T 'Access....'
0680 070T #DISPLAY.ACCESS  (AD=ODL CD=NE ) /*.01U005 A005 .
0690/
0700/
0710 002T 'modattr'(I)
0720/
0730 004T 'New Name............'
0740 025T #SECOND-NAME  (AD=MIT'_' CD=NE ) /*.99U054 A054 .
0750/
0760 004T 'Retention Period....'
0770 025T #RETENTION-PERIOD  (AD=MIRT'_' CD=NE ) /*.99U005 N05.0.
0780 038T 'in days'
0790/
0800 002T 'modattr/alloc'(I)
0810/
0820 004T 'Access..............'
0830 025T #ACCESS  (AD=MIT'_' CD=NE ) /*.99U005 A005 .
0840 038T 'Read /'
0850 045T 'Write'(I)
0860/
0870 004T 'Share...............'
0880 025T #SHARE  (AD=MIT'_' CD=NE ) /*.99U003 A003 .
0890 038T 'Yes'
0900 043T '/'
0910 045T 'No'(I)
0920/
0930 004T 'READ-Password.......'
0940 025T #READ-PASSWORD  (AD=MIT'_' CD=NE ) /*.99U008 A008 .
0950 038T 'Pswd /'
0960 045T 'None'(I)
0970/
0980 004T 'WRITE-Password......'
0990 025T #WRITE-PASSWORD  (AD=MIT'_' CD=NE ) /*.99U008 A008 .
1000 038T 'Pswd /'
1010 045T 'None'(I)
1020/
1030 002T 'alloc'(I)
1040/
1050 004T 'Replace ............'
1060 025T #REPLACE  (AD=MIT'_' CD=NE ) /*.99U003 A003 .
1070 038T 'yes / no /'
1080 049T 'ign'(I)
1090/
1100* MAP2: VALIDATION *****************************************************
1110* MAP2: END OF MAP *****************************************************
1120END
