0010* MAP2: PROTOTYPE
0020* INPUT USING MAP 'XXXXXXXX'
0030*     ##TITLE #CVAR #DISPLAY.ACCESS #DISPLAY.CREATION-DATE
0040*     #DISPLAY.EXPIRATION-DATE #DISPLAY.JV-TYPE #DISPLAY.LENGTH
0050*     #DISPLAY.READ-PASSWORD #DISPLAY.SHARE #DISPLAY.WRITE-PASSWORD
0060*     #FUNCTION #IN-DATA1(*) #IN-DATA2 #NAME #OUT-DATA1(*) #OUT-DATA2
0070*     #PASSWORD #SUBSTRING-LENGTH #SUBSTRING-START
0080DEFINE DATA PARAMETER
00901 ##TITLE (A078)
01001  #CVAR (C)
01101 #DISPLAY.ACCESS (A005)
01201 #DISPLAY.CREATION-DATE (A008)
01301 #DISPLAY.EXPIRATION-DATE (A008)
01401 #DISPLAY.JV-TYPE (A010)
01501 #DISPLAY.LENGTH (N03.0)
01601 #DISPLAY.READ-PASSWORD (A004)
01701 #DISPLAY.SHARE (A003)
01801 #DISPLAY.WRITE-PASSWORD (A004)
01901 #FUNCTION (A008)
02001 #IN-DATA1 (A070/00001:00003)
02101 #IN-DATA2 (A043)
02201 #NAME (A054)
02301 #OUT-DATA1 (A070/00001:00003)
02401 #OUT-DATA2 (A043)
02501 #PASSWORD (A008)
02601 #SUBSTRING-LENGTH (N03.0)
02701 #SUBSTRING-START (N03.0)
0280END-DEFINE
0290FORMAT PS=021 LS=080 ZP=OFF SG=OFF KD=ON  IP=OFF
0300* MAP2: MAP PROFILES *****************************        410***********
0310* .TTAAAMMOO   D I D I N D I D I        ?_)¬&:+(                       *
0320* 023079        N0NNUCN             X        01 SYSPROF YL   #CVAR   1 *
0330************************************************************************
0340INPUT          (     CV=#CVAR                                         /*
0350                                                                       )
0360 002T ##TITLE  (AD=ODL ) /*.01D078 A078 .
0370/
0380/
0390 002T 'JV-Name..........'
0400 020T #NAME  (AD=MYLT'_' CV=#CVAR ) /*.99U054 A054 .
0410/
0420/
0430 002T 'Funktion.........'
0440 020T #FUNCTION  (AD=MIT'_' CD=NE ) /*.99U008 A008 .
0450 029T '(read/write)'
0460 045T 'Substring Laenge ..'
0470 065T #SUBSTRING-LENGTH  (AD=MIRT'_' ) /*.99U003 N03.0.
0480/
0490 002T 'Passwort ........'
0500 020T #PASSWORD  (AD=MILT'_' CD=NE ) /*.99U008 A008 .
0510 045T 'Substring Start....'
0520 065T #SUBSTRING-START  (AD=MIRT'_' CD=NE ) /*.99U003 N03.0.
0530/
0540/
0550 006T '----+----1----+----2----+----3----+----4----+----5----+---'-
0560      '-6----+----7'
0570/
0580 006T #IN-DATA1 (001)  (AD=MILT'_' CD=NE ) /*.99U070 A070 .
0590   /* A1000030000100001000010000100001100003001000001H
0600/
0610 006T #IN-DATA1 (002)  (AD=MILT'_' CD=NE ) /*.99U070 A070 .
0620/
0630 006T #IN-DATA1 (003)  (AD=MILT'_' CD=NE ) /*.99U070 A070 .
0640/
0650 006T #IN-DATA2  (AD=MILT'_' CD=NE ) /*.99U043 A043 .
0660/
0670/
0680 002T 'Share............'
0690 020T #DISPLAY.SHARE  (AD=ODL ) /*.01D003 A003 .
0700 032T 'Laenge ........'
0710 048T #DISPLAY.LENGTH  (AD=ODR ) /*.01D003 N03.0.
0720 055T 'Zugriff ....'
0730 068T #DISPLAY.ACCESS  (AD=ODL ) /*.01U005 A005 .
0740/
0750 002T 'erzeugt am ......'
0760 020T #DISPLAY.CREATION-DATE  (AD=ODL ) /*.01D008 A008 .
0770 032T 'Lesepasswort ..'
0780 048T #DISPLAY.READ-PASSWORD  (AD=ODL ) /*.01D004 A004 .
0790 055T 'JV Typ .....'
0800 068T #DISPLAY.JV-TYPE  (AD=ODL ) /*.01U010 A010 .
0810/
0820 002T 'Sperrfrist ......'
0830 020T #DISPLAY.EXPIRATION-DATE  (AD=ODL ) /*.01D008 A008 .
0840 032T 'Schreibpasswort'
0850 048T #DISPLAY.WRITE-PASSWORD  (AD=ODL ) /*.01D004 A004 .
0860/
0870 006T '----+----1----+----2----+----3----+----4----+----5----+---'-
0880      '-6----+----7'
0890/
0900 006T #OUT-DATA1 (001)  (AD=OD ) /*.01U070 A070 .
0910   /* A1000030000100001000010000100001100003001000001H
0920/
0930 006T #OUT-DATA1 (002)  (AD=OD ) /*.01U070 A070 .
0940/
0950 006T #OUT-DATA1 (003)  (AD=OD ) /*.01U070 A070 .
0960/
0970 006T #OUT-DATA2  (AD=ODT ) /*.01U043 A043 .
0980* MAP2: VALIDATION *****************************************************
0990* MAP2: END OF MAP *****************************************************
1000END
