0010* MAP2: PROTOTYPE
0020* INPUT USING MAP 'XXXXXXXX'
0030*     ##TITLE #CVAR #DISPLAY.ELEMENT(*) #DISPLAY.ELEMENT-TYPE(*)
0040*     #DISPLAY.ELEMENT-VERSION(*) #DISPLAY.MODIF-DATE(*) #DSNAME
0050*     #ELEMENT #ELEMENT-TYPE #ELEMENT-VERSION #PASSWORD
0060DEFINE DATA PARAMETER
00701 ##TITLE (A078)
00801  #CVAR (C)
00901 #DISPLAY.ELEMENT (A064/    1:00015)
01001 #DISPLAY.ELEMENT-TYPE (A008/00001:00015)
01101 #DISPLAY.ELEMENT-VERSION (A024/00001:00015)
01201 #DISPLAY.MODIF-DATE (A014/    1:00015)
01301 #DSNAME (A054)
01401 #ELEMENT (A064)
01501 #ELEMENT-TYPE (A008)
01601 #ELEMENT-VERSION (A024)
01701 #PASSWORD (A008)
0180END-DEFINE
0190FORMAT PS=021 LS=080 ZP=OFF SG=OFF KD=ON  IP=OFF
0200* MAP2: MAP PROFILES *****************************        410***********
0210* .TTAAAMMOO   D I D I N D I D I        ?_)¬&:+(                       *
0220* 023079        N0NNUCN             X        01 SYSPROF YL   #CVAR   1 *
0230************************************************************************
0240INPUT          (     CV=#CVAR                                         /*
0250                                                                       )
0260 002T ##TITLE  (AD=ODL ) /*.01D078 A078 .
0270/
0280/
0290 002T 'Lib:'
0300 007T #DSNAME  (AD=MYT'_' CV=#CVAR ) /*.99U054 A054 .
0310 062T 'Passwort:'
0320 072T #PASSWORD  (AD=MYLT'_' CV=#CVAR ) /*.99U008 A008 .
0330/
0340/
0350 002T 'Typ'
0360 011T 'Element'
0370 049T 'Version'
0380 071T 'Datum'
0390/
0400 002T #ELEMENT-TYPE  (AD=MYT'_' CV=#CVAR ) /*.99U008 A008 .
0410 011T #ELEMENT  (AD=MYLT'_' AL=037  CV=#CVAR ) /*.99U037 A064 .
0420 049T #ELEMENT-VERSION  (AD=MYLT'_' AL=020  CV=#CVAR ) /*.99U020 A024 .
0430 070T '__________'
0440/
0450 002T #DISPLAY.ELEMENT-TYPE (1+000)  (AD=ODL ) /*.01U008 A008 .
0460   /* A1000150000100001    10000100001100015001000001H
0470 011T #DISPLAY.ELEMENT (1+000)  (AD=ODL AL=037  ) /*.01D037 A064 .
0480   /* A1000150000100001    10000100001100015001000001H
0490 049T #DISPLAY.ELEMENT-VERSION (1+000)  (AD=ODL AL=020  ) /*.01U020 A024 .
0500   /* A1000150000100001    10000100001100015001000001H
0510 070T #DISPLAY.MODIF-DATE (1+000)  (AD=ODL AL=010  ) /*.01D010 A014 .
0520   /* A1000150000100001    10000100001100015001000001H
0530/
0540 002T #DISPLAY.ELEMENT-TYPE (1+001)  (AD=ODL ) /*.01U008 A008 .
0550 011T #DISPLAY.ELEMENT (1+001)  (AD=ODL AL=037  ) /*.01D037 A064 .
0560 049T #DISPLAY.ELEMENT-VERSION (1+001)  (AD=ODL AL=020  ) /*.01U020 A024 .
0570 070T #DISPLAY.MODIF-DATE (1+001)  (AD=ODL AL=010  ) /*.01D010 A014 .
0580/
0590 002T #DISPLAY.ELEMENT-TYPE (1+002)  (AD=ODL ) /*.01U008 A008 .
0600 011T #DISPLAY.ELEMENT (1+002)  (AD=ODL AL=037  ) /*.01D037 A064 .
0610 049T #DISPLAY.ELEMENT-VERSION (1+002)  (AD=ODL AL=020  ) /*.01U020 A024 .
0620 070T #DISPLAY.MODIF-DATE (1+002)  (AD=ODL AL=010  ) /*.01D010 A014 .
0630/
0640 002T #DISPLAY.ELEMENT-TYPE (1+003)  (AD=ODL ) /*.01U008 A008 .
0650 011T #DISPLAY.ELEMENT (1+003)  (AD=ODL AL=037  ) /*.01D037 A064 .
0660 049T #DISPLAY.ELEMENT-VERSION (1+003)  (AD=ODL AL=020  ) /*.01U020 A024 .
0670 070T #DISPLAY.MODIF-DATE (1+003)  (AD=ODL AL=010  ) /*.01D010 A014 .
0680/
0690 002T #DISPLAY.ELEMENT-TYPE (1+004)  (AD=ODL ) /*.01U008 A008 .
0700 011T #DISPLAY.ELEMENT (1+004)  (AD=ODL AL=037  ) /*.01D037 A064 .
0710 049T #DISPLAY.ELEMENT-VERSION (1+004)  (AD=ODL AL=020  ) /*.01U020 A024 .
0720 070T #DISPLAY.MODIF-DATE (1+004)  (AD=ODL AL=010  ) /*.01D010 A014 .
0730/
0740 002T #DISPLAY.ELEMENT-TYPE (1+005)  (AD=ODL ) /*.01U008 A008 .
0750 011T #DISPLAY.ELEMENT (1+005)  (AD=ODL AL=037  ) /*.01D037 A064 .
0760 049T #DISPLAY.ELEMENT-VERSION (1+005)  (AD=ODL AL=020  ) /*.01U020 A024 .
0770 070T #DISPLAY.MODIF-DATE (1+005)  (AD=ODL AL=010  ) /*.01D010 A014 .
0780/
0790 002T #DISPLAY.ELEMENT-TYPE (1+006)  (AD=ODL ) /*.01U008 A008 .
0800 011T #DISPLAY.ELEMENT (1+006)  (AD=ODL AL=037  ) /*.01D037 A064 .
0810 049T #DISPLAY.ELEMENT-VERSION (1+006)  (AD=ODL AL=020  ) /*.01U020 A024 .
0820 070T #DISPLAY.MODIF-DATE (1+006)  (AD=ODL AL=010  ) /*.01D010 A014 .
0830/
0840 002T #DISPLAY.ELEMENT-TYPE (1+007)  (AD=ODL ) /*.01U008 A008 .
0850 011T #DISPLAY.ELEMENT (1+007)  (AD=ODL AL=037  ) /*.01D037 A064 .
0860 049T #DISPLAY.ELEMENT-VERSION (1+007)  (AD=ODL AL=020  ) /*.01U020 A024 .
0870 070T #DISPLAY.MODIF-DATE (1+007)  (AD=ODL AL=010  ) /*.01D010 A014 .
0880/
0890 002T #DISPLAY.ELEMENT-TYPE (1+008)  (AD=ODL ) /*.01U008 A008 .
0900 011T #DISPLAY.ELEMENT (1+008)  (AD=ODL AL=037  ) /*.01D037 A064 .
0910 049T #DISPLAY.ELEMENT-VERSION (1+008)  (AD=ODL AL=020  ) /*.01U020 A024 .
0920 070T #DISPLAY.MODIF-DATE (1+008)  (AD=ODL AL=010  ) /*.01D010 A014 .
0930/
0940 002T #DISPLAY.ELEMENT-TYPE (1+009)  (AD=ODL ) /*.01U008 A008 .
0950 011T #DISPLAY.ELEMENT (1+009)  (AD=ODL AL=037  ) /*.01D037 A064 .
0960 049T #DISPLAY.ELEMENT-VERSION (1+009)  (AD=ODL AL=020  ) /*.01U020 A024 .
0970 070T #DISPLAY.MODIF-DATE (1+009)  (AD=ODL AL=010  ) /*.01D010 A014 .
0980/
0990 002T #DISPLAY.ELEMENT-TYPE (1+010)  (AD=ODL ) /*.01U008 A008 .
1000 011T #DISPLAY.ELEMENT (1+010)  (AD=ODL AL=037  ) /*.01D037 A064 .
1010 049T #DISPLAY.ELEMENT-VERSION (1+010)  (AD=ODL AL=020  ) /*.01U020 A024 .
1020 070T #DISPLAY.MODIF-DATE (1+010)  (AD=ODL AL=010  ) /*.01D010 A014 .
1030/
1040 002T #DISPLAY.ELEMENT-TYPE (1+011)  (AD=ODL ) /*.01U008 A008 .
1050 011T #DISPLAY.ELEMENT (1+011)  (AD=ODL AL=037  ) /*.01D037 A064 .
1060 049T #DISPLAY.ELEMENT-VERSION (1+011)  (AD=ODL AL=020  ) /*.01U020 A024 .
1070 070T #DISPLAY.MODIF-DATE (1+011)  (AD=ODL AL=010  ) /*.01D010 A014 .
1080/
1090 002T #DISPLAY.ELEMENT-TYPE (1+012)  (AD=ODL ) /*.01U008 A008 .
1100 011T #DISPLAY.ELEMENT (1+012)  (AD=ODL AL=037  ) /*.01D037 A064 .
1110 049T #DISPLAY.ELEMENT-VERSION (1+012)  (AD=ODL AL=020  ) /*.01U020 A024 .
1120 070T #DISPLAY.MODIF-DATE (1+012)  (AD=ODL AL=010  ) /*.01D010 A014 .
1130/
1140 002T #DISPLAY.ELEMENT-TYPE (1+013)  (AD=ODL ) /*.01U008 A008 .
1150 011T #DISPLAY.ELEMENT (1+013)  (AD=ODL AL=037  ) /*.01D037 A064 .
1160 049T #DISPLAY.ELEMENT-VERSION (1+013)  (AD=ODL AL=020  ) /*.01U020 A024 .
1170 070T #DISPLAY.MODIF-DATE (1+013)  (AD=ODL AL=010  ) /*.01D010 A014 .
1180/
1190 002T #DISPLAY.ELEMENT-TYPE (1+014)  (AD=ODL ) /*.01U008 A008 .
1200 011T #DISPLAY.ELEMENT (1+014)  (AD=ODL AL=037  ) /*.01D037 A064 .
1210 049T #DISPLAY.ELEMENT-VERSION (1+014)  (AD=ODL AL=020  ) /*.01U020 A024 .
1220 070T #DISPLAY.MODIF-DATE (1+014)  (AD=ODL AL=010  ) /*.01D010 A014 .
1230* MAP2: VALIDATION *****************************************************
1240* MAP2: END OF MAP *****************************************************
1250END
