0010* MAP2: PROTOTYPE
0020* INPUT USING MAP 'XXXXXXXX'
0030*     ##TITLE #CVAR #DISPLAY.ELEMENT(*) #DISPLAY.ELEMENT-TYPE(*)
0040*     #DISPLAY.ELEMENT-VERSION(*) #DISPLAY.MODIF-DATE(*) #DSNAME
0050*     #ELEMENT #ELEMENT-TYPE #ELEMENT-VERSION #PASSWORD
0060DEFINE DATA PARAMETER
00701 ##TITLE (A078)
00801  #CVAR (C)
00901 #DISPLAY.ELEMENT (A064/    1:00015)
01001 #DISPLAY.ELEMENT-TYPE (A008/00001:00015)
01101 #DISPLAY.ELEMENT-VERSION (A024/00001:00015)
01201 #DISPLAY.MODIF-DATE (A014/    1:00015)
01301 #DSNAME (A054)
01401 #ELEMENT (A064)
01501 #ELEMENT-TYPE (A008)
01601 #ELEMENT-VERSION (A024)
01701 #PASSWORD (A008)
0180END-DEFINE
0190FORMAT PS=021 LS=080 ZP=OFF SG=OFF KD=ON  IP=OFF
0200* MAP2: MAP PROFILES *****************************        410***********
0210* .TTAAAMMOO   D I D I N D I D I        ?_)¬&:+(                       *
0220* 023079        N0NNUCN             X        01 SYSPROF YL   #CVAR   1 *
0230************************************************************************
0240INPUT          (     CV=#CVAR                                         /*
0250                                                                       )
0260 002T ##TITLE  (AD=ODL ) /*.01D078 A078 .
0270/
0280/
0290 002T 'Lib:'
0300 007T #DSNAME  (AD=MYT'_' CV=#CVAR ) /*.99U054 A054 .
0310 062T 'Password:'
0320 072T #PASSWORD  (AD=MYLT'_' CV=#CVAR ) /*.99U008 A008 .
0330/
0340/
0350 002T 'Type     Element                               Version'
0360 071T 'Date'
0370/
0380 002T #ELEMENT-TYPE  (AD=MYT'_' CV=#CVAR ) /*.99U008 A008 .
0390 011T #ELEMENT  (AD=MYLT'_' AL=037  CV=#CVAR ) /*.99U037 A064 .
0400 049T #ELEMENT-VERSION  (AD=MYLT'_' AL=020  CV=#CVAR ) /*.99U020 A024 .
0410 070T '__________'
0420/
0430 002T #DISPLAY.ELEMENT-TYPE (1+000)  (AD=ODL ) /*.01U008 A008 .
0440   /* A1000150000100001    10000100001100015001000001H
0450 011T #DISPLAY.ELEMENT (1+000)  (AD=ODL AL=037  ) /*.01D037 A064 .
0460   /* A1000150000100001    10000100001100015001000001H
0470 049T #DISPLAY.ELEMENT-VERSION (1+000)  (AD=ODL AL=020  ) /*.01U020 A024 .
0480   /* A1000150000100001    10000100001100015001000001H
0490 070T #DISPLAY.MODIF-DATE (1+000)  (AD=ODL AL=010  ) /*.01D010 A014 .
0500   /* A1000150000100001    10000100001100015001000001H
0510/
0520 002T #DISPLAY.ELEMENT-TYPE (1+001)  (AD=ODL ) /*.01U008 A008 .
0530 011T #DISPLAY.ELEMENT (1+001)  (AD=ODL AL=037  ) /*.01D037 A064 .
0540 049T #DISPLAY.ELEMENT-VERSION (1+001)  (AD=ODL AL=020  ) /*.01U020 A024 .
0550 070T #DISPLAY.MODIF-DATE (1+001)  (AD=ODL AL=010  ) /*.01D010 A014 .
0560/
0570 002T #DISPLAY.ELEMENT-TYPE (1+002)  (AD=ODL ) /*.01U008 A008 .
0580 011T #DISPLAY.ELEMENT (1+002)  (AD=ODL AL=037  ) /*.01D037 A064 .
0590 049T #DISPLAY.ELEMENT-VERSION (1+002)  (AD=ODL AL=020  ) /*.01U020 A024 .
0600 070T #DISPLAY.MODIF-DATE (1+002)  (AD=ODL AL=010  ) /*.01D010 A014 .
0610/
0620 002T #DISPLAY.ELEMENT-TYPE (1+003)  (AD=ODL ) /*.01U008 A008 .
0630 011T #DISPLAY.ELEMENT (1+003)  (AD=ODL AL=037  ) /*.01D037 A064 .
0640 049T #DISPLAY.ELEMENT-VERSION (1+003)  (AD=ODL AL=020  ) /*.01U020 A024 .
0650 070T #DISPLAY.MODIF-DATE (1+003)  (AD=ODL AL=010  ) /*.01D010 A014 .
0660/
0670 002T #DISPLAY.ELEMENT-TYPE (1+004)  (AD=ODL ) /*.01U008 A008 .
0680 011T #DISPLAY.ELEMENT (1+004)  (AD=ODL AL=037  ) /*.01D037 A064 .
0690 049T #DISPLAY.ELEMENT-VERSION (1+004)  (AD=ODL AL=020  ) /*.01U020 A024 .
0700 070T #DISPLAY.MODIF-DATE (1+004)  (AD=ODL AL=010  ) /*.01D010 A014 .
0710/
0720 002T #DISPLAY.ELEMENT-TYPE (1+005)  (AD=ODL ) /*.01U008 A008 .
0730 011T #DISPLAY.ELEMENT (1+005)  (AD=ODL AL=037  ) /*.01D037 A064 .
0740 049T #DISPLAY.ELEMENT-VERSION (1+005)  (AD=ODL AL=020  ) /*.01U020 A024 .
0750 070T #DISPLAY.MODIF-DATE (1+005)  (AD=ODL AL=010  ) /*.01D010 A014 .
0760/
0770 002T #DISPLAY.ELEMENT-TYPE (1+006)  (AD=ODL ) /*.01U008 A008 .
0780 011T #DISPLAY.ELEMENT (1+006)  (AD=ODL AL=037  ) /*.01D037 A064 .
0790 049T #DISPLAY.ELEMENT-VERSION (1+006)  (AD=ODL AL=020  ) /*.01U020 A024 .
0800 070T #DISPLAY.MODIF-DATE (1+006)  (AD=ODL AL=010  ) /*.01D010 A014 .
0810/
0820 002T #DISPLAY.ELEMENT-TYPE (1+007)  (AD=ODL ) /*.01U008 A008 .
0830 011T #DISPLAY.ELEMENT (1+007)  (AD=ODL AL=037  ) /*.01D037 A064 .
0840 049T #DISPLAY.ELEMENT-VERSION (1+007)  (AD=ODL AL=020  ) /*.01U020 A024 .
0850 070T #DISPLAY.MODIF-DATE (1+007)  (AD=ODL AL=010  ) /*.01D010 A014 .
0860/
0870 002T #DISPLAY.ELEMENT-TYPE (1+008)  (AD=ODL ) /*.01U008 A008 .
0880 011T #DISPLAY.ELEMENT (1+008)  (AD=ODL AL=037  ) /*.01D037 A064 .
0890 049T #DISPLAY.ELEMENT-VERSION (1+008)  (AD=ODL AL=020  ) /*.01U020 A024 .
0900 070T #DISPLAY.MODIF-DATE (1+008)  (AD=ODL AL=010  ) /*.01D010 A014 .
0910/
0920 002T #DISPLAY.ELEMENT-TYPE (1+009)  (AD=ODL ) /*.01U008 A008 .
0930 011T #DISPLAY.ELEMENT (1+009)  (AD=ODL AL=037  ) /*.01D037 A064 .
0940 049T #DISPLAY.ELEMENT-VERSION (1+009)  (AD=ODL AL=020  ) /*.01U020 A024 .
0950 070T #DISPLAY.MODIF-DATE (1+009)  (AD=ODL AL=010  ) /*.01D010 A014 .
0960/
0970 002T #DISPLAY.ELEMENT-TYPE (1+010)  (AD=ODL ) /*.01U008 A008 .
0980 011T #DISPLAY.ELEMENT (1+010)  (AD=ODL AL=037  ) /*.01D037 A064 .
0990 049T #DISPLAY.ELEMENT-VERSION (1+010)  (AD=ODL AL=020  ) /*.01U020 A024 .
1000 070T #DISPLAY.MODIF-DATE (1+010)  (AD=ODL AL=010  ) /*.01D010 A014 .
1010/
1020 002T #DISPLAY.ELEMENT-TYPE (1+011)  (AD=ODL ) /*.01U008 A008 .
1030 011T #DISPLAY.ELEMENT (1+011)  (AD=ODL AL=037  ) /*.01D037 A064 .
1040 049T #DISPLAY.ELEMENT-VERSION (1+011)  (AD=ODL AL=020  ) /*.01U020 A024 .
1050 070T #DISPLAY.MODIF-DATE (1+011)  (AD=ODL AL=010  ) /*.01D010 A014 .
1060/
1070 002T #DISPLAY.ELEMENT-TYPE (1+012)  (AD=ODL ) /*.01U008 A008 .
1080 011T #DISPLAY.ELEMENT (1+012)  (AD=ODL AL=037  ) /*.01D037 A064 .
1090 049T #DISPLAY.ELEMENT-VERSION (1+012)  (AD=ODL AL=020  ) /*.01U020 A024 .
1100 070T #DISPLAY.MODIF-DATE (1+012)  (AD=ODL AL=010  ) /*.01D010 A014 .
1110/
1120 002T #DISPLAY.ELEMENT-TYPE (1+013)  (AD=ODL ) /*.01U008 A008 .
1130 011T #DISPLAY.ELEMENT (1+013)  (AD=ODL AL=037  ) /*.01D037 A064 .
1140 049T #DISPLAY.ELEMENT-VERSION (1+013)  (AD=ODL AL=020  ) /*.01U020 A024 .
1150 070T #DISPLAY.MODIF-DATE (1+013)  (AD=ODL AL=010  ) /*.01D010 A014 .
1160/
1170 002T #DISPLAY.ELEMENT-TYPE (1+014)  (AD=ODL ) /*.01U008 A008 .
1180 011T #DISPLAY.ELEMENT (1+014)  (AD=ODL AL=037  ) /*.01D037 A064 .
1190 049T #DISPLAY.ELEMENT-VERSION (1+014)  (AD=ODL AL=020  ) /*.01U020 A024 .
1200 070T #DISPLAY.MODIF-DATE (1+014)  (AD=ODL AL=010  ) /*.01D010 A014 .
1210* MAP2: VALIDATION *****************************************************
1220* MAP2: END OF MAP *****************************************************
1230END
