0010* MAP2: PROTOTYPE
0020* INPUT USING MAP 'XXXXXXXX'
0030*     ##TITLE #DSNAME #ELEMENT #ELEMENT-PASSWORD #ELEMENT-TYPE
0040*     #ELEMENT-VERSION #FUNCTION #NEWNAME-ELEMENT
0050*     #NEWNAME-ELEMENT-PASSWORD #NEWNAME-ELEMENT-TYPE
0060*     #NEWNAME-ELEMENT-VERSION #OVERWRITE #PASSWORD #VOLSER
0070DEFINE DATA PARAMETER
00801 ##TITLE (A078)
00901 #DSNAME (A054)
01001 #ELEMENT (A064)
01101 #ELEMENT-PASSWORD (A008)
01201 #ELEMENT-TYPE (A008)
01301 #ELEMENT-VERSION (A024)
01401 #FUNCTION (A008)
01501 #NEWNAME-ELEMENT (A064)
01601 #NEWNAME-ELEMENT-PASSWORD (A008)
01701 #NEWNAME-ELEMENT-TYPE (A008)
01801 #NEWNAME-ELEMENT-VERSION (A024)
01901 #OVERWRITE (A003)
02001 #PASSWORD (A008)
02101 #VOLSER (A006)
0220END-DEFINE
0230FORMAT PS=021 LS=080 ZP=OFF SG=OFF KD=ON  IP=OFF
0240* MAP2: MAP PROFILES *****************************        410***********
0250* .TTAAAMMOO   D I D I N D I D I        ?_)¬&:+(                       *
0260* 023079        N0NNUCN             X        01 SYSPROF YL           1 *
0270************************************************************************
0280INPUT          (     IP=OFF                                           /*
0290                                                                       )
0300 002T ##TITLE  (AD=ODL ) /*.01D078 A078 .
0310/
0320/
0330 002T 'Function........'
0340 019T #FUNCTION  (AD=MILT'_' ) /*.99D008 A008 .
0350 028T '(rename/scratch)'
0360/
0370/
0380 002T 'Dsname..........'
0390 019T #DSNAME  (AD=MILT'_' ) /*.99D054 A054 .
0400/
0410 002T 'Volser..........'
0420 019T #VOLSER  (AD=MILT'_' ) /*.99D006 A006 .
0430/
0440 002T 'Password........'
0450 019T #PASSWORD  (AD=MILT'_' ) /*.99D008 A008 .
0460/
0470/
0480 002T 'Type............'
0490 019T #ELEMENT-TYPE  (AD=MILT'_' ) /*.99D008 A008 .
0500/
0510 002T 'Element.........'
0520 019T #ELEMENT  (AD=MILT'_' AL=060  ) /*.99D060 A064 .
0530/
0540 002T 'Version.........'
0550 019T #ELEMENT-VERSION  (AD=MILT'_' ) /*.99U024 A024 .
0560/
0570 002T 'Password........'
0580 019T #ELEMENT-PASSWORD  (AD=MILT'_' ) /*.99D008 A008 .
0590/
0600/
0610 002T 'New Type........'
0620 019T #NEWNAME-ELEMENT-TYPE  (AD=MILT'_' ) /*.99D008 A008 .
0630/
0640 002T 'New Name........'
0650 019T #NEWNAME-ELEMENT  (AD=MILT'_' AL=060  ) /*.99D060 A064 .
0660/
0670 002T 'New Version.....'
0680 019T #NEWNAME-ELEMENT-VERSION  (AD=MILT'_' ) /*.99U024 A024 .
0690/
0700 002T 'New Password ...'
0710 019T #NEWNAME-ELEMENT-PASSWORD  (AD=MIT ) /*.99U008 A008 .
0720 028T '(if target already exists)'
0730/
0740/
0750 002T 'Overwrite.......'
0760 019T #OVERWRITE  (AD=MILT'_' ) /*.99D003 A003 .
0770 024T '(yes/no)'
0780/
0790/
0800* MAP2: VALIDATION *****************************************************
0810* MAP2: END OF MAP *****************************************************
0820END
