0010* MAP2: PROTOTYPE
0020* INPUT USING MAP 'XXXXXXXX'
0030*     ##TITLE #ADDRESS #AREA(*) #AREA-ADR(*) #AREA-HEX(*,*) #CV-MAP
0040*     #CV-POOL-ID #OFFSET #POOL-ID #SCOPE
0050DEFINE DATA PARAMETER
00601 ##TITLE (A078)
00701 #ADDRESS (B004)
00801 #AREA (A018/00001:00015)
00901 #AREA-ADR (B004/00001:00015)
01001 #AREA-HEX (B004/00001:00015,00001:00004)
01101  #CV-MAP (C)
01201  #CV-POOL-ID (C)
01301 #OFFSET (B004)
01401 #POOL-ID (A054)
01501 #SCOPE (A006)
0160END-DEFINE
0170FORMAT PS=021 LS=080 ZP=OFF SG=OFF KD=ON  IP=OFF
0180* MAP2: MAP PROFILES *****************************        410***********
0190* .TTAAAMMOO   D I D I N D I D I        ?_)¬&:+(                       *
0200* 023079        N0 NUCN             X        01 SYSPROF YL           1 *
0210************************************************************************
0220INPUT          (     IP=OFF                                           /*
0230                                                                       )
0240 002T ##TITLE  (AD=OD ) /*.01U078 A078 .
0250/
0260/
0270/
0280 002T 'Pool Id ..'
0290 013T #POOL-ID  (AD=MYLT'_' CV=#CV-POOL-ID ) /*.99U054 A054 .
0300/
0310 002T 'Addresse .'
0320 013T #ADDRESS  (AD=MYT CV=#CV-MAP ) /*.99U008 B004 .
0330 024T 'Offset ...'
0340 035T #OFFSET  (AD=MYT CV=#CV-MAP ) /*.99U008 B004 .
0350 046T 'Scope..'
0360 054T #SCOPE  (AD=MYLT'_' CV=#CV-POOL-ID ) /*.99U006 A006 .
0370/
0380/
0390 002T #AREA-ADR (001)  (AD=OD ) /*.01U008 B004 .
0400   /* A1000150000100001000010000100001100015001000001H
0410 013T #AREA-HEX (001,001)  (AD=OD ) /*.01U008 B004 .
0420   /* A2000150000400001000010000100001120015004000003H
0430 024T #AREA-HEX (001,002)  (AD=OD ) /*.01U008 B004 .
0440 035T #AREA-HEX (001,003)  (AD=OD ) /*.01U008 B004 .
0450 046T #AREA-HEX (001,004)  (AD=OD ) /*.01U008 B004 .
0460 057T #AREA (001)  (AD=OD ) /*.01U018 A018 .
0470   /* A1000150000100001000010000100001100015001000001H
0480/
0490 002T #AREA-ADR (002)  (AD=OD ) /*.01U008 B004 .
0500 013T #AREA-HEX (002,001)  (AD=OD ) /*.01U008 B004 .
0510 024T #AREA-HEX (002,002)  (AD=OD ) /*.01U008 B004 .
0520 035T #AREA-HEX (002,003)  (AD=OD ) /*.01U008 B004 .
0530 046T #AREA-HEX (002,004)  (AD=OD ) /*.01U008 B004 .
0540 057T #AREA (002)  (AD=OD ) /*.01U018 A018 .
0550/
0560 002T #AREA-ADR (003)  (AD=OD ) /*.01U008 B004 .
0570 013T #AREA-HEX (003,001)  (AD=OD ) /*.01U008 B004 .
0580 024T #AREA-HEX (003,002)  (AD=OD ) /*.01U008 B004 .
0590 035T #AREA-HEX (003,003)  (AD=OD ) /*.01U008 B004 .
0600 046T #AREA-HEX (003,004)  (AD=OD ) /*.01U008 B004 .
0610 057T #AREA (003)  (AD=OD ) /*.01U018 A018 .
0620/
0630 002T #AREA-ADR (004)  (AD=OD ) /*.01U008 B004 .
0640 013T #AREA-HEX (004,001)  (AD=OD ) /*.01U008 B004 .
0650 024T #AREA-HEX (004,002)  (AD=OD ) /*.01U008 B004 .
0660 035T #AREA-HEX (004,003)  (AD=OD ) /*.01U008 B004 .
0670 046T #AREA-HEX (004,004)  (AD=OD ) /*.01U008 B004 .
0680 057T #AREA (004)  (AD=OD ) /*.01U018 A018 .
0690/
0700 002T #AREA-ADR (005)  (AD=OD ) /*.01U008 B004 .
0710 013T #AREA-HEX (005,001)  (AD=OD ) /*.01U008 B004 .
0720 024T #AREA-HEX (005,002)  (AD=OD ) /*.01U008 B004 .
0730 035T #AREA-HEX (005,003)  (AD=OD ) /*.01U008 B004 .
0740 046T #AREA-HEX (005,004)  (AD=OD ) /*.01U008 B004 .
0750 057T #AREA (005)  (AD=OD ) /*.01U018 A018 .
0760/
0770 002T #AREA-ADR (006)  (AD=OD ) /*.01U008 B004 .
0780 013T #AREA-HEX (006,001)  (AD=OD ) /*.01U008 B004 .
0790 024T #AREA-HEX (006,002)  (AD=OD ) /*.01U008 B004 .
0800 035T #AREA-HEX (006,003)  (AD=OD ) /*.01U008 B004 .
0810 046T #AREA-HEX (006,004)  (AD=OD ) /*.01U008 B004 .
0820 057T #AREA (006)  (AD=OD ) /*.01U018 A018 .
0830/
0840 002T #AREA-ADR (007)  (AD=OD ) /*.01U008 B004 .
0850 013T #AREA-HEX (007,001)  (AD=OD ) /*.01U008 B004 .
0860 024T #AREA-HEX (007,002)  (AD=OD ) /*.01U008 B004 .
0870 035T #AREA-HEX (007,003)  (AD=OD ) /*.01U008 B004 .
0880 046T #AREA-HEX (007,004)  (AD=OD ) /*.01U008 B004 .
0890 057T #AREA (007)  (AD=OD ) /*.01U018 A018 .
0900/
0910 002T #AREA-ADR (008)  (AD=OD ) /*.01U008 B004 .
0920 013T #AREA-HEX (008,001)  (AD=OD ) /*.01U008 B004 .
0930 024T #AREA-HEX (008,002)  (AD=OD ) /*.01U008 B004 .
0940 035T #AREA-HEX (008,003)  (AD=OD ) /*.01U008 B004 .
0950 046T #AREA-HEX (008,004)  (AD=OD ) /*.01U008 B004 .
0960 057T #AREA (008)  (AD=OD ) /*.01U018 A018 .
0970/
0980 002T #AREA-ADR (009)  (AD=OD ) /*.01U008 B004 .
0990 013T #AREA-HEX (009,001)  (AD=OD ) /*.01U008 B004 .
1000 024T #AREA-HEX (009,002)  (AD=OD ) /*.01U008 B004 .
1010 035T #AREA-HEX (009,003)  (AD=OD ) /*.01U008 B004 .
1020 046T #AREA-HEX (009,004)  (AD=OD ) /*.01U008 B004 .
1030 057T #AREA (009)  (AD=OD ) /*.01U018 A018 .
1040/
1050 002T #AREA-ADR (010)  (AD=OD ) /*.01U008 B004 .
1060 013T #AREA-HEX (010,001)  (AD=OD ) /*.01U008 B004 .
1070 024T #AREA-HEX (010,002)  (AD=OD ) /*.01U008 B004 .
1080 035T #AREA-HEX (010,003)  (AD=OD ) /*.01U008 B004 .
1090 046T #AREA-HEX (010,004)  (AD=OD ) /*.01U008 B004 .
1100 057T #AREA (010)  (AD=OD ) /*.01U018 A018 .
1110/
1120 002T #AREA-ADR (011)  (AD=OD ) /*.01U008 B004 .
1130 013T #AREA-HEX (011,001)  (AD=OD ) /*.01U008 B004 .
1140 024T #AREA-HEX (011,002)  (AD=OD ) /*.01U008 B004 .
1150 035T #AREA-HEX (011,003)  (AD=OD ) /*.01U008 B004 .
1160 046T #AREA-HEX (011,004)  (AD=OD ) /*.01U008 B004 .
1170 057T #AREA (011)  (AD=OD ) /*.01U018 A018 .
1180/
1190 002T #AREA-ADR (012)  (AD=OD ) /*.01U008 B004 .
1200 013T #AREA-HEX (012,001)  (AD=OD ) /*.01U008 B004 .
1210 024T #AREA-HEX (012,002)  (AD=OD ) /*.01U008 B004 .
1220 035T #AREA-HEX (012,003)  (AD=OD ) /*.01U008 B004 .
1230 046T #AREA-HEX (012,004)  (AD=OD ) /*.01U008 B004 .
1240 057T #AREA (012)  (AD=OD ) /*.01U018 A018 .
1250/
1260 002T #AREA-ADR (013)  (AD=OD ) /*.01U008 B004 .
1270 013T #AREA-HEX (013,001)  (AD=OD ) /*.01U008 B004 .
1280 024T #AREA-HEX (013,002)  (AD=OD ) /*.01U008 B004 .
1290 035T #AREA-HEX (013,003)  (AD=OD ) /*.01U008 B004 .
1300 046T #AREA-HEX (013,004)  (AD=OD ) /*.01U008 B004 .
1310 057T #AREA (013)  (AD=OD ) /*.01U018 A018 .
1320/
1330 002T #AREA-ADR (014)  (AD=OD ) /*.01U008 B004 .
1340 013T #AREA-HEX (014,001)  (AD=OD ) /*.01U008 B004 .
1350 024T #AREA-HEX (014,002)  (AD=OD ) /*.01U008 B004 .
1360 035T #AREA-HEX (014,003)  (AD=OD ) /*.01U008 B004 .
1370 046T #AREA-HEX (014,004)  (AD=OD ) /*.01U008 B004 .
1380 057T #AREA (014)  (AD=OD ) /*.01U018 A018 .
1390/
1400 002T #AREA-ADR (015)  (AD=OD ) /*.01U008 B004 .
1410 013T #AREA-HEX (015,001)  (AD=OD ) /*.01U008 B004 .
1420 024T #AREA-HEX (015,002)  (AD=OD ) /*.01U008 B004 .
1430 035T #AREA-HEX (015,003)  (AD=OD ) /*.01U008 B004 .
1440 046T #AREA-HEX (015,004)  (AD=OD ) /*.01U008 B004 .
1450 057T #AREA (015)  (AD=OD ) /*.01U018 A018 .
1460* MAP2: VALIDATION *****************************************************
1470* MAP2: END OF MAP *****************************************************
1480END
