0010* MAP2: PROTOTYPE
0020* INPUT USING MAP 'XXXXXXXX'
0030*     ##TITLE #CVAR #DISPLAY.ADABAS-ID(*) #DISPLAY.CPU(*)
0040*     #DISPLAY.INTERNAL-TASK(*) #DISPLAY.IO-COUNT(*)
0050*     #DISPLAY.LAST-ACTIVITY(*) #DISPLAY.NATPROC-ID(*)
0060*     #DISPLAY.TASK-ID(*) #DISPLAY.USER-ID(*) #FULL-SCAN #USER-ID
0070DEFINE DATA PARAMETER
00801 ##TITLE (A078)
00901  #CVAR (C)
01001 #DISPLAY.ADABAS-ID (A008/00001:00015)
01101 #DISPLAY.CPU (N05.2/00001:00015)
01201 #DISPLAY.INTERNAL-TASK (A003/00001:00015)
01301 #DISPLAY.IO-COUNT (N07.0/00001:00015)
01401 #DISPLAY.LAST-ACTIVITY (N05.0/00001:00015)
01501 #DISPLAY.NATPROC-ID (A004/00001:00015)
01601 #DISPLAY.TASK-ID (A016/00001:00015)
01701 #DISPLAY.USER-ID (A008/00001:00015)
01801 #FULL-SCAN (A003)
01901 #USER-ID (A008)
0200END-DEFINE
0210FORMAT PS=021 LS=080 ZP=OFF SG=OFF KD=ON  IP=OFF
0220* MAP2: MAP PROFILES *****************************        410***********
0230* .TTAAAMMOO   D I D I N D I D I        ?_)¬&:+(                       *
0240* 023079        N0NNUCN             X        01 SYSPROF YL   #CVAR   1 *
0250************************************************************************
0260INPUT          (     CV=#CVAR                                         /*
0270                                                                       )
0280 002T ##TITLE  (AD=ODL ) /*.01D078 A078 .
0290/
0300/
0310 005T 'LogonID'
0320 014T 'Int ADA ID'
0330 027T 'ESY ID Zuletzt Aktiv(sec) Cpu verb Anzahl IO Task ID'
0340/
0350 005T #USER-ID  (AD=MYLT'_' CD=NE CV=#CVAR ) /*.99U008 A008 .
0360 014T #FULL-SCAN  (AD=MYLT'_' ) /*.99U003 A003 .
0370 018T '________ ______'
0380 034T '_' (018)
0390 053T '________ ________ ________'
0400/
0410 005T #DISPLAY.USER-ID (1+000)  (AD=ODL ) /*.01D008 A008 .
0420   /**A1000150000100001000010000100001100015001001000001000HV
0430 014T #DISPLAY.INTERNAL-TASK (1+000)  (AD=OD ) /*.01U003 A003 .
0440   /**A1000150000100001000010000100001100015001001000001005HV
0450 018T #DISPLAY.ADABAS-ID (1+000)  (AD=ODL ) /*.01U008 A008 .
0460   /**A1000150000100001000010000100001100015001001000001000HV
0470 027T #DISPLAY.NATPROC-ID (1+000)  (AD=ODL ) /*.01D004 A004 .
0480   /**A1000150000100001000010000100001100015001001000001004HV
0490 047T #DISPLAY.LAST-ACTIVITY (1+000)  (AD=ODR ) /*.01D005 N05.0.
0500   /**A1000150000100001000010000100001100015001001000001003HV
0510 053T #DISPLAY.CPU (1+000)  (AD=ODR ) /*.01D008 N05.2.
0520   /**A1000150000100001000010000100001100015001001000001000HV
0530 063T #DISPLAY.IO-COUNT (1+000)  (AD=ODR ) /*.01D007 N07.0.
0540   /**A1000150000100001000010000100001100015001001000001001HV
0550 071T #DISPLAY.TASK-ID (1+000)  (AD=OD AL=008  ) /*.01U008 A016 .
0560   /**A1000150000100001000010000100001100015001001000001000HV
0570/
0580 005T #DISPLAY.USER-ID (1+001)  (AD=ODL ) /*.01D008 A008 .
0590 014T #DISPLAY.INTERNAL-TASK (1+001)  (AD=OD ) /*.01U003 A003 .
0600 018T #DISPLAY.ADABAS-ID (1+001)  (AD=ODL ) /*.01U008 A008 .
0610 027T #DISPLAY.NATPROC-ID (1+001)  (AD=ODL ) /*.01D004 A004 .
0620 047T #DISPLAY.LAST-ACTIVITY (1+001)  (AD=ODR ) /*.01D005 N05.0.
0630 053T #DISPLAY.CPU (1+001)  (AD=ODR ) /*.01D008 N05.2.
0640 063T #DISPLAY.IO-COUNT (1+001)  (AD=ODR ) /*.01D007 N07.0.
0650 071T #DISPLAY.TASK-ID (1+001)  (AD=OD AL=008  ) /*.01U008 A016 .
0660/
0670 005T #DISPLAY.USER-ID (1+002)  (AD=ODL ) /*.01D008 A008 .
0680 014T #DISPLAY.INTERNAL-TASK (1+002)  (AD=OD ) /*.01U003 A003 .
0690 018T #DISPLAY.ADABAS-ID (1+002)  (AD=ODL ) /*.01U008 A008 .
0700 027T #DISPLAY.NATPROC-ID (1+002)  (AD=ODL ) /*.01D004 A004 .
0710 047T #DISPLAY.LAST-ACTIVITY (1+002)  (AD=ODR ) /*.01D005 N05.0.
0720 053T #DISPLAY.CPU (1+002)  (AD=ODR ) /*.01D008 N05.2.
0730 063T #DISPLAY.IO-COUNT (1+002)  (AD=ODR ) /*.01D007 N07.0.
0740 071T #DISPLAY.TASK-ID (1+002)  (AD=OD AL=008  ) /*.01U008 A016 .
0750/
0760 005T #DISPLAY.USER-ID (1+003)  (AD=ODL ) /*.01D008 A008 .
0770 014T #DISPLAY.INTERNAL-TASK (1+003)  (AD=OD ) /*.01U003 A003 .
0780 018T #DISPLAY.ADABAS-ID (1+003)  (AD=ODL ) /*.01U008 A008 .
0790 027T #DISPLAY.NATPROC-ID (1+003)  (AD=ODL ) /*.01D004 A004 .
0800 047T #DISPLAY.LAST-ACTIVITY (1+003)  (AD=ODR ) /*.01D005 N05.0.
0810 053T #DISPLAY.CPU (1+003)  (AD=ODR ) /*.01D008 N05.2.
0820 063T #DISPLAY.IO-COUNT (1+003)  (AD=ODR ) /*.01D007 N07.0.
0830 071T #DISPLAY.TASK-ID (1+003)  (AD=OD AL=008  ) /*.01U008 A016 .
0840/
0850 005T #DISPLAY.USER-ID (1+004)  (AD=ODL ) /*.01D008 A008 .
0860 014T #DISPLAY.INTERNAL-TASK (1+004)  (AD=OD ) /*.01U003 A003 .
0870 018T #DISPLAY.ADABAS-ID (1+004)  (AD=ODL ) /*.01U008 A008 .
0880 027T #DISPLAY.NATPROC-ID (1+004)  (AD=ODL ) /*.01D004 A004 .
0890 047T #DISPLAY.LAST-ACTIVITY (1+004)  (AD=ODR ) /*.01D005 N05.0.
0900 053T #DISPLAY.CPU (1+004)  (AD=ODR ) /*.01D008 N05.2.
0910 063T #DISPLAY.IO-COUNT (1+004)  (AD=ODR ) /*.01D007 N07.0.
0920 071T #DISPLAY.TASK-ID (1+004)  (AD=OD AL=008  ) /*.01U008 A016 .
0930/
0940 005T #DISPLAY.USER-ID (1+005)  (AD=ODL ) /*.01D008 A008 .
0950 014T #DISPLAY.INTERNAL-TASK (1+005)  (AD=OD ) /*.01U003 A003 .
0960 018T #DISPLAY.ADABAS-ID (1+005)  (AD=ODL ) /*.01U008 A008 .
0970 027T #DISPLAY.NATPROC-ID (1+005)  (AD=ODL ) /*.01D004 A004 .
0980 047T #DISPLAY.LAST-ACTIVITY (1+005)  (AD=ODR ) /*.01D005 N05.0.
0990 053T #DISPLAY.CPU (1+005)  (AD=ODR ) /*.01D008 N05.2.
1000 063T #DISPLAY.IO-COUNT (1+005)  (AD=ODR ) /*.01D007 N07.0.
1010 071T #DISPLAY.TASK-ID (1+005)  (AD=OD AL=008  ) /*.01U008 A016 .
1020/
1030 005T #DISPLAY.USER-ID (1+006)  (AD=ODL ) /*.01D008 A008 .
1040 014T #DISPLAY.INTERNAL-TASK (1+006)  (AD=OD ) /*.01U003 A003 .
1050 018T #DISPLAY.ADABAS-ID (1+006)  (AD=ODL ) /*.01U008 A008 .
1060 027T #DISPLAY.NATPROC-ID (1+006)  (AD=ODL ) /*.01D004 A004 .
1070 047T #DISPLAY.LAST-ACTIVITY (1+006)  (AD=ODR ) /*.01D005 N05.0.
1080 053T #DISPLAY.CPU (1+006)  (AD=ODR ) /*.01D008 N05.2.
1090 063T #DISPLAY.IO-COUNT (1+006)  (AD=ODR ) /*.01D007 N07.0.
1100 071T #DISPLAY.TASK-ID (1+006)  (AD=OD AL=008  ) /*.01U008 A016 .
1110/
1120 005T #DISPLAY.USER-ID (1+007)  (AD=ODL ) /*.01D008 A008 .
1130 014T #DISPLAY.INTERNAL-TASK (1+007)  (AD=OD ) /*.01U003 A003 .
1140 018T #DISPLAY.ADABAS-ID (1+007)  (AD=ODL ) /*.01U008 A008 .
1150 027T #DISPLAY.NATPROC-ID (1+007)  (AD=ODL ) /*.01D004 A004 .
1160 047T #DISPLAY.LAST-ACTIVITY (1+007)  (AD=ODR ) /*.01D005 N05.0.
1170 053T #DISPLAY.CPU (1+007)  (AD=ODR ) /*.01D008 N05.2.
1180 063T #DISPLAY.IO-COUNT (1+007)  (AD=ODR ) /*.01D007 N07.0.
1190 071T #DISPLAY.TASK-ID (1+007)  (AD=OD AL=008  ) /*.01U008 A016 .
1200/
1210 005T #DISPLAY.USER-ID (1+008)  (AD=ODL ) /*.01D008 A008 .
1220 014T #DISPLAY.INTERNAL-TASK (1+008)  (AD=OD ) /*.01U003 A003 .
1230 018T #DISPLAY.ADABAS-ID (1+008)  (AD=ODL ) /*.01U008 A008 .
1240 027T #DISPLAY.NATPROC-ID (1+008)  (AD=ODL ) /*.01D004 A004 .
1250 047T #DISPLAY.LAST-ACTIVITY (1+008)  (AD=ODR ) /*.01D005 N05.0.
1260 053T #DISPLAY.CPU (1+008)  (AD=ODR ) /*.01D008 N05.2.
1270 063T #DISPLAY.IO-COUNT (1+008)  (AD=ODR ) /*.01D007 N07.0.
1280 071T #DISPLAY.TASK-ID (1+008)  (AD=OD AL=008  ) /*.01U008 A016 .
1290/
1300 005T #DISPLAY.USER-ID (1+009)  (AD=ODL ) /*.01D008 A008 .
1310 014T #DISPLAY.INTERNAL-TASK (1+009)  (AD=OD ) /*.01U003 A003 .
1320 018T #DISPLAY.ADABAS-ID (1+009)  (AD=ODL ) /*.01U008 A008 .
1330 027T #DISPLAY.NATPROC-ID (1+009)  (AD=ODL ) /*.01D004 A004 .
1340 047T #DISPLAY.LAST-ACTIVITY (1+009)  (AD=ODR ) /*.01D005 N05.0.
1350 053T #DISPLAY.CPU (1+009)  (AD=ODR ) /*.01D008 N05.2.
1360 063T #DISPLAY.IO-COUNT (1+009)  (AD=ODR ) /*.01D007 N07.0.
1370 071T #DISPLAY.TASK-ID (1+009)  (AD=OD AL=008  ) /*.01U008 A016 .
1380/
1390 005T #DISPLAY.USER-ID (1+010)  (AD=ODL ) /*.01D008 A008 .
1400 014T #DISPLAY.INTERNAL-TASK (1+010)  (AD=OD ) /*.01U003 A003 .
1410 018T #DISPLAY.ADABAS-ID (1+010)  (AD=ODL ) /*.01U008 A008 .
1420 027T #DISPLAY.NATPROC-ID (1+010)  (AD=ODL ) /*.01D004 A004 .
1430 047T #DISPLAY.LAST-ACTIVITY (1+010)  (AD=ODR ) /*.01D005 N05.0.
1440 053T #DISPLAY.CPU (1+010)  (AD=ODR ) /*.01D008 N05.2.
1450 063T #DISPLAY.IO-COUNT (1+010)  (AD=ODR ) /*.01D007 N07.0.
1460 071T #DISPLAY.TASK-ID (1+010)  (AD=OD AL=008  ) /*.01U008 A016 .
1470/
1480 005T #DISPLAY.USER-ID (1+011)  (AD=ODL ) /*.01D008 A008 .
1490 014T #DISPLAY.INTERNAL-TASK (1+011)  (AD=OD ) /*.01U003 A003 .
1500 018T #DISPLAY.ADABAS-ID (1+011)  (AD=ODL ) /*.01U008 A008 .
1510 027T #DISPLAY.NATPROC-ID (1+011)  (AD=ODL ) /*.01D004 A004 .
1520 047T #DISPLAY.LAST-ACTIVITY (1+011)  (AD=ODR ) /*.01D005 N05.0.
1530 053T #DISPLAY.CPU (1+011)  (AD=ODR ) /*.01D008 N05.2.
1540 063T #DISPLAY.IO-COUNT (1+011)  (AD=ODR ) /*.01D007 N07.0.
1550 071T #DISPLAY.TASK-ID (1+011)  (AD=OD AL=008  ) /*.01U008 A016 .
1560/
1570 005T #DISPLAY.USER-ID (1+012)  (AD=ODL ) /*.01D008 A008 .
1580 014T #DISPLAY.INTERNAL-TASK (1+012)  (AD=OD ) /*.01U003 A003 .
1590 018T #DISPLAY.ADABAS-ID (1+012)  (AD=ODL ) /*.01U008 A008 .
1600 027T #DISPLAY.NATPROC-ID (1+012)  (AD=ODL ) /*.01D004 A004 .
1610 047T #DISPLAY.LAST-ACTIVITY (1+012)  (AD=ODR ) /*.01D005 N05.0.
1620 053T #DISPLAY.CPU (1+012)  (AD=ODR ) /*.01D008 N05.2.
1630 063T #DISPLAY.IO-COUNT (1+012)  (AD=ODR ) /*.01D007 N07.0.
1640 071T #DISPLAY.TASK-ID (1+012)  (AD=OD AL=008  ) /*.01U008 A016 .
1650/
1660 005T #DISPLAY.USER-ID (1+013)  (AD=ODL ) /*.01D008 A008 .
1670 014T #DISPLAY.INTERNAL-TASK (1+013)  (AD=OD ) /*.01U003 A003 .
1680 018T #DISPLAY.ADABAS-ID (1+013)  (AD=ODL ) /*.01U008 A008 .
1690 027T #DISPLAY.NATPROC-ID (1+013)  (AD=ODL ) /*.01D004 A004 .
1700 047T #DISPLAY.LAST-ACTIVITY (1+013)  (AD=ODR ) /*.01D005 N05.0.
1710 053T #DISPLAY.CPU (1+013)  (AD=ODR ) /*.01D008 N05.2.
1720 063T #DISPLAY.IO-COUNT (1+013)  (AD=ODR ) /*.01D007 N07.0.
1730 071T #DISPLAY.TASK-ID (1+013)  (AD=OD AL=008  ) /*.01U008 A016 .
1740/
1750 005T #DISPLAY.USER-ID (1+014)  (AD=ODL ) /*.01D008 A008 .
1760 014T #DISPLAY.INTERNAL-TASK (1+014)  (AD=OD ) /*.01U003 A003 .
1770 018T #DISPLAY.ADABAS-ID (1+014)  (AD=ODL ) /*.01U008 A008 .
1780 027T #DISPLAY.NATPROC-ID (1+014)  (AD=ODL ) /*.01D004 A004 .
1790 047T #DISPLAY.LAST-ACTIVITY (1+014)  (AD=ODR ) /*.01D005 N05.0.
1800 053T #DISPLAY.CPU (1+014)  (AD=ODR ) /*.01D008 N05.2.
1810 063T #DISPLAY.IO-COUNT (1+014)  (AD=ODR ) /*.01D007 N07.0.
1820 071T #DISPLAY.TASK-ID (1+014)  (AD=OD AL=008  ) /*.01U008 A016 .
1830/
1840/
1850* MAP2: VALIDATION *****************************************************
1860* MAP2: END OF MAP *****************************************************
1870END
