0010* MAP2: PROTOTYPE
0020* INPUT USING MAP 'XXXXXXXX'
0030*     ##TITLE #DISPOSITION #DSNAME #ELEMENT #ELEMENT-PASSWORD
0040*     #ELEMENT-TYPE #ELEMENT-VERSION #PASSWORD #TRANS-PGM(*)
0050DEFINE DATA PARAMETER
00601 ##TITLE (A078)
00701 #DISPOSITION (A003)
00801 #DSNAME (A054)
00901 #ELEMENT (A064)
01001 #ELEMENT-PASSWORD (A008)
01101 #ELEMENT-TYPE (A008)
01201 #ELEMENT-VERSION (A024)
01301 #PASSWORD (A008)
01401 #TRANS-PGM (A008/00001:00005)
0150END-DEFINE
0160FORMAT PS=021 LS=080 ZP=OFF SG=OFF KD=ON  IP=OFF
0170* MAP2: MAP PROFILES *****************************        410***********
0180* .TTAAAMMOO   D I D I N D I D I        ?_)¬&:+(                       *
0190* 023079        N0NNUCN             X        01 SYSPROF YL           1 *
0200************************************************************************
0210INPUT          (     IP=OFF                                           /*
0220                                                                       )
0230 002T ##TITLE  (AD=ODL ) /*.01U078 A078 .
0240/
0250/
0260/
0270/
0280 002T 'Translation PGM .....'
0290 024T #TRANS-PGM (001)  (AD=MILT'_' CD=NE ) /*.99U008 A008 .
0300   /* A1000050000100001000010000100001010001005000001H
0310 033T #TRANS-PGM (002)  (AD=MILT'_' CD=NE ) /*.99U008 A008 .
0320 042T #TRANS-PGM (003)  (AD=MILT'_' CD=NE ) /*.99U008 A008 .
0330 051T #TRANS-PGM (004)  (AD=MILT'_' CD=NE ) /*.99U008 A008 .
0340 060T #TRANS-PGM (005)  (AD=MILT'_' CD=NE ) /*.99U008 A008 .
0350/
0360/
0370 002T 'Dsname...............'
0380 024T #DSNAME  (AD=MILT'_' CD=NE ) /*.99D054 A054 .
0390/
0400 002T 'Password.............'
0410 024T #PASSWORD  (AD=MILT'_' CD=NE ) /*.99U008 A008 .
0420/
0430/
0440 002T 'Element-Type.........'
0450 024T #ELEMENT-TYPE  (AD=MILT'_' CD=NE ) /*.99U008 A008 .
0460/
0470 002T 'Element..............'
0480 024T #ELEMENT  (AD=MILT'_' CD=NE AL=054  ) /*.99U054 A064 .
0490/
0500 002T 'Version..............'
0510 024T #ELEMENT-VERSION  (AD=MILT'_' CD=NE ) /*.99U024 A024 .
0520/
0530 002T 'Password ............'
0540 024T #ELEMENT-PASSWORD  (AD=MILT'_' CD=NE ) /*.99U008 A008 .
0550/
0560/
0570 002T 'Disposition..........'
0580 024T #DISPOSITION  (AD=MILT'_' CD=NE ) /*.99U003 A003 .
0590 028T '(MOD/NEW)'
0600/
0610/
0620/
0630/
0640/
0650/
0660* MAP2: VALIDATION *****************************************************
0670* MAP2: END OF MAP *****************************************************
0680END
