0010* MAP2: PROTOTYPE
0020* INPUT USING MAP 'XXXXXXXX'
0030*     ##TITLE #DSNAME #TRANS-PGM(*) #VOLSER
0040DEFINE DATA PARAMETER
00501 ##TITLE (A078)
00601 #DSNAME (A054)
00701 #TRANS-PGM (A008/00001:00005)
00801 #VOLSER (A006)
0090END-DEFINE
0100FORMAT PS=021 LS=080 ZP=OFF SG=OFF KD=ON  IP=OFF
0110* MAP2: MAP PROFILES *****************************        410***********
0120* .TTAAAMMOO   D I D I N D I D I        ?_)¬&:+(                       *
0130* 023079        N0NNUCN             X        01 SYSPROF YL           1 *
0140************************************************************************
0150INPUT          (     IP=OFF                                           /*
0160                                                                       )
0170 002T ##TITLE  (AD=ODL ) /*.01U078 A078 .
0180/
0190/
0200/
0210/
0220 002T 'Translation PGM .....'
0230 024T #TRANS-PGM (001)  (AD=MILT'_' ) /*.99U008 A008 .
0240   /* A1000050000100001000010000100001010001005000001H
0250 033T #TRANS-PGM (002)  (AD=MILT'_' ) /*.99U008 A008 .
0260 042T #TRANS-PGM (003)  (AD=MILT'_' ) /*.99U008 A008 .
0270 051T #TRANS-PGM (004)  (AD=MILT'_' ) /*.99U008 A008 .
0280 060T #TRANS-PGM (005)  (AD=MILT'_' ) /*.99U008 A008 .
0290/
0300/
0310/
0320 002T 'Dsname...............'
0330 024T #DSNAME  (AD=MILT'_' ) /*.99D054 A054 .
0340/
0350 002T 'Volser ..............'
0360 024T #VOLSER  (AD=MILT'_' ) /*.99U006 A006 .
0370/
0380/
0390/
0400/
0410/
0420/
0430/
0440/
0450/
0460/
0470/
0480/
0490* MAP2: VALIDATION *****************************************************
0500* MAP2: END OF MAP *****************************************************
0510END
