0010* MAP2: PROTOTYPE
0020* INPUT USING MAP 'XXXXXXXX'
0030*     #DSNAME #PASSWORD #REPLACE CV-PASSWORD
0040DEFINE DATA PARAMETER
00501 #DSNAME (A054)
00601 #PASSWORD (A008)
00701 #REPLACE (A003)
00801  CV-PASSWORD (C)
0090END-DEFINE
0100FORMAT PS=008 LS=056 ZP=OFF SG=OFF KD=OFF IP=OFF
0110* MAP2: MAP PROFILES *****************************        410***********
0120* .TTAAAMMOO   D I D I N D I D I        ?_)¬&:+(                       *
0130* 008055        N0NNUCN             X        01 SYSPROF NL           1 *
0140************************************************************************
0150INPUT          (     IP=OFF                                           /*
0160                                                                       )
0170/
0180 002T #DSNAME  (AD=OI ) /*.01U054 A054 .
0190/
0200/
0210 012T 'overwrite (yes/no) .........'
0220 041T #REPLACE  (AD=MILT'_' CD=NE ) /*.99U003 A003 .
0230/
0240 012T 'Password'
0250 021T '.' (019)
0260 041T #PASSWORD  (AD=MYLT'_' CD=NE CV=CV-PASSWORD ) /*.99U008 A008 .
0270/
0280/
0290/
0300* MAP2: VALIDATION *****************************************************
0310* MAP2: END OF MAP *****************************************************
0320END
