0010* MAP2: PROTOTYPE
0020* INPUT USING MAP 'XXXXXXXX'
0030*     ##TITLE #ADDITIONAL-COPIES #CHARACTER-SETS #DATA(*) #DSNAME
0040*     #FACE-SIDE #FORM-NAME #HEADER-PAGE-TEXT #JOB-NAME #OBJECT
0050*     #PARAMETER-SET-1 #PASSWORD #RECLEN(*)
0060DEFINE DATA PARAMETER
00701 ##TITLE (A078)
00801 #ADDITIONAL-COPIES (A003)
00901 #CHARACTER-SETS (A008)
01001 #DATA (A060/00001:00010)
01101 #DSNAME (A054)
01201 #FACE-SIDE (A008)
01301 #FORM-NAME (A008)
01401 #HEADER-PAGE-TEXT (A032)
01501 #JOB-NAME (A008)
01601 #OBJECT (A007)
01701 #PARAMETER-SET-1 (A055)
01801 #PASSWORD (A008)
01901 #RECLEN (N03.0/00001:00010)
0200END-DEFINE
0210FORMAT PS=021 LS=080 ZP=OFF SG=OFF KD=ON  IP=OFF
0220* MAP2: MAP PROFILES *****************************        410***********
0230* .TTAAAMMOO   D I D I N D I D I        ?_)¬&:+(                       *
0240* 023079        N0NNUCN             X        01 SYSPROF YL           1 *
0250************************************************************************
0260INPUT          (     IP=OFF                                           /*
0270                                                                       )
0280 002T ##TITLE  (AD=ODL ) /*.01D078 A078 .
0290/
0300/
0310 002T 'Object ......'
0320 016T #OBJECT  (AD=MILT'_' CD=NE ) /*.99U007 A007 .
0330 024T '(FILE/RECORDS)'
0340/
0350 002T 'Dsname ......'
0360 016T #DSNAME  (AD=MILT'_' CD=NE ) /*.99D054 A054 .
0370/
0380 002T 'Password ....'
0390 016T #PASSWORD  (AD=MILT'_' CD=NE ) /*.99D008 A008 .
0400/
0410 002T 'Char-Sets ...'
0420 016T #CHARACTER-SETS  (AD=MILT'_' CD=NE ) /*.99D008 A008            .
0430 025T 'Face-Side ...'
0440 039T #FACE-SIDE  (AD=MILT'_' CD=NE ) /*.99D008 A008            .
0450 048T 'Form-Name ...'
0460 062T #FORM-NAME  (AD=MILT'_' CD=NE ) /*.99D008 A008            .
0470/
0480 002T 'Job Name ....'
0490 016T #JOB-NAME  (AD=MILT'_' CD=NE ) /*.99D008 A008 .
0500 025T 'Add. Copies .'
0510 039T #ADDITIONAL-COPIES  (AD=MILT'_' CD=NE ) /*.99D003 A003            .
0520/
0530 002T 'Header-Page-Text .....'
0540 025T #HEADER-PAGE-TEXT  (AD=MILT'_' CD=NE ) /*.99D032 A032            .
0550/
0560 002T 'Parameter-Set-1 ......'
0570 025T #PARAMETER-SET-1  (AD=MILT'_' CD=NE ) /*.99D055 A055            .
0580/
0590 006T 'Reclen   Data'
0600/
0610 006T '------'
0620 014T '----+----1----+----2----+----3----+----4----+----5----+---'-
0630      '-6'
0640/
0650 008T #RECLEN (1+000)  (AD=MILT'_' CD=NE ) /*.99U003 N03.0.
0660   /* A1000100000100001    10000100001100010001000001H
0670 014T #DATA (1+000)  (AD=MILT'_' CD=NE ) /*.99U060 A060 .
0680   /* A1000100000100001    10000100001100010001000001H
0690/
0700 008T #RECLEN (1+001)  (AD=MILT'_' CD=NE ) /*.99U003 N03.0.
0710 014T #DATA (1+001)  (AD=MILT'_' CD=NE ) /*.99U060 A060 .
0720/
0730 008T #RECLEN (1+002)  (AD=MILT'_' CD=NE ) /*.99U003 N03.0.
0740 014T #DATA (1+002)  (AD=MILT'_' CD=NE ) /*.99U060 A060 .
0750/
0760 008T #RECLEN (1+003)  (AD=MILT'_' CD=NE ) /*.99U003 N03.0.
0770 014T #DATA (1+003)  (AD=MILT'_' CD=NE ) /*.99U060 A060 .
0780/
0790 008T #RECLEN (1+004)  (AD=MILT'_' CD=NE ) /*.99U003 N03.0.
0800 014T #DATA (1+004)  (AD=MILT'_' CD=NE ) /*.99U060 A060 .
0810/
0820 008T #RECLEN (1+005)  (AD=MILT'_' CD=NE ) /*.99U003 N03.0.
0830 014T #DATA (1+005)  (AD=MILT'_' CD=NE ) /*.99U060 A060 .
0840/
0850 008T #RECLEN (1+006)  (AD=MILT'_' CD=NE ) /*.99U003 N03.0.
0860 014T #DATA (1+006)  (AD=MILT'_' CD=NE ) /*.99U060 A060 .
0870/
0880 008T #RECLEN (1+007)  (AD=MILT'_' CD=NE ) /*.99U003 N03.0.
0890 014T #DATA (1+007)  (AD=MILT'_' CD=NE ) /*.99U060 A060 .
0900/
0910 008T #RECLEN (1+008)  (AD=MILT'_' CD=NE ) /*.99U003 N03.0.
0920 014T #DATA (1+008)  (AD=MILT'_' CD=NE ) /*.99U060 A060 .
0930/
0940 008T #RECLEN (1+009)  (AD=MILT'_' CD=NE ) /*.99U003 N03.0.
0950 014T #DATA (1+009)  (AD=MILT'_' CD=NE ) /*.99U060 A060 .
0960* MAP2: VALIDATION *****************************************************
0970* MAP2: END OF MAP *****************************************************
0980END
