0010* MAP2: PROTOTYPE
0020* INPUT USING MAP 'XXXXXXXX'
0030*     ##TITLE #ADDITIONAL-COPIES #CHARACTER-SETS #DATA(*) #DSNAME
0040*     #FACE-SIDE #FORM-NAME #HEADER-PAGE-TEXT #JOB-NAME #OBJECT
0050*     #PARAMETER-SET-1 #PASSWORD #RECLEN(*)
0060DEFINE DATA PARAMETER
00701 ##TITLE (A078)
00801 #ADDITIONAL-COPIES (A003)
00901 #CHARACTER-SETS (A008)
01001 #DATA (A060/00001:00010)
01101 #DSNAME (A054)
01201 #FACE-SIDE (A008)
01301 #FORM-NAME (A008)
01401 #HEADER-PAGE-TEXT (A032)
01501 #JOB-NAME (A008)
01601 #OBJECT (A007)
01701 #PARAMETER-SET-1 (A055)
01801 #PASSWORD (A008)
01901 #RECLEN (N03.0/00001:00010)
0200END-DEFINE
0210FORMAT PS=021 LS=080 ZP=OFF SG=OFF KD=ON  IP=OFF
0220* MAP2: MAP PROFILES *****************************        410***********
0230* .TTAAAMMOO   D I D I N D I D I        ?_)¬&:+(                       *
0240* 023079        N0NNUCN             X        01 SYSPROF YL           1 *
0250************************************************************************
0260INPUT          (     IP=OFF                                           /*
0270                                                                       )
0280 002T ##TITLE  (AD=ODL ) /*.01D078 A078 .
0290/
0300/
0310 002T 'Objekt ......'
0320 016T #OBJECT  (AD=MILT'_' CD=NE ) /*.99U007 A007 .
0330 024T '(FILE/RECORDS)'
0340/
0350 002T 'Datei'
0360 009T '......'
0370 016T #DSNAME  (AD=MILT'_' CD=NE ) /*.99D054 A054 .
0380/
0390 002T 'Passwort ....'
0400 016T #PASSWORD  (AD=MILT'_' CD=NE ) /*.99D008 A008 .
0410/
0420 002T 'Char-Sets ...'
0430 016T #CHARACTER-SETS  (AD=MILT'_' CD=NE ) /*.99D008 A008            .
0440 025T 'Face-Side ...'
0450 039T #FACE-SIDE  (AD=MILT'_' CD=NE ) /*.99D008 A008            .
0460 048T 'Form-Name ...'
0470 062T #FORM-NAME  (AD=MILT'_' CD=NE ) /*.99D008 A008            .
0480/
0490 002T 'Jobname'
0500 011T '....'
0510 016T #JOB-NAME  (AD=MILT'_' CD=NE ) /*.99D008 A008 .
0520 025T 'Zus. Kopien .'
0530 039T #ADDITIONAL-COPIES  (AD=MILT'_' CD=NE ) /*.99D003 A003            .
0540/
0550 002T 'Header-Page-Text .....'
0560 025T #HEADER-PAGE-TEXT  (AD=MILT'_' CD=NE ) /*.99D032 A032            .
0570/
0580 002T 'Parameter-Set-1 ......'
0590 025T #PARAMETER-SET-1  (AD=MILT'_' CD=NE ) /*.99D055 A055            .
0600/
0610 006T 'Laenge'
0620 015T 'Daten'
0630/
0640 006T '------'
0650 014T '----+----1----+----2----+----3----+----4----+----5----+---'-
0660      '-6'
0670/
0680 008T #RECLEN (1+000)  (AD=MILT'_' CD=NE ) /*.99U003 N03.0.
0690   /* A1000100000100001    10000100001100010001000001H
0700 014T #DATA (1+000)  (AD=MILT'_' CD=NE ) /*.99U060 A060 .
0710   /* A1000100000100001    10000100001100010001000001H
0720/
0730 008T #RECLEN (1+001)  (AD=MILT'_' CD=NE ) /*.99U003 N03.0.
0740 014T #DATA (1+001)  (AD=MILT'_' CD=NE ) /*.99U060 A060 .
0750/
0760 008T #RECLEN (1+002)  (AD=MILT'_' CD=NE ) /*.99U003 N03.0.
0770 014T #DATA (1+002)  (AD=MILT'_' CD=NE ) /*.99U060 A060 .
0780/
0790 008T #RECLEN (1+003)  (AD=MILT'_' CD=NE ) /*.99U003 N03.0.
0800 014T #DATA (1+003)  (AD=MILT'_' CD=NE ) /*.99U060 A060 .
0810/
0820 008T #RECLEN (1+004)  (AD=MILT'_' CD=NE ) /*.99U003 N03.0.
0830 014T #DATA (1+004)  (AD=MILT'_' CD=NE ) /*.99U060 A060 .
0840/
0850 008T #RECLEN (1+005)  (AD=MILT'_' CD=NE ) /*.99U003 N03.0.
0860 014T #DATA (1+005)  (AD=MILT'_' CD=NE ) /*.99U060 A060 .
0870/
0880 008T #RECLEN (1+006)  (AD=MILT'_' CD=NE ) /*.99U003 N03.0.
0890 014T #DATA (1+006)  (AD=MILT'_' CD=NE ) /*.99U060 A060 .
0900/
0910 008T #RECLEN (1+007)  (AD=MILT'_' CD=NE ) /*.99U003 N03.0.
0920 014T #DATA (1+007)  (AD=MILT'_' CD=NE ) /*.99U060 A060 .
0930/
0940 008T #RECLEN (1+008)  (AD=MILT'_' CD=NE ) /*.99U003 N03.0.
0950 014T #DATA (1+008)  (AD=MILT'_' CD=NE ) /*.99U060 A060 .
0960/
0970 008T #RECLEN (1+009)  (AD=MILT'_' CD=NE ) /*.99U003 N03.0.
0980 014T #DATA (1+009)  (AD=MILT'_' CD=NE ) /*.99U060 A060 .
0990* MAP2: VALIDATION *****************************************************
1000* MAP2: END OF MAP *****************************************************
1010END
