0010* MAP2: PROTOTYPE
0020* INPUT USING MAP 'XXXXXXXX'
0030*     ##TITLE #CVAR #DSNAME #ELEMENT #ELEMENT-PASSWORD #ELEMENT-TYPE
0040*     #ELEMENT-VERSION #PASSWORD #SCAN #SCAN-COLUMN-FROM
0050*     #SCAN-COLUMN-TO #SCAN-LENGTH #SCAN-LIMIT #SCAN-TYPE #SCAN-VALUE
0060*     #TIME-LIMIT #VOLSER
0070DEFINE DATA PARAMETER
00801 ##TITLE (A078)
00901  #CVAR (C)
01001 #DSNAME (A054)
01101 #ELEMENT (A064)
01201 #ELEMENT-PASSWORD (A008)
01301 #ELEMENT-TYPE (A008)
01401 #ELEMENT-VERSION (A024)
01501 #PASSWORD (A008)
01601 #SCAN (A003)
01701 #SCAN-COLUMN-FROM (N05.0)
01801 #SCAN-COLUMN-TO (N05.0)
01901 #SCAN-LENGTH (N03.0)
02001 #SCAN-LIMIT (N07.0)
02101 #SCAN-TYPE (A001)
02201 #SCAN-VALUE (A060)
02301 #TIME-LIMIT (N05.0)
02401 #VOLSER (A006)
0250END-DEFINE
0260FORMAT PS=021 LS=080 ZP=OFF SG=OFF KD=ON  IP=OFF
0270* MAP2: MAP PROFILES *****************************        410***********
0280* .TTAAAMMOO   D I D I N D I D I        ?_)¬&:+(                       *
0290* 023079        N0NNUCN             X        01 SYSPROF YL   #CVAR   1 *
0300************************************************************************
0310INPUT          (     CV=#CVAR                                         /*
0320                                                                       )
0330 002T ##TITLE  (AD=ODL ) /*.01D078 A078 .
0340/
0350/
0360 002T 'Datei .........'
0370 018T #DSNAME  (AD=MILT'_' CD=NE ) /*.99D054 A054 .
0380/
0390 002T 'Archivnummer ..'
0400 018T #VOLSER  (AD=MILT'_' CD=NE ) /*.99D006 A006 .
0410/
0420 002T 'Passwort ......'
0430 018T #PASSWORD  (AD=MNLT'_' CD=NE ) /*.99U008 A008 .
0440/
0450/
0460 002T 'Member ........'
0470 018T #ELEMENT  (AD=MILT'_' CD=NE AL=060  ) /*.99U060 A064 .
0480/
0490 002T 'Type ..........'
0500 018T #ELEMENT-TYPE  (AD=MILT'_' CD=NE ) /*.99U008 A008 .
0510/
0520 002T 'Version .......'
0530 018T #ELEMENT-VERSION  (AD=MILT'_' CD=NE ) /*.99U024 A024 .
0540/
0550 002T 'Passwort ......'
0560 018T #ELEMENT-PASSWORD  (AD=MNLT CD=NE ) /*.99U008 A008 .
0570/
0580/
0590 002T 'Zeichenkettensuche'
0600/
0610 004T 'Option ......'
0620 018T #SCAN  (AD=MILT'_' CD=NE ) /*.99D003 A003 .
0630 024T '( YES: Suche nach dem ersten Treffer fortsetzen )'
0640/
0650 004T 'Zeichenkette'
0660 018T #SCAN-VALUE  (AD=MILT'_' CD=NE ) /*.99D060 A060 .
0670/
0680 004T 'Zeilenlimit .'
0690 018T #SCAN-LIMIT  (AD=MILT'_' CD=NE ) /*.99D007 N07.0.
0700/
0710 004T 'Zeitlimit ...'
0720 018T #TIME-LIMIT  (AD=MILT'_' CD=NE ) /*.99D005 N05.0.
0730/
0740 004T 'Typ .........'
0750 018T #SCAN-TYPE  (AD=MILT'_' CD=NE ) /*.99D001 A001 .
0760 024T '( A: absolute Suche )'
0770/
0780 004T 'Laenge ......'
0790 018T #SCAN-LENGTH  (AD=MILT'_' CD=NE ) /*.99D003 N03.0.
0800/
0810 004T 'Spalte von ..'
0820 018T #SCAN-COLUMN-FROM  (AD=MILT'_' CD=NE ) /*.99D005 N05.0.
0830/
0840 004T 'Spalte bis ..'
0850 018T #SCAN-COLUMN-TO  (AD=MILT'_' CD=NE ) /*.99D005 N05.0.
0860/
0870* MAP2: VALIDATION *****************************************************
0880* MAP2: END OF MAP *****************************************************
0890END
