0010*
0020* Read / Scan Contents of a LMS member
0030*
0040DEFINE DATA GLOBAL USING TUTO
0050            LOCAL  USING BREADF-L
0060            LOCAL
0070*
008001  #DSNAME                     (A54)
009001  #VOLSER                     (A6)
010001  #SCAN-VALUE                 (A60)
011001  #PASSWORD                   (A8)
012001  #ELEMENT                    (A64)
013001  #ELEMENT-TYPE               (A8)
014001  #ELEMENT-VERSION            (A24)
015001  #ELEMENT-PASSWORD           (A8)
016001  #SCAN                       (A3)
017001  #SCAN-LIMIT                 (N7.0)
018001  #SCAN-TYPE                  (A1)
019001  #SCAN-LENGTH                (N3.0)
020001  #SCAN-COLUMN-FROM           (N5.0)
021001  #SCAN-COLUMN-TO             (N5.0)
022001  #TIME-LIMIT       (N5.0)
0230*
024001  #CVAR             (C)
0250END-DEFINE
0260FORMAT KD=ON PS=20
0270ASSIGN #CVAR = (AD=I)
0280PERFORM PF-KEY
0290*
0300* ------------------------------ MAIN LOOP ----------------------------
0310*
0320REPEAT
0330SET KEY PF4 = PGM NAMED OFF
0340PERFORM SCREEN-IO
0350SET KEY PF4 = PGM NAMED 'Stop'
0360FND.
0370FIND READ-FILE
0380     WITH NODE             =  ##NODE
0390      AND PRODUCT          =  'L'
0400      AND DSNAME           =  #DSNAME
0410      AND VOLSER           =  #VOLSER
0420      AND PASSWORD         =  #PASSWORD
0430      AND ELEMENT          =  #ELEMENT
0440      AND ELEMENT-TYPE     =  #ELEMENT-TYPE
0450      AND ELEMENT-VERSION  =  #ELEMENT-VERSION
0460      AND ELEMENT-PASSWORD =  #ELEMENT-PASSWORD
0470      AND RECORD           =  #SCAN-VALUE
0480      AND SCAN             =  #SCAN
0490      AND SCAN-LIMIT       =  #SCAN-LIMIT
0500      AND SCAN-TYPE        =  #SCAN-TYPE
0510      AND SCAN-LENGTH      =  #SCAN-LENGTH
0520      AND SCAN-COLUMN-FROM =  #SCAN-COLUMN-FROM
0530      AND SCAN-COLUMN-TO   =  #SCAN-COLUMN-TO
0540      AND TIME-LIMIT       =  #TIME-LIMIT
0550*
0560  IF ERROR-CODE NE 0 OR SYSTEM-CODE NE 0
0570     INCLUDE BERR---C
0580     ESCAPE BOTTOM (FND.)
0590  END-IF
0600*
0610  IF END-OF-FILE = 'YES'
0620     ESCAPE BOTTOM (FND.)
0630  END-IF
0640*
0650  DISPLAY 'record/number'  RECORD-NUMBER
0660          'record/length'  RECORD-LENGTH
0670          'record'         RECORD (AL=60)
0680*
0690  AT END OF PAGE
0700    INPUT ' '
0710    IF *PF-KEY = 'PF4'
0720       ESCAPE BOTTOM (FND.)
0730    END-IF
0740  END-ENDPAGE
0750*
0760END-FIND
0770END-REPEAT
0780*
0790* ------------------------------ SCREEN-IO ----------------------------
0800*
0810DEFINE SUBROUTINE SCREEN-IO
0820INPUT WITH TEXT *##MSG-NR,
0830                 ##MSG-TXT1,
0840                 ##MSG-TXT2
0850      USING MAP 'BREADL-&'
0860RESET ##MSG
0870DECIDE FOR EVERY CONDITION
0880  WHEN #SCAN-VALUE = ' '
0890       ASSIGN #SCAN-VALUE = '*'
0900  WHEN NONE
0910       IGNORE
0920END-DECIDE
0930END-SUBROUTINE
0940*
0950* ------------------------------ PF-KEY -------------------------------
0960*
0970INCLUDE C-PFKEY
0980*
0990WRITE TITLE ##TITLE
1000      SKIP 1
1010END
