0010*
0020* Read / Scan sequential File
0030*
0040DEFINE DATA GLOBAL USING TUTO
0050            LOCAL  USING BREADF-L
0060            LOCAL
0070*
008001  #DSNAME           (A54)
009001  #VOLSER           (A6)
010001  #SCAN-VALUE       (A60)
011001  #PASSWORD         (A8)
012001  #SCAN             (A3)
013001  #SCAN-LIMIT       (N7.0)
014001  #SCAN-TYPE        (A1)
015001  #SCAN-LENGTH      (N3.0)
016001  #SCAN-COLUMN-FROM (N5.0)
017001  #SCAN-COLUMN-TO   (N5.0)
018001  #TIME-LIMIT       (N5.0)
0190*
020001  #CVAR             (C)
0210END-DEFINE
0220FORMAT KD=ON PS=20
0230ASSIGN #CVAR = (AD=I)
0240PERFORM PF-KEY
0250*
0260* ------------------------------ MAIN LOOP ----------------------------
0270*
0280REPEAT
0290SET KEY PF4 = PGM NAMED OFF
0300PERFORM SCREEN-IO
0310SET KEY PF4 = PGM NAMED 'Stop'
0320FND.
0330FIND READ-FILE
0340     WITH NODE             =  ##NODE
0350      AND DSNAME           =  #DSNAME
0360      AND VOLSER           =  #VOLSER
0370      AND RECORD           =  #SCAN-VALUE
0380      AND PASSWORD         =  #PASSWORD
0390      AND SCAN             =  #SCAN
0400      AND SCAN-LIMIT       =  #SCAN-LIMIT
0410      AND SCAN-TYPE        =  #SCAN-TYPE
0420      AND SCAN-LENGTH      =  #SCAN-LENGTH
0430      AND SCAN-COLUMN-FROM =  #SCAN-COLUMN-FROM
0440      AND SCAN-COLUMN-TO   =  #SCAN-COLUMN-TO
0450      AND TIME-LIMIT       =  #TIME-LIMIT
0460*
0470  IF ERROR-CODE NE 0 OR SYSTEM-CODE NE 0
0480     INCLUDE BERR---C
0490     ESCAPE BOTTOM (FND.)
0500  END-IF
0510*
0520  IF END-OF-FILE = 'YES'
0530     ESCAPE BOTTOM (FND.)
0540  END-IF
0550*
0560  DISPLAY 'record/number'  RECORD-NUMBER
0570          'record/length'  RECORD-LENGTH
0580          'record'         RECORD (AL=60)
0590*
0600  AT END OF PAGE
0610    INPUT ' '
0620    IF *PF-KEY = 'PF4'
0630       ESCAPE BOTTOM (FND.)
0640    END-IF
0650  END-ENDPAGE
0660*
0670END-FIND
0680END-REPEAT
0690*
0700* ------------------------------ SCREEN-IO ----------------------------
0710*
0720DEFINE SUBROUTINE SCREEN-IO
0730INPUT WITH TEXT *##MSG-NR,
0740                 ##MSG-TXT1,
0750                 ##MSG-TXT2
0760      USING MAP 'BREADS-&'
0770RESET ##MSG
0780DECIDE FOR EVERY CONDITION
0790  WHEN #SCAN-VALUE = ' '
0800       ASSIGN #SCAN-VALUE = '*'
0810  WHEN NONE
0820       IGNORE
0830END-DECIDE
0840END-SUBROUTINE
0850*
0860* ------------------------------ PF-KEY -------------------------------
0870*
0880INCLUDE C-PFKEY
0890*
0900WRITE TITLE ##TITLE
0910      SKIP 1
0920END
