0010* MAP2: PROTOTYPE
0020* INPUT USING MAP 'XXXXXXXX'
0030*     #REC(*) #SIG(*) SEND-EMAIL.CC-RECIPIENT(*) SEND-EMAIL.DSNAME
0040*     SEND-EMAIL.RECIPIENT(*) SEND-EMAIL.REPLY-TO SEND-EMAIL.SUBJECT
0050DEFINE DATA PARAMETER
00601 #REC (A073/00001:00006)
00701 #SIG (A064/00001:00003)
00801 SEND-EMAIL.CC-RECIPIENT (A128/00001:00020)
00901 SEND-EMAIL.DSNAME (A054)
01001 SEND-EMAIL.RECIPIENT (A128/00001:00020)
01101 SEND-EMAIL.REPLY-TO (A128)
01201 SEND-EMAIL.SUBJECT (A128)
0130END-DEFINE
0140FORMAT PS=023 LS=080 ZP=OFF SG=OFF KD=OFF IP=OFF
0150* MAP2: MAP PROFILES *****************************        410***********
0160* .TTAAAMMOO   D I D I N D I D I        ?_@¬&;+#                       *
0170* 023079        N0NNUCN             X        01 SYSPROF NL             *
0180************************************************************************
0190INPUT          (     IP=OFF                                           /*
0200                                                                       )
0210 029T 'Send e-mail via Internet'(I)
0220/
0230 029T '(lower case acceptable)'
0240/
0250/
0260 002T 'To:'(I)
0270 007T '(1)'(I)
0280 011T SEND-EMAIL.RECIPIENT (001)  (AD=MIL'_' AL=064  ) /*.99U064 A128 .
0290   /**A1000200000100001000010000100001100002001001000001000HV
0300/
0310 007T '(2)'
0320 011T SEND-EMAIL.RECIPIENT (002)  (AD=MIL'_' AL=064  ) /*.99U064 A128 .
0330/
0340 002T 'Cc:'(I)
0350 007T '(1)'(I)
0360 011T SEND-EMAIL.CC-RECIPIENT (001)  (AD=MIL'_' AL=064  ) /*.99U064 A128 .
0370   /**A1000200000100001000010000100001100002001001000001000HV
0380/
0390 007T '(2)'
0400 011T SEND-EMAIL.CC-RECIPIENT (002)  (AD=MIL'_' AL=064  ) /*.99U064 A128 .
0410/
0420 002T 'Reply-to'(I)
0430 011T SEND-EMAIL.REPLY-TO  (AD=MIL'_' AL=064  ) /*.99U064 A128 .
0440/
0450 002T 'Subject:'(I)
0460 011T SEND-EMAIL.SUBJECT  (AD=MIL'_' AL=064  ) /*.99U064 A128 .
0470/
0480 002T 'Dataset:'(I)
0490 011T SEND-EMAIL.DSNAME  (AD=MILT'_' AL=049  ) /*.99V049 A054            .
0500 061T 'to be attached'(I)
0510/
0520/
0530 002T 'Message text:'(I)
0540/
0550 002T #REC (1+000)  (AD=MIL'_' ) /*.99D073 A073 .
0560   /**A1000060000100001000010000100001100006001001000001000HV
0570/
0580 002T #REC (1+001)  (AD=MIL'_' ) /*.99D073 A073 .
0590/
0600 002T #REC (1+002)  (AD=MIL'_' ) /*.99D073 A073 .
0610/
0620 002T #REC (1+003)  (AD=MIL'_' ) /*.99D073 A073 .
0630/
0640 002T #REC (1+004)  (AD=MIL'_' ) /*.99D073 A073 .
0650/
0660 002T #REC (1+005)  (AD=MIL'_' ) /*.99D073 A073 .
0670/
0680 002T '(.sig)'(I)
0690 011T #SIG (1+000)  (AD=MIL'_' ) /*.99D064 A064 .
0700   /**A1000030000100001000010000100001100003001001000001000HV
0710/
0720 011T #SIG (1+001)  (AD=MIL'_' ) /*.99D064 A064 .
0730/
0740 011T #SIG (1+002)  (AD=MIL'_' ) /*.99D064 A064 .
0750/
0760/
0770* MAP2: VALIDATION *****************************************************
0780RULEVAR D01SEND-EMAIL.DSNAME
0790INCDIR SEND-EMAIL                       DSNAME                          ;
0800* MAP2: END OF MAP *****************************************************
0810END
