0010* MAP2: PROTOTYPE
0020* INPUT USING MAP 'XXXXXXXX'
0030*     ##TITLE #CVAR #DISPLAY.COPIES(*) #DISPLAY.CPU-USED(*)
0040*     #DISPLAY.JOB-ID(*) #DISPLAY.JOB-NAME(*)
0050*     #DISPLAY.ORIGINATOR-JOB-ID(*) #DISPLAY.PRIORITY(*)
0060*     #DISPLAY.SIZE(*) #DISPLAY.STATUS(*) #DISPLAY.TYPE-NUMBER(*)
0070*     #DISPLAY.USER(*) #JOB-NAME #STATUS #USER-ID
0080DEFINE DATA PARAMETER
00901 ##TITLE (A078)
01001  #CVAR (C)
01101 #DISPLAY.COPIES (N03.0/    1:00015)
01201 #DISPLAY.CPU-USED (N07.2/    1:00015)
01301 #DISPLAY.JOB-ID (A005/00001:00015)
01401 #DISPLAY.JOB-NAME (A008/    1:00015)
01501 #DISPLAY.ORIGINATOR-JOB-ID (A005/00001:00015)
01601 #DISPLAY.PRIORITY (N03.0/    1:00015)
01701 #DISPLAY.SIZE (A006/    1:00015)
01801 #DISPLAY.STATUS (A009/    1:00015)
01901 #DISPLAY.TYPE-NUMBER (N01.0/00001:00015)
02001 #DISPLAY.USER (A008/00001:00015)
02101 #JOB-NAME (A008)
02201 #STATUS (A009)
02301 #USER-ID (A008)
0240END-DEFINE
0250FORMAT PS=021 LS=080 ZP=OFF SG=OFF KD=ON  IP=OFF
0260* MAP2: MAP PROFILES *****************************        410***********
0270* .TTAAAMMOO   D I D I N D I D I        ?_)¬&:+(                       *
0280* 023079        N0NNUCN             X        01 SYSPROF YL   #CVAR   1 *
0290************************************************************************
0300INPUT          (     CV=#CVAR                                         /*
0310                                                                       )
0320 002T ##TITLE  (AD=ODL ) /*.01D078 A078 .
0330/
0340/
0350 002T 'Job-Name UserID'
0360 020T 'TSN'
0370 026T 'Pri Status'
0380 040T 'T CPU-used'
0390 053T 'Orig. Size'
0400 066T 'Copies'
0410/
0420 002T #JOB-NAME  (AD=MYLT'_' CD=NE CV=#CVAR ) /*.99D008 A008 .
0430 011T #USER-ID  (AD=MYLT'_' CD=NE CV=#CVAR ) /*.99U008 A008 .
0440 020T '_____ ___'
0450 030T #STATUS  (AD=MYLT'_' CD=NE CV=#CVAR ) /*.99U009 A009 .
0460 040T '_ __________ _____ ______ ______'
0470/
0480 002T #DISPLAY.JOB-NAME (1+000)  (AD=ODL ) /*.01D008 A008 .
0490   /* A1000150000100001    10000100001100015001000001H
0500 011T #DISPLAY.USER (1+000)  (AD=ODL ) /*.01U008 A008 .
0510   /* A1000150000100001000010000100001100015001000001H
0520 020T #DISPLAY.JOB-ID (1+000)  (AD=ODR ) /*.01U005 A005 .
0530   /* A1000150000100001    10000100001100015001000001H
0540 026T #DISPLAY.PRIORITY (1+000)  (AD=ODR ) /*.01D003 N03.0.
0550   /* A1000150000100001    10000100001100015001000001H
0560 030T #DISPLAY.STATUS (1+000)  (AD=ODL ) /*.01D009 A009 .
0570   /* A1000150000100001    10000100001100015001000001H
0580 040T #DISPLAY.TYPE-NUMBER (1+000)  (AD=ODL ) /*.01U001 N01.0.
0590   /* A1000150000100001    10000100001100015001000001H
0600 042T #DISPLAY.CPU-USED (1+000)  (AD=ODR ) /*.01D010 N07.2.
0610   /* A1000150000100001    10000100001100015001000001H
0620 053T #DISPLAY.ORIGINATOR-JOB-ID (1+000)  (AD=ODR ) /*.01U005 A005 .
0630   /* A1000150000100001    10000100001100015001000001H
0640 059T #DISPLAY.SIZE (1+000)  (AD=ODL ) /*.01D006 A006 .
0650   /* A1000150000100001    10000100001100015001000001H
0660 069T #DISPLAY.COPIES (1+000)  (AD=ODR ) /*.01D003 N03.0.
0670   /* A1000150000100001    10000100001100015001000001H
0680/
0690 002T #DISPLAY.JOB-NAME (1+001)  (AD=ODL ) /*.01D008 A008 .
0700 011T #DISPLAY.USER (1+001)  (AD=ODL ) /*.01U008 A008 .
0710 020T #DISPLAY.JOB-ID (1+001)  (AD=ODR ) /*.01U005 A005 .
0720 026T #DISPLAY.PRIORITY (1+001)  (AD=ODR ) /*.01D003 N03.0.
0730 030T #DISPLAY.STATUS (1+001)  (AD=ODL ) /*.01D009 A009 .
0740 040T #DISPLAY.TYPE-NUMBER (1+001)  (AD=ODL ) /*.01U001 N01.0.
0750 042T #DISPLAY.CPU-USED (1+001)  (AD=ODR ) /*.01D010 N07.2.
0760 053T #DISPLAY.ORIGINATOR-JOB-ID (1+001)  (AD=ODR ) /*.01U005 A005 .
0770 059T #DISPLAY.SIZE (1+001)  (AD=ODL ) /*.01D006 A006 .
0780 069T #DISPLAY.COPIES (1+001)  (AD=ODR ) /*.01D003 N03.0.
0790/
0800 002T #DISPLAY.JOB-NAME (1+002)  (AD=ODL ) /*.01D008 A008 .
0810 011T #DISPLAY.USER (1+002)  (AD=ODL ) /*.01U008 A008 .
0820 020T #DISPLAY.JOB-ID (1+002)  (AD=ODR ) /*.01U005 A005 .
0830 026T #DISPLAY.PRIORITY (1+002)  (AD=ODR ) /*.01D003 N03.0.
0840 030T #DISPLAY.STATUS (1+002)  (AD=ODL ) /*.01D009 A009 .
0850 040T #DISPLAY.TYPE-NUMBER (1+002)  (AD=ODL ) /*.01U001 N01.0.
0860 042T #DISPLAY.CPU-USED (1+002)  (AD=ODR ) /*.01D010 N07.2.
0870 053T #DISPLAY.ORIGINATOR-JOB-ID (1+002)  (AD=ODR ) /*.01U005 A005 .
0880 059T #DISPLAY.SIZE (1+002)  (AD=ODL ) /*.01D006 A006 .
0890 069T #DISPLAY.COPIES (1+002)  (AD=ODR ) /*.01D003 N03.0.
0900/
0910 002T #DISPLAY.JOB-NAME (1+003)  (AD=ODL ) /*.01D008 A008 .
0920 011T #DISPLAY.USER (1+003)  (AD=ODL ) /*.01U008 A008 .
0930 020T #DISPLAY.JOB-ID (1+003)  (AD=ODR ) /*.01U005 A005 .
0940 026T #DISPLAY.PRIORITY (1+003)  (AD=ODR ) /*.01D003 N03.0.
0950 030T #DISPLAY.STATUS (1+003)  (AD=ODL ) /*.01D009 A009 .
0960 040T #DISPLAY.TYPE-NUMBER (1+003)  (AD=ODL ) /*.01U001 N01.0.
0970 042T #DISPLAY.CPU-USED (1+003)  (AD=ODR ) /*.01D010 N07.2.
0980 053T #DISPLAY.ORIGINATOR-JOB-ID (1+003)  (AD=ODR ) /*.01U005 A005 .
0990 059T #DISPLAY.SIZE (1+003)  (AD=ODL ) /*.01D006 A006 .
1000 069T #DISPLAY.COPIES (1+003)  (AD=ODR ) /*.01D003 N03.0.
1010/
1020 002T #DISPLAY.JOB-NAME (1+004)  (AD=ODL ) /*.01D008 A008 .
1030 011T #DISPLAY.USER (1+004)  (AD=ODL ) /*.01U008 A008 .
1040 020T #DISPLAY.JOB-ID (1+004)  (AD=ODR ) /*.01U005 A005 .
1050 026T #DISPLAY.PRIORITY (1+004)  (AD=ODR ) /*.01D003 N03.0.
1060 030T #DISPLAY.STATUS (1+004)  (AD=ODL ) /*.01D009 A009 .
1070 040T #DISPLAY.TYPE-NUMBER (1+004)  (AD=ODL ) /*.01U001 N01.0.
1080 042T #DISPLAY.CPU-USED (1+004)  (AD=ODR ) /*.01D010 N07.2.
1090 053T #DISPLAY.ORIGINATOR-JOB-ID (1+004)  (AD=ODR ) /*.01U005 A005 .
1100 059T #DISPLAY.SIZE (1+004)  (AD=ODL ) /*.01D006 A006 .
1110 069T #DISPLAY.COPIES (1+004)  (AD=ODR ) /*.01D003 N03.0.
1120/
1130 002T #DISPLAY.JOB-NAME (1+005)  (AD=ODL ) /*.01D008 A008 .
1140 011T #DISPLAY.USER (1+005)  (AD=ODL ) /*.01U008 A008 .
1150 020T #DISPLAY.JOB-ID (1+005)  (AD=ODR ) /*.01U005 A005 .
1160 026T #DISPLAY.PRIORITY (1+005)  (AD=ODR ) /*.01D003 N03.0.
1170 030T #DISPLAY.STATUS (1+005)  (AD=ODL ) /*.01D009 A009 .
1180 040T #DISPLAY.TYPE-NUMBER (1+005)  (AD=ODL ) /*.01U001 N01.0.
1190 042T #DISPLAY.CPU-USED (1+005)  (AD=ODR ) /*.01D010 N07.2.
1200 053T #DISPLAY.ORIGINATOR-JOB-ID (1+005)  (AD=ODR ) /*.01U005 A005 .
1210 059T #DISPLAY.SIZE (1+005)  (AD=ODL ) /*.01D006 A006 .
1220 069T #DISPLAY.COPIES (1+005)  (AD=ODR ) /*.01D003 N03.0.
1230/
1240 002T #DISPLAY.JOB-NAME (1+006)  (AD=ODL ) /*.01D008 A008 .
1250 011T #DISPLAY.USER (1+006)  (AD=ODL ) /*.01U008 A008 .
1260 020T #DISPLAY.JOB-ID (1+006)  (AD=ODR ) /*.01U005 A005 .
1270 026T #DISPLAY.PRIORITY (1+006)  (AD=ODR ) /*.01D003 N03.0.
1280 030T #DISPLAY.STATUS (1+006)  (AD=ODL ) /*.01D009 A009 .
1290 040T #DISPLAY.TYPE-NUMBER (1+006)  (AD=ODL ) /*.01U001 N01.0.
1300 042T #DISPLAY.CPU-USED (1+006)  (AD=ODR ) /*.01D010 N07.2.
1310 053T #DISPLAY.ORIGINATOR-JOB-ID (1+006)  (AD=ODR ) /*.01U005 A005 .
1320 059T #DISPLAY.SIZE (1+006)  (AD=ODL ) /*.01D006 A006 .
1330 069T #DISPLAY.COPIES (1+006)  (AD=ODR ) /*.01D003 N03.0.
1340/
1350 002T #DISPLAY.JOB-NAME (1+007)  (AD=ODL ) /*.01D008 A008 .
1360 011T #DISPLAY.USER (1+007)  (AD=ODL ) /*.01U008 A008 .
1370 020T #DISPLAY.JOB-ID (1+007)  (AD=ODR ) /*.01U005 A005 .
1380 026T #DISPLAY.PRIORITY (1+007)  (AD=ODR ) /*.01D003 N03.0.
1390 030T #DISPLAY.STATUS (1+007)  (AD=ODL ) /*.01D009 A009 .
1400 040T #DISPLAY.TYPE-NUMBER (1+007)  (AD=ODL ) /*.01U001 N01.0.
1410 042T #DISPLAY.CPU-USED (1+007)  (AD=ODR ) /*.01D010 N07.2.
1420 053T #DISPLAY.ORIGINATOR-JOB-ID (1+007)  (AD=ODR ) /*.01U005 A005 .
1430 059T #DISPLAY.SIZE (1+007)  (AD=ODL ) /*.01D006 A006 .
1440 069T #DISPLAY.COPIES (1+007)  (AD=ODR ) /*.01D003 N03.0.
1450/
1460 002T #DISPLAY.JOB-NAME (1+008)  (AD=ODL ) /*.01D008 A008 .
1470 011T #DISPLAY.USER (1+008)  (AD=ODL ) /*.01U008 A008 .
1480 020T #DISPLAY.JOB-ID (1+008)  (AD=ODR ) /*.01U005 A005 .
1490 026T #DISPLAY.PRIORITY (1+008)  (AD=ODR ) /*.01D003 N03.0.
1500 030T #DISPLAY.STATUS (1+008)  (AD=ODL ) /*.01D009 A009 .
1510 040T #DISPLAY.TYPE-NUMBER (1+008)  (AD=ODL ) /*.01U001 N01.0.
1520 042T #DISPLAY.CPU-USED (1+008)  (AD=ODR ) /*.01D010 N07.2.
1530 053T #DISPLAY.ORIGINATOR-JOB-ID (1+008)  (AD=ODR ) /*.01U005 A005 .
1540 059T #DISPLAY.SIZE (1+008)  (AD=ODL ) /*.01D006 A006 .
1550 069T #DISPLAY.COPIES (1+008)  (AD=ODR ) /*.01D003 N03.0.
1560/
1570 002T #DISPLAY.JOB-NAME (1+009)  (AD=ODL ) /*.01D008 A008 .
1580 011T #DISPLAY.USER (1+009)  (AD=ODL ) /*.01U008 A008 .
1590 020T #DISPLAY.JOB-ID (1+009)  (AD=ODR ) /*.01U005 A005 .
1600 026T #DISPLAY.PRIORITY (1+009)  (AD=ODR ) /*.01D003 N03.0.
1610 030T #DISPLAY.STATUS (1+009)  (AD=ODL ) /*.01D009 A009 .
1620 040T #DISPLAY.TYPE-NUMBER (1+009)  (AD=ODL ) /*.01U001 N01.0.
1630 042T #DISPLAY.CPU-USED (1+009)  (AD=ODR ) /*.01D010 N07.2.
1640 053T #DISPLAY.ORIGINATOR-JOB-ID (1+009)  (AD=ODR ) /*.01U005 A005 .
1650 059T #DISPLAY.SIZE (1+009)  (AD=ODL ) /*.01D006 A006 .
1660 069T #DISPLAY.COPIES (1+009)  (AD=ODR ) /*.01D003 N03.0.
1670/
1680 002T #DISPLAY.JOB-NAME (1+010)  (AD=ODL ) /*.01D008 A008 .
1690 011T #DISPLAY.USER (1+010)  (AD=ODL ) /*.01U008 A008 .
1700 020T #DISPLAY.JOB-ID (1+010)  (AD=ODR ) /*.01U005 A005 .
1710 026T #DISPLAY.PRIORITY (1+010)  (AD=ODR ) /*.01D003 N03.0.
1720 030T #DISPLAY.STATUS (1+010)  (AD=ODL ) /*.01D009 A009 .
1730 040T #DISPLAY.TYPE-NUMBER (1+010)  (AD=ODL ) /*.01U001 N01.0.
1740 042T #DISPLAY.CPU-USED (1+010)  (AD=ODR ) /*.01D010 N07.2.
1750 053T #DISPLAY.ORIGINATOR-JOB-ID (1+010)  (AD=ODR ) /*.01U005 A005 .
1760 059T #DISPLAY.SIZE (1+010)  (AD=ODL ) /*.01D006 A006 .
1770 069T #DISPLAY.COPIES (1+010)  (AD=ODR ) /*.01D003 N03.0.
1780/
1790 002T #DISPLAY.JOB-NAME (1+011)  (AD=ODL ) /*.01D008 A008 .
1800 011T #DISPLAY.USER (1+011)  (AD=ODL ) /*.01U008 A008 .
1810 020T #DISPLAY.JOB-ID (1+011)  (AD=ODR ) /*.01U005 A005 .
1820 026T #DISPLAY.PRIORITY (1+011)  (AD=ODR ) /*.01D003 N03.0.
1830 030T #DISPLAY.STATUS (1+011)  (AD=ODL ) /*.01D009 A009 .
1840 040T #DISPLAY.TYPE-NUMBER (1+011)  (AD=ODL ) /*.01U001 N01.0.
1850 042T #DISPLAY.CPU-USED (1+011)  (AD=ODR ) /*.01D010 N07.2.
1860 053T #DISPLAY.ORIGINATOR-JOB-ID (1+011)  (AD=ODR ) /*.01U005 A005 .
1870 059T #DISPLAY.SIZE (1+011)  (AD=ODL ) /*.01D006 A006 .
1880 069T #DISPLAY.COPIES (1+011)  (AD=ODR ) /*.01D003 N03.0.
1890/
1900 002T #DISPLAY.JOB-NAME (1+012)  (AD=ODL ) /*.01D008 A008 .
1910 011T #DISPLAY.USER (1+012)  (AD=ODL ) /*.01U008 A008 .
1920 020T #DISPLAY.JOB-ID (1+012)  (AD=ODR ) /*.01U005 A005 .
1930 026T #DISPLAY.PRIORITY (1+012)  (AD=ODR ) /*.01D003 N03.0.
1940 030T #DISPLAY.STATUS (1+012)  (AD=ODL ) /*.01D009 A009 .
1950 040T #DISPLAY.TYPE-NUMBER (1+012)  (AD=ODL ) /*.01U001 N01.0.
1960 042T #DISPLAY.CPU-USED (1+012)  (AD=ODR ) /*.01D010 N07.2.
1970 053T #DISPLAY.ORIGINATOR-JOB-ID (1+012)  (AD=ODR ) /*.01U005 A005 .
1980 059T #DISPLAY.SIZE (1+012)  (AD=ODL ) /*.01D006 A006 .
1990 069T #DISPLAY.COPIES (1+012)  (AD=ODR ) /*.01D003 N03.0.
2000/
2010 002T #DISPLAY.JOB-NAME (1+013)  (AD=ODL ) /*.01D008 A008 .
2020 011T #DISPLAY.USER (1+013)  (AD=ODL ) /*.01U008 A008 .
2030 020T #DISPLAY.JOB-ID (1+013)  (AD=ODR ) /*.01U005 A005 .
2040 026T #DISPLAY.PRIORITY (1+013)  (AD=ODR ) /*.01D003 N03.0.
2050 030T #DISPLAY.STATUS (1+013)  (AD=ODL ) /*.01D009 A009 .
2060 040T #DISPLAY.TYPE-NUMBER (1+013)  (AD=ODL ) /*.01U001 N01.0.
2070 042T #DISPLAY.CPU-USED (1+013)  (AD=ODR ) /*.01D010 N07.2.
2080 053T #DISPLAY.ORIGINATOR-JOB-ID (1+013)  (AD=ODR ) /*.01U005 A005 .
2090 059T #DISPLAY.SIZE (1+013)  (AD=ODL ) /*.01D006 A006 .
2100 069T #DISPLAY.COPIES (1+013)  (AD=ODR ) /*.01D003 N03.0.
2110/
2120 002T #DISPLAY.JOB-NAME (1+014)  (AD=ODL ) /*.01D008 A008 .
2130 011T #DISPLAY.USER (1+014)  (AD=ODL ) /*.01U008 A008 .
2140 020T #DISPLAY.JOB-ID (1+014)  (AD=ODR ) /*.01U005 A005 .
2150 026T #DISPLAY.PRIORITY (1+014)  (AD=ODR ) /*.01D003 N03.0.
2160 030T #DISPLAY.STATUS (1+014)  (AD=ODL ) /*.01D009 A009 .
2170 040T #DISPLAY.TYPE-NUMBER (1+014)  (AD=ODL ) /*.01U001 N01.0.
2180 042T #DISPLAY.CPU-USED (1+014)  (AD=ODR ) /*.01D010 N07.2.
2190 053T #DISPLAY.ORIGINATOR-JOB-ID (1+014)  (AD=ODR ) /*.01U005 A005 .
2200 059T #DISPLAY.SIZE (1+014)  (AD=ODL ) /*.01D006 A006 .
2210 069T #DISPLAY.COPIES (1+014)  (AD=ODR ) /*.01D003 N03.0.
2220/
2230/
2240* MAP2: VALIDATION *****************************************************
2250* MAP2: END OF MAP *****************************************************
2260END
