0010* MAP2: PROTOTYPE
0020* INPUT USING MAP 'XXXXXXXX'
0030*     ##TITLE #CVAR #DISPLAY.COPIES(*) #DISPLAY.CPU-USED(*)
0040*     #DISPLAY.JOB-ID(*) #DISPLAY.JOB-NAME(*)
0050*     #DISPLAY.ORIGINATOR-JOB-ID(*) #DISPLAY.PRIORITY(*)
0060*     #DISPLAY.SIZE(*) #DISPLAY.STATUS(*) #DISPLAY.TYPE-NUMBER(*)
0070*     #DISPLAY.USER(*) #JOB-NAME #STATUS #USER-ID
0080DEFINE DATA PARAMETER
00901 ##TITLE (A078)
01001  #CVAR (C)
01101 #DISPLAY.COPIES (N03.0/    1:00015)
01201 #DISPLAY.CPU-USED (N07.2/    1:00015)
01301 #DISPLAY.JOB-ID (A005/00001:00015)
01401 #DISPLAY.JOB-NAME (A008/    1:00015)
01501 #DISPLAY.ORIGINATOR-JOB-ID (A005/00001:00015)
01601 #DISPLAY.PRIORITY (N03.0/    1:00015)
01701 #DISPLAY.SIZE (A006/    1:00015)
01801 #DISPLAY.STATUS (A009/    1:00015)
01901 #DISPLAY.TYPE-NUMBER (N01.0/00001:00015)
02001 #DISPLAY.USER (A008/00001:00015)
02101 #JOB-NAME (A008)
02201 #STATUS (A009)
02301 #USER-ID (A008)
0240END-DEFINE
0250FORMAT PS=021 LS=080 ZP=OFF SG=OFF KD=ON  IP=OFF
0260* MAP2: MAP PROFILES *****************************        410***********
0270* .TTAAAMMOO   D I D I N D I D I        ?_)¬&:+(                       *
0280* 023079        N0NNUCN             X        01 SYSPROF YL   #CVAR   1 *
0290************************************************************************
0300INPUT          (     CV=#CVAR                                         /*
0310                                                                       )
0320 002T ##TITLE  (AD=ODL ) /*.01D078 A078 .
0330/
0340/
0350 002T 'Job-Name UserID'
0360 020T 'TSN'
0370 026T 'Pri Status'
0380 040T 'T CPU verbr. Orig. Groesse Kopien'
0390/
0400 002T #JOB-NAME  (AD=MYLT'_' CD=NE CV=#CVAR ) /*.99D008 A008 .
0410 011T #USER-ID  (AD=MYLT'_' CD=NE CV=#CVAR ) /*.99U008 A008 .
0420 020T '_____ ___'
0430 030T #STATUS  (AD=MYLT'_' CD=NE CV=#CVAR ) /*.99U009 A009 .
0440 040T '_ __________ _____ _______ _____'
0450/
0460 002T #DISPLAY.JOB-NAME (1+000)  (AD=ODL ) /*.01D008 A008 .
0470   /* A1000150000100001    10000100001100015001000001H
0480 011T #DISPLAY.USER (1+000)  (AD=ODL ) /*.01U008 A008 .
0490   /* A1000150000100001000010000100001100015001000001H
0500 020T #DISPLAY.JOB-ID (1+000)  (AD=ODR ) /*.01U005 A005 .
0510   /* A1000150000100001    10000100001100015001000001H
0520 026T #DISPLAY.PRIORITY (1+000)  (AD=ODR ) /*.01D003 N03.0.
0530   /* A1000150000100001    10000100001100015001000001H
0540 030T #DISPLAY.STATUS (1+000)  (AD=ODL ) /*.01D009 A009 .
0550   /* A1000150000100001    10000100001100015001000001H
0560 040T #DISPLAY.TYPE-NUMBER (1+000)  (AD=ODL ) /*.01U001 N01.0.
0570   /* A1000150000100001    10000100001100015001000001H
0580 042T #DISPLAY.CPU-USED (1+000)  (AD=ODR ) /*.01D010 N07.2.
0590   /* A1000150000100001    10000100001100015001000001H
0600 053T #DISPLAY.ORIGINATOR-JOB-ID (1+000)  (AD=ODR ) /*.01U005 A005 .
0610   /* A1000150000100001    10000100001100015001000001H
0620 060T #DISPLAY.SIZE (1+000)  (AD=ODL ) /*.01D006 A006 .
0630   /* A1000150000100001    10000100001100015001000001H
0640 069T #DISPLAY.COPIES (1+000)  (AD=ODR ) /*.01D003 N03.0.
0650   /* A1000150000100001    10000100001100015001000001H
0660/
0670 002T #DISPLAY.JOB-NAME (1+001)  (AD=ODL ) /*.01D008 A008 .
0680 011T #DISPLAY.USER (1+001)  (AD=ODL ) /*.01U008 A008 .
0690 020T #DISPLAY.JOB-ID (1+001)  (AD=ODR ) /*.01U005 A005 .
0700 026T #DISPLAY.PRIORITY (1+001)  (AD=ODR ) /*.01D003 N03.0.
0710 030T #DISPLAY.STATUS (1+001)  (AD=ODL ) /*.01D009 A009 .
0720 040T #DISPLAY.TYPE-NUMBER (1+001)  (AD=ODL ) /*.01U001 N01.0.
0730 042T #DISPLAY.CPU-USED (1+001)  (AD=ODR ) /*.01D010 N07.2.
0740 053T #DISPLAY.ORIGINATOR-JOB-ID (1+001)  (AD=ODR ) /*.01U005 A005 .
0750 060T #DISPLAY.SIZE (1+001)  (AD=ODL ) /*.01D006 A006 .
0760 069T #DISPLAY.COPIES (1+001)  (AD=ODR ) /*.01D003 N03.0.
0770/
0780 002T #DISPLAY.JOB-NAME (1+002)  (AD=ODL ) /*.01D008 A008 .
0790 011T #DISPLAY.USER (1+002)  (AD=ODL ) /*.01U008 A008 .
0800 020T #DISPLAY.JOB-ID (1+002)  (AD=ODR ) /*.01U005 A005 .
0810 026T #DISPLAY.PRIORITY (1+002)  (AD=ODR ) /*.01D003 N03.0.
0820 030T #DISPLAY.STATUS (1+002)  (AD=ODL ) /*.01D009 A009 .
0830 040T #DISPLAY.TYPE-NUMBER (1+002)  (AD=ODL ) /*.01U001 N01.0.
0840 042T #DISPLAY.CPU-USED (1+002)  (AD=ODR ) /*.01D010 N07.2.
0850 053T #DISPLAY.ORIGINATOR-JOB-ID (1+002)  (AD=ODR ) /*.01U005 A005 .
0860 060T #DISPLAY.SIZE (1+002)  (AD=ODL ) /*.01D006 A006 .
0870 069T #DISPLAY.COPIES (1+002)  (AD=ODR ) /*.01D003 N03.0.
0880/
0890 002T #DISPLAY.JOB-NAME (1+003)  (AD=ODL ) /*.01D008 A008 .
0900 011T #DISPLAY.USER (1+003)  (AD=ODL ) /*.01U008 A008 .
0910 020T #DISPLAY.JOB-ID (1+003)  (AD=ODR ) /*.01U005 A005 .
0920 026T #DISPLAY.PRIORITY (1+003)  (AD=ODR ) /*.01D003 N03.0.
0930 030T #DISPLAY.STATUS (1+003)  (AD=ODL ) /*.01D009 A009 .
0940 040T #DISPLAY.TYPE-NUMBER (1+003)  (AD=ODL ) /*.01U001 N01.0.
0950 042T #DISPLAY.CPU-USED (1+003)  (AD=ODR ) /*.01D010 N07.2.
0960 053T #DISPLAY.ORIGINATOR-JOB-ID (1+003)  (AD=ODR ) /*.01U005 A005 .
0970 060T #DISPLAY.SIZE (1+003)  (AD=ODL ) /*.01D006 A006 .
0980 069T #DISPLAY.COPIES (1+003)  (AD=ODR ) /*.01D003 N03.0.
0990/
1000 002T #DISPLAY.JOB-NAME (1+004)  (AD=ODL ) /*.01D008 A008 .
1010 011T #DISPLAY.USER (1+004)  (AD=ODL ) /*.01U008 A008 .
1020 020T #DISPLAY.JOB-ID (1+004)  (AD=ODR ) /*.01U005 A005 .
1030 026T #DISPLAY.PRIORITY (1+004)  (AD=ODR ) /*.01D003 N03.0.
1040 030T #DISPLAY.STATUS (1+004)  (AD=ODL ) /*.01D009 A009 .
1050 040T #DISPLAY.TYPE-NUMBER (1+004)  (AD=ODL ) /*.01U001 N01.0.
1060 042T #DISPLAY.CPU-USED (1+004)  (AD=ODR ) /*.01D010 N07.2.
1070 053T #DISPLAY.ORIGINATOR-JOB-ID (1+004)  (AD=ODR ) /*.01U005 A005 .
1080 060T #DISPLAY.SIZE (1+004)  (AD=ODL ) /*.01D006 A006 .
1090 069T #DISPLAY.COPIES (1+004)  (AD=ODR ) /*.01D003 N03.0.
1100/
1110 002T #DISPLAY.JOB-NAME (1+005)  (AD=ODL ) /*.01D008 A008 .
1120 011T #DISPLAY.USER (1+005)  (AD=ODL ) /*.01U008 A008 .
1130 020T #DISPLAY.JOB-ID (1+005)  (AD=ODR ) /*.01U005 A005 .
1140 026T #DISPLAY.PRIORITY (1+005)  (AD=ODR ) /*.01D003 N03.0.
1150 030T #DISPLAY.STATUS (1+005)  (AD=ODL ) /*.01D009 A009 .
1160 040T #DISPLAY.TYPE-NUMBER (1+005)  (AD=ODL ) /*.01U001 N01.0.
1170 042T #DISPLAY.CPU-USED (1+005)  (AD=ODR ) /*.01D010 N07.2.
1180 053T #DISPLAY.ORIGINATOR-JOB-ID (1+005)  (AD=ODR ) /*.01U005 A005 .
1190 060T #DISPLAY.SIZE (1+005)  (AD=ODL ) /*.01D006 A006 .
1200 069T #DISPLAY.COPIES (1+005)  (AD=ODR ) /*.01D003 N03.0.
1210/
1220 002T #DISPLAY.JOB-NAME (1+006)  (AD=ODL ) /*.01D008 A008 .
1230 011T #DISPLAY.USER (1+006)  (AD=ODL ) /*.01U008 A008 .
1240 020T #DISPLAY.JOB-ID (1+006)  (AD=ODR ) /*.01U005 A005 .
1250 026T #DISPLAY.PRIORITY (1+006)  (AD=ODR ) /*.01D003 N03.0.
1260 030T #DISPLAY.STATUS (1+006)  (AD=ODL ) /*.01D009 A009 .
1270 040T #DISPLAY.TYPE-NUMBER (1+006)  (AD=ODL ) /*.01U001 N01.0.
1280 042T #DISPLAY.CPU-USED (1+006)  (AD=ODR ) /*.01D010 N07.2.
1290 053T #DISPLAY.ORIGINATOR-JOB-ID (1+006)  (AD=ODR ) /*.01U005 A005 .
1300 060T #DISPLAY.SIZE (1+006)  (AD=ODL ) /*.01D006 A006 .
1310 069T #DISPLAY.COPIES (1+006)  (AD=ODR ) /*.01D003 N03.0.
1320/
1330 002T #DISPLAY.JOB-NAME (1+007)  (AD=ODL ) /*.01D008 A008 .
1340 011T #DISPLAY.USER (1+007)  (AD=ODL ) /*.01U008 A008 .
1350 020T #DISPLAY.JOB-ID (1+007)  (AD=ODR ) /*.01U005 A005 .
1360 026T #DISPLAY.PRIORITY (1+007)  (AD=ODR ) /*.01D003 N03.0.
1370 030T #DISPLAY.STATUS (1+007)  (AD=ODL ) /*.01D009 A009 .
1380 040T #DISPLAY.TYPE-NUMBER (1+007)  (AD=ODL ) /*.01U001 N01.0.
1390 042T #DISPLAY.CPU-USED (1+007)  (AD=ODR ) /*.01D010 N07.2.
1400 053T #DISPLAY.ORIGINATOR-JOB-ID (1+007)  (AD=ODR ) /*.01U005 A005 .
1410 060T #DISPLAY.SIZE (1+007)  (AD=ODL ) /*.01D006 A006 .
1420 069T #DISPLAY.COPIES (1+007)  (AD=ODR ) /*.01D003 N03.0.
1430/
1440 002T #DISPLAY.JOB-NAME (1+008)  (AD=ODL ) /*.01D008 A008 .
1450 011T #DISPLAY.USER (1+008)  (AD=ODL ) /*.01U008 A008 .
1460 020T #DISPLAY.JOB-ID (1+008)  (AD=ODR ) /*.01U005 A005 .
1470 026T #DISPLAY.PRIORITY (1+008)  (AD=ODR ) /*.01D003 N03.0.
1480 030T #DISPLAY.STATUS (1+008)  (AD=ODL ) /*.01D009 A009 .
1490 040T #DISPLAY.TYPE-NUMBER (1+008)  (AD=ODL ) /*.01U001 N01.0.
1500 042T #DISPLAY.CPU-USED (1+008)  (AD=ODR ) /*.01D010 N07.2.
1510 053T #DISPLAY.ORIGINATOR-JOB-ID (1+008)  (AD=ODR ) /*.01U005 A005 .
1520 060T #DISPLAY.SIZE (1+008)  (AD=ODL ) /*.01D006 A006 .
1530 069T #DISPLAY.COPIES (1+008)  (AD=ODR ) /*.01D003 N03.0.
1540/
1550 002T #DISPLAY.JOB-NAME (1+009)  (AD=ODL ) /*.01D008 A008 .
1560 011T #DISPLAY.USER (1+009)  (AD=ODL ) /*.01U008 A008 .
1570 020T #DISPLAY.JOB-ID (1+009)  (AD=ODR ) /*.01U005 A005 .
1580 026T #DISPLAY.PRIORITY (1+009)  (AD=ODR ) /*.01D003 N03.0.
1590 030T #DISPLAY.STATUS (1+009)  (AD=ODL ) /*.01D009 A009 .
1600 040T #DISPLAY.TYPE-NUMBER (1+009)  (AD=ODL ) /*.01U001 N01.0.
1610 042T #DISPLAY.CPU-USED (1+009)  (AD=ODR ) /*.01D010 N07.2.
1620 053T #DISPLAY.ORIGINATOR-JOB-ID (1+009)  (AD=ODR ) /*.01U005 A005 .
1630 060T #DISPLAY.SIZE (1+009)  (AD=ODL ) /*.01D006 A006 .
1640 069T #DISPLAY.COPIES (1+009)  (AD=ODR ) /*.01D003 N03.0.
1650/
1660 002T #DISPLAY.JOB-NAME (1+010)  (AD=ODL ) /*.01D008 A008 .
1670 011T #DISPLAY.USER (1+010)  (AD=ODL ) /*.01U008 A008 .
1680 020T #DISPLAY.JOB-ID (1+010)  (AD=ODR ) /*.01U005 A005 .
1690 026T #DISPLAY.PRIORITY (1+010)  (AD=ODR ) /*.01D003 N03.0.
1700 030T #DISPLAY.STATUS (1+010)  (AD=ODL ) /*.01D009 A009 .
1710 040T #DISPLAY.TYPE-NUMBER (1+010)  (AD=ODL ) /*.01U001 N01.0.
1720 042T #DISPLAY.CPU-USED (1+010)  (AD=ODR ) /*.01D010 N07.2.
1730 053T #DISPLAY.ORIGINATOR-JOB-ID (1+010)  (AD=ODR ) /*.01U005 A005 .
1740 060T #DISPLAY.SIZE (1+010)  (AD=ODL ) /*.01D006 A006 .
1750 069T #DISPLAY.COPIES (1+010)  (AD=ODR ) /*.01D003 N03.0.
1760/
1770 002T #DISPLAY.JOB-NAME (1+011)  (AD=ODL ) /*.01D008 A008 .
1780 011T #DISPLAY.USER (1+011)  (AD=ODL ) /*.01U008 A008 .
1790 020T #DISPLAY.JOB-ID (1+011)  (AD=ODR ) /*.01U005 A005 .
1800 026T #DISPLAY.PRIORITY (1+011)  (AD=ODR ) /*.01D003 N03.0.
1810 030T #DISPLAY.STATUS (1+011)  (AD=ODL ) /*.01D009 A009 .
1820 040T #DISPLAY.TYPE-NUMBER (1+011)  (AD=ODL ) /*.01U001 N01.0.
1830 042T #DISPLAY.CPU-USED (1+011)  (AD=ODR ) /*.01D010 N07.2.
1840 053T #DISPLAY.ORIGINATOR-JOB-ID (1+011)  (AD=ODR ) /*.01U005 A005 .
1850 060T #DISPLAY.SIZE (1+011)  (AD=ODL ) /*.01D006 A006 .
1860 069T #DISPLAY.COPIES (1+011)  (AD=ODR ) /*.01D003 N03.0.
1870/
1880 002T #DISPLAY.JOB-NAME (1+012)  (AD=ODL ) /*.01D008 A008 .
1890 011T #DISPLAY.USER (1+012)  (AD=ODL ) /*.01U008 A008 .
1900 020T #DISPLAY.JOB-ID (1+012)  (AD=ODR ) /*.01U005 A005 .
1910 026T #DISPLAY.PRIORITY (1+012)  (AD=ODR ) /*.01D003 N03.0.
1920 030T #DISPLAY.STATUS (1+012)  (AD=ODL ) /*.01D009 A009 .
1930 040T #DISPLAY.TYPE-NUMBER (1+012)  (AD=ODL ) /*.01U001 N01.0.
1940 042T #DISPLAY.CPU-USED (1+012)  (AD=ODR ) /*.01D010 N07.2.
1950 053T #DISPLAY.ORIGINATOR-JOB-ID (1+012)  (AD=ODR ) /*.01U005 A005 .
1960 060T #DISPLAY.SIZE (1+012)  (AD=ODL ) /*.01D006 A006 .
1970 069T #DISPLAY.COPIES (1+012)  (AD=ODR ) /*.01D003 N03.0.
1980/
1990 002T #DISPLAY.JOB-NAME (1+013)  (AD=ODL ) /*.01D008 A008 .
2000 011T #DISPLAY.USER (1+013)  (AD=ODL ) /*.01U008 A008 .
2010 020T #DISPLAY.JOB-ID (1+013)  (AD=ODR ) /*.01U005 A005 .
2020 026T #DISPLAY.PRIORITY (1+013)  (AD=ODR ) /*.01D003 N03.0.
2030 030T #DISPLAY.STATUS (1+013)  (AD=ODL ) /*.01D009 A009 .
2040 040T #DISPLAY.TYPE-NUMBER (1+013)  (AD=ODL ) /*.01U001 N01.0.
2050 042T #DISPLAY.CPU-USED (1+013)  (AD=ODR ) /*.01D010 N07.2.
2060 053T #DISPLAY.ORIGINATOR-JOB-ID (1+013)  (AD=ODR ) /*.01U005 A005 .
2070 060T #DISPLAY.SIZE (1+013)  (AD=ODL ) /*.01D006 A006 .
2080 069T #DISPLAY.COPIES (1+013)  (AD=ODR ) /*.01D003 N03.0.
2090/
2100 002T #DISPLAY.JOB-NAME (1+014)  (AD=ODL ) /*.01D008 A008 .
2110 011T #DISPLAY.USER (1+014)  (AD=ODL ) /*.01U008 A008 .
2120 020T #DISPLAY.JOB-ID (1+014)  (AD=ODR ) /*.01U005 A005 .
2130 026T #DISPLAY.PRIORITY (1+014)  (AD=ODR ) /*.01D003 N03.0.
2140 030T #DISPLAY.STATUS (1+014)  (AD=ODL ) /*.01D009 A009 .
2150 040T #DISPLAY.TYPE-NUMBER (1+014)  (AD=ODL ) /*.01U001 N01.0.
2160 042T #DISPLAY.CPU-USED (1+014)  (AD=ODR ) /*.01D010 N07.2.
2170 053T #DISPLAY.ORIGINATOR-JOB-ID (1+014)  (AD=ODR ) /*.01U005 A005 .
2180 060T #DISPLAY.SIZE (1+014)  (AD=ODL ) /*.01D006 A006 .
2190 069T #DISPLAY.COPIES (1+014)  (AD=ODR ) /*.01D003 N03.0.
2200/
2210/
2220* MAP2: VALIDATION *****************************************************
2230* MAP2: END OF MAP *****************************************************
2240END
