0010* MAP2: PROTOTYPE
0020* INPUT USING MAP 'XXXXXXXX'
0030*     ##TITLE #CVAR #DISPLAY.DSNAME(*) #DISPLAY.JOB-ID(*)
0040*     #DISPLAY.JOB-NAME(*) #DISPLAY.SIZE(*) #DISPLAY.USER(*) #JOB-NAME
0050*     #USER-ID
0060DEFINE DATA PARAMETER
00701 ##TITLE (A078)
00801  #CVAR (C)
00901 #DISPLAY.DSNAME (A054/00001:00015)
01001 #DISPLAY.JOB-ID (A005/00001:00015)
01101 #DISPLAY.JOB-NAME (A008/    1:00015)
01201 #DISPLAY.SIZE (A006/00001:00015)
01301 #DISPLAY.USER (A008/00001:00015)
01401 #JOB-NAME (A008)
01501 #USER-ID (A008)
0160END-DEFINE
0170FORMAT PS=021 LS=080 ZP=OFF SG=OFF KD=ON  IP=OFF
0180* MAP2: MAP PROFILES *****************************        410***********
0190* .TTAAAMMOO   D I D I N D I D I        ?_)¬&:+(                       *
0200* 023079        N0NNUCN             X        01 SYSPROF YL   #CVAR   1 *
0210************************************************************************
0220INPUT          (     CV=#CVAR                                         /*
0230                                                                       )
0240 002T ##TITLE  (AD=ODL ) /*.01D078 A078 .
0250/
0260/
0270 002T 'Job-Name UserID'
0280 020T 'TSN'
0290 026T 'Dsname'
0300 074T 'Size'
0310/
0320 002T #JOB-NAME  (AD=MYLT'_' CD=NE CV=#CVAR ) /*.99D008 A008 .
0330 011T #USER-ID  (AD=MYLT'_' CD=NE CV=#CVAR ) /*.99U008 A008 .
0340 020T '_____'
0350 026T '_' (047)
0360 074T '______'
0370/
0380 002T #DISPLAY.JOB-NAME (1+000)  (AD=ODL ) /*.01D008 A008 .
0390   /* A1000150000100001    10000100001100015001000001H
0400 011T #DISPLAY.USER (1+000)  (AD=ODL ) /*.01U008 A008 .
0410   /* A1000150000100001    10000100001100015001000001H
0420 020T #DISPLAY.JOB-ID (1+000)  (AD=ODR ) /*.01U005 A005 .
0430   /* A1000150000100001    10000100001100015001000001H
0440 026T #DISPLAY.DSNAME (1+000)  (AD=ODL AL=047  ) /*.01D047 A054 .
0450   /* A1000150000100001000010000100001100015001000001H
0460 074T #DISPLAY.SIZE (1+000)  (AD=ODL ) /*.01D006 A006 .
0470   /* A1000150000100001000010000100001100015001000001H
0480/
0490 002T #DISPLAY.JOB-NAME (1+001)  (AD=ODL ) /*.01D008 A008 .
0500 011T #DISPLAY.USER (1+001)  (AD=ODL ) /*.01U008 A008 .
0510 020T #DISPLAY.JOB-ID (1+001)  (AD=ODR ) /*.01U005 A005 .
0520 026T #DISPLAY.DSNAME (1+001)  (AD=ODL AL=047  ) /*.01D047 A054 .
0530 074T #DISPLAY.SIZE (1+001)  (AD=ODL ) /*.01D006 A006 .
0540/
0550 002T #DISPLAY.JOB-NAME (1+002)  (AD=ODL ) /*.01D008 A008 .
0560 011T #DISPLAY.USER (1+002)  (AD=ODL ) /*.01U008 A008 .
0570 020T #DISPLAY.JOB-ID (1+002)  (AD=ODR ) /*.01U005 A005 .
0580 026T #DISPLAY.DSNAME (1+002)  (AD=ODL AL=047  ) /*.01D047 A054 .
0590 074T #DISPLAY.SIZE (1+002)  (AD=ODL ) /*.01D006 A006 .
0600/
0610 002T #DISPLAY.JOB-NAME (1+003)  (AD=ODL ) /*.01D008 A008 .
0620 011T #DISPLAY.USER (1+003)  (AD=ODL ) /*.01U008 A008 .
0630 020T #DISPLAY.JOB-ID (1+003)  (AD=ODR ) /*.01U005 A005 .
0640 026T #DISPLAY.DSNAME (1+003)  (AD=ODL AL=047  ) /*.01D047 A054 .
0650 074T #DISPLAY.SIZE (1+003)  (AD=ODL ) /*.01D006 A006 .
0660/
0670 002T #DISPLAY.JOB-NAME (1+004)  (AD=ODL ) /*.01D008 A008 .
0680 011T #DISPLAY.USER (1+004)  (AD=ODL ) /*.01U008 A008 .
0690 020T #DISPLAY.JOB-ID (1+004)  (AD=ODR ) /*.01U005 A005 .
0700 026T #DISPLAY.DSNAME (1+004)  (AD=ODL AL=047  ) /*.01D047 A054 .
0710 074T #DISPLAY.SIZE (1+004)  (AD=ODL ) /*.01D006 A006 .
0720/
0730 002T #DISPLAY.JOB-NAME (1+005)  (AD=ODL ) /*.01D008 A008 .
0740 011T #DISPLAY.USER (1+005)  (AD=ODL ) /*.01U008 A008 .
0750 020T #DISPLAY.JOB-ID (1+005)  (AD=ODR ) /*.01U005 A005 .
0760 026T #DISPLAY.DSNAME (1+005)  (AD=ODL AL=047  ) /*.01D047 A054 .
0770 074T #DISPLAY.SIZE (1+005)  (AD=ODL ) /*.01D006 A006 .
0780/
0790 002T #DISPLAY.JOB-NAME (1+006)  (AD=ODL ) /*.01D008 A008 .
0800 011T #DISPLAY.USER (1+006)  (AD=ODL ) /*.01U008 A008 .
0810 020T #DISPLAY.JOB-ID (1+006)  (AD=ODR ) /*.01U005 A005 .
0820 026T #DISPLAY.DSNAME (1+006)  (AD=ODL AL=047  ) /*.01D047 A054 .
0830 074T #DISPLAY.SIZE (1+006)  (AD=ODL ) /*.01D006 A006 .
0840/
0850 002T #DISPLAY.JOB-NAME (1+007)  (AD=ODL ) /*.01D008 A008 .
0860 011T #DISPLAY.USER (1+007)  (AD=ODL ) /*.01U008 A008 .
0870 020T #DISPLAY.JOB-ID (1+007)  (AD=ODR ) /*.01U005 A005 .
0880 026T #DISPLAY.DSNAME (1+007)  (AD=ODL AL=047  ) /*.01D047 A054 .
0890 074T #DISPLAY.SIZE (1+007)  (AD=ODL ) /*.01D006 A006 .
0900/
0910 002T #DISPLAY.JOB-NAME (1+008)  (AD=ODL ) /*.01D008 A008 .
0920 011T #DISPLAY.USER (1+008)  (AD=ODL ) /*.01U008 A008 .
0930 020T #DISPLAY.JOB-ID (1+008)  (AD=ODR ) /*.01U005 A005 .
0940 026T #DISPLAY.DSNAME (1+008)  (AD=ODL AL=047  ) /*.01D047 A054 .
0950 074T #DISPLAY.SIZE (1+008)  (AD=ODL ) /*.01D006 A006 .
0960/
0970 002T #DISPLAY.JOB-NAME (1+009)  (AD=ODL ) /*.01D008 A008 .
0980 011T #DISPLAY.USER (1+009)  (AD=ODL ) /*.01U008 A008 .
0990 020T #DISPLAY.JOB-ID (1+009)  (AD=ODR ) /*.01U005 A005 .
1000 026T #DISPLAY.DSNAME (1+009)  (AD=ODL AL=047  ) /*.01D047 A054 .
1010 074T #DISPLAY.SIZE (1+009)  (AD=ODL ) /*.01D006 A006 .
1020/
1030 002T #DISPLAY.JOB-NAME (1+010)  (AD=ODL ) /*.01D008 A008 .
1040 011T #DISPLAY.USER (1+010)  (AD=ODL ) /*.01U008 A008 .
1050 020T #DISPLAY.JOB-ID (1+010)  (AD=ODR ) /*.01U005 A005 .
1060 026T #DISPLAY.DSNAME (1+010)  (AD=ODL AL=047  ) /*.01D047 A054 .
1070 074T #DISPLAY.SIZE (1+010)  (AD=ODL ) /*.01D006 A006 .
1080/
1090 002T #DISPLAY.JOB-NAME (1+011)  (AD=ODL ) /*.01D008 A008 .
1100 011T #DISPLAY.USER (1+011)  (AD=ODL ) /*.01U008 A008 .
1110 020T #DISPLAY.JOB-ID (1+011)  (AD=ODR ) /*.01U005 A005 .
1120 026T #DISPLAY.DSNAME (1+011)  (AD=ODL AL=047  ) /*.01D047 A054 .
1130 074T #DISPLAY.SIZE (1+011)  (AD=ODL ) /*.01D006 A006 .
1140/
1150 002T #DISPLAY.JOB-NAME (1+012)  (AD=ODL ) /*.01D008 A008 .
1160 011T #DISPLAY.USER (1+012)  (AD=ODL ) /*.01U008 A008 .
1170 020T #DISPLAY.JOB-ID (1+012)  (AD=ODR ) /*.01U005 A005 .
1180 026T #DISPLAY.DSNAME (1+012)  (AD=ODL AL=047  ) /*.01D047 A054 .
1190 074T #DISPLAY.SIZE (1+012)  (AD=ODL ) /*.01D006 A006 .
1200/
1210 002T #DISPLAY.JOB-NAME (1+013)  (AD=ODL ) /*.01D008 A008 .
1220 011T #DISPLAY.USER (1+013)  (AD=ODL ) /*.01U008 A008 .
1230 020T #DISPLAY.JOB-ID (1+013)  (AD=ODR ) /*.01U005 A005 .
1240 026T #DISPLAY.DSNAME (1+013)  (AD=ODL AL=047  ) /*.01D047 A054 .
1250 074T #DISPLAY.SIZE (1+013)  (AD=ODL ) /*.01D006 A006 .
1260/
1270 002T #DISPLAY.JOB-NAME (1+014)  (AD=ODL ) /*.01D008 A008 .
1280 011T #DISPLAY.USER (1+014)  (AD=ODL ) /*.01U008 A008 .
1290 020T #DISPLAY.JOB-ID (1+014)  (AD=ODR ) /*.01U005 A005 .
1300 026T #DISPLAY.DSNAME (1+014)  (AD=ODL AL=047  ) /*.01D047 A054 .
1310 074T #DISPLAY.SIZE (1+014)  (AD=ODL ) /*.01D006 A006 .
1320/
1330/
1340* MAP2: VALIDATION *****************************************************
1350* MAP2: END OF MAP *****************************************************
1360END
