0010* MAP2: PROTOTYPE
0020* INPUT USING MAP 'XXXXXXXX'
0030*     ##TITLE #ACCOUNT-NUMBER #CARDS(*) #DSNAME #ELEMENT
0040*     #ERASE-AFTER-RUN #JOB-CLASS #JOB-NAME #JOB-VARIABLE-PASSWORD
0050*     #OBJECT #PRIORITY #START-DATX #START-OPTION #START-TIMX
0060*     #SYSTEM-JOB-VARIABLE #TIME #USER-PASSWORD #USERID
0070DEFINE DATA PARAMETER
00801 ##TITLE (A078)
00901 #ACCOUNT-NUMBER (A008)
01001 #CARDS (A080/00001:00005)
01101 #DSNAME (A054)
01201 #ELEMENT (A064)
01301 #ERASE-AFTER-RUN (A003)
01401 #JOB-CLASS (A008)
01501 #JOB-NAME (A008)
01601 #JOB-VARIABLE-PASSWORD (A004)
01701 #OBJECT (A006)
01801 #PRIORITY (A003)
01901 #START-DATX (D)
02001 #START-OPTION (A017)
02101 #START-TIMX (T)
02201 #SYSTEM-JOB-VARIABLE (A054)
02301 #TIME (A005)
02401 #USER-PASSWORD (A008)
02501 #USERID (A008)
0260END-DEFINE
0270FORMAT PS=021 LS=080 ZP=OFF SG=OFF KD=ON  IP=OFF
0280* MAP2: MAP PROFILES *****************************        410***********
0290* .TTAAAMMOO   D I D I N D I D I        ?_)¬&:+(                       *
0300* 023079        N0NNUCN             X        01 SYSPROF YL           1 *
0310************************************************************************
0320INPUT          (     IP=OFF                                           /*
0330                                                                       )
0340 002T ##TITLE  (AD=ODL ) /*.01D078 A078 .
0350/
0360/
0370 002T 'Submit .........'
0380 019T #OBJECT  (AD=MILT'_' CD=NE ) /*.99U006 A006 .
0390 026T '(MEMBER/FILE/CARDS)'
0400/
0410 002T 'Dsname .........'
0420 019T #DSNAME  (AD=MILT'_' CD=NE ) /*.99D054 A054 .
0430/
0440 002T 'Member .........'
0450 019T #ELEMENT  (AD=MILT'_' CD=NE AL=060  ) /*.99D060 A064 .
0460/
0470 002T 'Cards ..........'
0480 019T #CARDS (001)  (AD=OD AL=060  ) /*.01U060 A080 .
0490   /* A1000050000100001000010000100001100005001000001H
0500/
0510 019T #CARDS (002)  (AD=OD AL=060  ) /*.01U060 A080 .
0520/
0530 019T #CARDS (003)  (AD=OD AL=060  ) /*.01U060 A080 .
0540/
0550 019T #CARDS (004)  (AD=OD AL=060  ) /*.01U060 A080 .
0560/
0570 019T #CARDS (005)  (AD=OD AL=060  ) /*.01U060 A080 .
0580/
0590/
0600 002T 'Jobname ........'
0610 019T #JOB-NAME  (AD=MILT'_' CD=NE ) /*.99U008 A008 .
0620/
0630 002T 'User-ID ........'
0640 019T #USERID  (AD=MILT'_' CD=NE ) /*.99D008 A008 .
0650 028T 'Account-Number .'
0660 045T #ACCOUNT-NUMBER  (AD=MILT'_' CD=NE ) /*.99D008 A008 .
0670/
0680 002T 'Password .......'
0690 019T #USER-PASSWORD  (AD=MILT'_' CD=NE ) /*.99D008 A008 .
0700 028T 'Start...........'
0710 045T #START-OPTION  (AD=MILT'_' CD=NE ) /*.99D017 A017 .
0720/
0730 002T 'Priority .......'
0740 019T #PRIORITY  (AD=MILT'_' CD=NE ) /*.99D003 A003 .
0750 028T 'Time ...........'
0760 045T #TIME  (AD=MILT'_' CD=NE ) /*.99D005 A005 .
0770/
0780 002T 'JOB-Class.......'
0790 019T #JOB-CLASS  (AD=MILT'_' CD=NE ) /*.99D008 A008 .
0800/
0810 002T 'Start-Time......'
0820 019T #START-TIMX  (AD=MILT'_' EM=HH:II ) /*.99D005 T    .
0830 028T 'Start-Date......'
0840 045T #START-DATX  (AD=MILT'_' EM=YYYY-MM-DD ) /*.99D010 D    .
0850 056T '(YYYY-MM-DD)'
0860/
0870 002T 'ERASE...........'
0880 019T #ERASE-AFTER-RUN  (AD=MILT'_' CD=NE ) /*.99D003 A003 .
0890/
0900 002T 'MON-JV..........'
0910 019T #SYSTEM-JOB-VARIABLE  (AD=MILT'_' CD=NE ) /*.99D054 A054 .
0920/
0930 002T 'JV-Password.....'
0940 019T #JOB-VARIABLE-PASSWORD  (AD=MILT'_' CD=NE ) /*.99D004 A004 .
0950/
0960* MAP2: VALIDATION *****************************************************
0970* MAP2: END OF MAP *****************************************************
0980END
