0010* MAP2: PROTOTYPE
0020* INPUT USING MAP 'XXXXXXXX'
0030*     ##TITLE #ACCOUNT-NUMBER #CARDS(*) #DSNAME #ELEMENT
0040*     #ERASE-AFTER-RUN #JOB-CLASS #JOB-NAME #JOB-VARIABLE-PASSWORD
0050*     #OBJECT #PRIORITY #START-DATX #START-OPTION #START-TIMX
0060*     #SYSTEM-JOB-VARIABLE #TIME #USER-PASSWORD #USERID
0070DEFINE DATA PARAMETER
00801 ##TITLE (A078)
00901 #ACCOUNT-NUMBER (A008)
01001 #CARDS (A080/00001:00005)
01101 #DSNAME (A054)
01201 #ELEMENT (A064)
01301 #ERASE-AFTER-RUN (A003)
01401 #JOB-CLASS (A008)
01501 #JOB-NAME (A008)
01601 #JOB-VARIABLE-PASSWORD (A004)
01701 #OBJECT (A006)
01801 #PRIORITY (A003)
01901 #START-DATX (D)
02001 #START-OPTION (A017)
02101 #START-TIMX (T)
02201 #SYSTEM-JOB-VARIABLE (A054)
02301 #TIME (A005)
02401 #USER-PASSWORD (A008)
02501 #USERID (A008)
0260END-DEFINE
0270FORMAT PS=021 LS=080 ZP=OFF SG=OFF KD=ON  IP=OFF
0280* MAP2: MAP PROFILES *****************************        410***********
0290* .TTAAAMMOO   D I D I N D I D I        ?_)¬&:+(                       *
0300* 023079        N0NNUCN             X        01 SYSPROF YL           1 *
0310************************************************************************
0320INPUT          (     IP=OFF                                           /*
0330                                                                       )
0340 002T ##TITLE  (AD=ODL ) /*.01D078 A078 .
0350/
0360/
0370 002T 'Submit .........'
0380 019T #OBJECT  (AD=MILT'_' CD=NE ) /*.99U006 A006 .
0390 026T '(MEMBER/FILE/CARDS)'
0400/
0410 002T 'Datei'
0420 009T '.........'
0430 019T #DSNAME  (AD=MILT'_' CD=NE ) /*.99D054 A054 .
0440/
0450 002T 'Member .........'
0460 019T #ELEMENT  (AD=MILT'_' CD=NE AL=060  ) /*.99D060 A064 .
0470/
0480 002T 'Karten .........'
0490 019T #CARDS (001)  (AD=OD AL=060  ) /*.01U060 A080 .
0500   /* A1000050000100001000010000100001100005001000001H
0510/
0520 019T #CARDS (002)  (AD=OD AL=060  ) /*.01U060 A080 .
0530/
0540 019T #CARDS (003)  (AD=OD AL=060  ) /*.01U060 A080 .
0550/
0560 019T #CARDS (004)  (AD=OD AL=060  ) /*.01U060 A080 .
0570/
0580 019T #CARDS (005)  (AD=OD AL=060  ) /*.01U060 A080 .
0590/
0600/
0610 002T 'Jobname ........'
0620 019T #JOB-NAME  (AD=MILT'_' CD=NE ) /*.99U008 A008 .
0630/
0640 002T 'User-ID ........'
0650 019T #USERID  (AD=MILT'_' CD=NE ) /*.99D008 A008 .
0660 028T 'Account Nummer .'
0670 045T #ACCOUNT-NUMBER  (AD=MILT'_' CD=NE ) /*.99D008 A008 .
0680/
0690 002T 'Passwort .......'
0700 019T #USER-PASSWORD  (AD=MILT'_' CD=NE ) /*.99D008 A008 .
0710 028T 'Start...........'
0720 045T #START-OPTION  (AD=MILT'_' CD=NE ) /*.99D017 A017 .
0730/
0740 002T 'Prioritat ......'
0750 019T #PRIORITY  (AD=MILT'_' CD=NE ) /*.99D003 A003 .
0760 028T 'Zeit ...........'
0770 045T #TIME  (AD=MILT'_' CD=NE ) /*.99D005 A005 .
0780/
0790 002T 'JOB Klasse .....'
0800 019T #JOB-CLASS  (AD=MILT'_' CD=NE ) /*.99D008 A008 .
0810/
0820 002T 'Start Zeit .....'
0830 019T #START-TIMX  (AD=MILT'_' EM=HH:II ) /*.99D005 T    .
0840 028T 'Start Datum ....'
0850 045T #START-DATX  (AD=MILT'_' EM=DD.MM.YYYY ) /*.99D010 D    .
0860 056T '(TT.MM.JJJJ)'
0870/
0880 002T 'ERASE...........'
0890 019T #ERASE-AFTER-RUN  (AD=MILT'_' CD=NE ) /*.99D003 A003 .
0900/
0910 002T 'MON-JV..........'
0920 019T #SYSTEM-JOB-VARIABLE  (AD=MILT'_' CD=NE ) /*.99D054 A054 .
0930/
0940 002T 'JV Passwort ....'
0950 019T #JOB-VARIABLE-PASSWORD  (AD=MILT'_' CD=NE ) /*.99D004 A004 .
0960/
0970* MAP2: VALIDATION *****************************************************
0980* MAP2: END OF MAP *****************************************************
0990END
