0010* MAP2: PROTOTYPE
0020* INPUT USING MAP 'XXXXXXXX'
0030*     ##TITLE #DISPLAY.MARK(*) #DISPLAY.STATUS(*) #DISPLAY.SWITCH(*)
0040*     #FUNCTION #OPERATION #SWITCH-TYPE #USERID
0050DEFINE DATA PARAMETER
00601 ##TITLE (A078)
00701 #DISPLAY.MARK (A001/00001:00032)
00801 #DISPLAY.STATUS (A003/00001:00032)
00901 #DISPLAY.SWITCH (N02.0/00001:00032)
01001 #FUNCTION (A008)
01101 #OPERATION (A006)
01201 #SWITCH-TYPE (A007)
01301 #USERID (A008)
0140END-DEFINE
0150FORMAT PS=021 LS=080 ZP=OFF SG=OFF KD=ON  IP=OFF
0160* MAP2: MAP PROFILES *****************************        410***********
0170* .TTAAAMMOO   D I D I N D I D I        ?_)¬&:+(                       *
0180* 023079        N0 NUCN             X        01 SYSPROF YL           1 *
0190************************************************************************
0200INPUT          (     IP=OFF                                           /*
0210                                                                       )
0220 002T ##TITLE  (AD=ODL ) /*.01D078 A078 .
0230/
0240/
0250 002T 'Funktion .......'
0260 019T #FUNCTION  (AD=MILT'_' ) /*.99D008 A008 .
0270 028T '(read/write/attrib)'
0280/
0290 002T 'Operation ......'
0300 019T #OPERATION  (AD=MILT'_' ) /*.99D006 A006 .
0310 028T '(invert/on/off)'
0320/
0330 002T 'Schalter Typ ...'
0340 019T #SWITCH-TYPE  (AD=MILT'_' ) /*.99D007 A007 .
0350 028T '(user/process)'
0360/
0370 002T 'BS2000 UserID ..'
0380 019T #USERID  (AD=MILT'_' ) /*.99U008 A008 .
0390/
0400/
0410 004T 'Nummer Status'
0420 022T 'Nummer Status'
0430 040T 'Nummer Status'
0440 058T 'Nummer Status'
0450/
0460 002T '_ ______ ______   _ ______ ______   _ ______ ______   _'
0470 058T '______ ______'
0480/
0490 002T #DISPLAY.MARK (001)  (AD=MILT'_' ) /*.99D001 A001 .
0500   /* A1000320000100001000010000100001010008004000017H
0510 006T #DISPLAY.SWITCH (001)  (AD=ODR ZP=ON ) /*.01D002 N02.0.
0520   /* A1000320000100001000010000100001010008004000016H
0530 013T #DISPLAY.STATUS (001)  (AD=ODL ) /*.01D003 A003 .
0540   /* A1000320000100001000010000100001010008004000015H
0550 020T #DISPLAY.MARK (002)  (AD=MILT'_' ) /*.99D001 A001 .
0560 024T #DISPLAY.SWITCH (002)  (AD=ODR ZP=ON ) /*.01D002 N02.0.
0570 031T #DISPLAY.STATUS (002)  (AD=ODL ) /*.01D003 A003 .
0580 038T #DISPLAY.MARK (003)  (AD=MILT'_' ) /*.99D001 A001 .
0590 042T #DISPLAY.SWITCH (003)  (AD=ODR ZP=ON ) /*.01D002 N02.0.
0600 049T #DISPLAY.STATUS (003)  (AD=ODL ) /*.01D003 A003 .
0610 056T #DISPLAY.MARK (004)  (AD=MILT'_' ) /*.99D001 A001 .
0620 060T #DISPLAY.SWITCH (004)  (AD=ODR ZP=ON ) /*.01D002 N02.0.
0630 067T #DISPLAY.STATUS (004)  (AD=ODL ) /*.01D003 A003 .
0640/
0650 002T #DISPLAY.MARK (005)  (AD=MILT'_' ) /*.99D001 A001 .
0660 006T #DISPLAY.SWITCH (005)  (AD=ODR ZP=ON ) /*.01D002 N02.0.
0670 013T #DISPLAY.STATUS (005)  (AD=ODL ) /*.01D003 A003 .
0680 020T #DISPLAY.MARK (006)  (AD=MILT'_' ) /*.99D001 A001 .
0690 024T #DISPLAY.SWITCH (006)  (AD=ODR ZP=ON ) /*.01D002 N02.0.
0700 031T #DISPLAY.STATUS (006)  (AD=ODL ) /*.01D003 A003 .
0710 038T #DISPLAY.MARK (007)  (AD=MILT'_' ) /*.99D001 A001 .
0720 042T #DISPLAY.SWITCH (007)  (AD=ODR ZP=ON ) /*.01D002 N02.0.
0730 049T #DISPLAY.STATUS (007)  (AD=ODL ) /*.01D003 A003 .
0740 056T #DISPLAY.MARK (008)  (AD=MILT'_' ) /*.99D001 A001 .
0750 060T #DISPLAY.SWITCH (008)  (AD=ODR ZP=ON ) /*.01D002 N02.0.
0760 067T #DISPLAY.STATUS (008)  (AD=ODL ) /*.01D003 A003 .
0770/
0780 002T #DISPLAY.MARK (009)  (AD=MILT'_' ) /*.99D001 A001 .
0790 006T #DISPLAY.SWITCH (009)  (AD=ODR ZP=ON ) /*.01D002 N02.0.
0800 013T #DISPLAY.STATUS (009)  (AD=ODL ) /*.01D003 A003 .
0810 020T #DISPLAY.MARK (010)  (AD=MILT'_' ) /*.99D001 A001 .
0820 024T #DISPLAY.SWITCH (010)  (AD=ODR ZP=ON ) /*.01D002 N02.0.
0830 031T #DISPLAY.STATUS (010)  (AD=ODL ) /*.01D003 A003 .
0840 038T #DISPLAY.MARK (011)  (AD=MILT'_' ) /*.99D001 A001 .
0850 042T #DISPLAY.SWITCH (011)  (AD=ODR ZP=ON ) /*.01D002 N02.0.
0860 049T #DISPLAY.STATUS (011)  (AD=ODL ) /*.01D003 A003 .
0870 056T #DISPLAY.MARK (012)  (AD=MILT'_' ) /*.99D001 A001 .
0880 060T #DISPLAY.SWITCH (012)  (AD=ODR ZP=ON ) /*.01D002 N02.0.
0890 067T #DISPLAY.STATUS (012)  (AD=ODL ) /*.01D003 A003 .
0900/
0910 002T #DISPLAY.MARK (013)  (AD=MILT'_' ) /*.99D001 A001 .
0920 006T #DISPLAY.SWITCH (013)  (AD=ODR ZP=ON ) /*.01D002 N02.0.
0930 013T #DISPLAY.STATUS (013)  (AD=ODL ) /*.01D003 A003 .
0940 020T #DISPLAY.MARK (014)  (AD=MILT'_' ) /*.99D001 A001 .
0950 024T #DISPLAY.SWITCH (014)  (AD=ODR ZP=ON ) /*.01D002 N02.0.
0960 031T #DISPLAY.STATUS (014)  (AD=ODL ) /*.01D003 A003 .
0970 038T #DISPLAY.MARK (015)  (AD=MILT'_' ) /*.99D001 A001 .
0980 042T #DISPLAY.SWITCH (015)  (AD=ODR ZP=ON ) /*.01D002 N02.0.
0990 049T #DISPLAY.STATUS (015)  (AD=ODL ) /*.01D003 A003 .
1000 056T #DISPLAY.MARK (016)  (AD=MILT'_' ) /*.99D001 A001 .
1010 060T #DISPLAY.SWITCH (016)  (AD=ODR ZP=ON ) /*.01D002 N02.0.
1020 067T #DISPLAY.STATUS (016)  (AD=ODL ) /*.01D003 A003 .
1030/
1040 002T #DISPLAY.MARK (017)  (AD=MILT'_' ) /*.99D001 A001 .
1050 006T #DISPLAY.SWITCH (017)  (AD=ODR ZP=ON ) /*.01D002 N02.0.
1060 013T #DISPLAY.STATUS (017)  (AD=ODL ) /*.01D003 A003 .
1070 020T #DISPLAY.MARK (018)  (AD=MILT'_' ) /*.99D001 A001 .
1080 024T #DISPLAY.SWITCH (018)  (AD=ODR ZP=ON ) /*.01D002 N02.0.
1090 031T #DISPLAY.STATUS (018)  (AD=ODL ) /*.01D003 A003 .
1100 038T #DISPLAY.MARK (019)  (AD=MILT'_' ) /*.99D001 A001 .
1110 042T #DISPLAY.SWITCH (019)  (AD=ODR ZP=ON ) /*.01D002 N02.0.
1120 049T #DISPLAY.STATUS (019)  (AD=ODL ) /*.01D003 A003 .
1130 056T #DISPLAY.MARK (020)  (AD=MILT'_' ) /*.99D001 A001 .
1140 060T #DISPLAY.SWITCH (020)  (AD=ODR ZP=ON ) /*.01D002 N02.0.
1150 067T #DISPLAY.STATUS (020)  (AD=ODL ) /*.01D003 A003 .
1160/
1170 002T #DISPLAY.MARK (021)  (AD=MILT'_' ) /*.99D001 A001 .
1180 006T #DISPLAY.SWITCH (021)  (AD=ODR ZP=ON ) /*.01D002 N02.0.
1190 013T #DISPLAY.STATUS (021)  (AD=ODL ) /*.01D003 A003 .
1200 020T #DISPLAY.MARK (022)  (AD=MILT'_' ) /*.99D001 A001 .
1210 024T #DISPLAY.SWITCH (022)  (AD=ODR ZP=ON ) /*.01D002 N02.0.
1220 031T #DISPLAY.STATUS (022)  (AD=ODL ) /*.01D003 A003 .
1230 038T #DISPLAY.MARK (023)  (AD=MILT'_' ) /*.99D001 A001 .
1240 042T #DISPLAY.SWITCH (023)  (AD=ODR ZP=ON ) /*.01D002 N02.0.
1250 049T #DISPLAY.STATUS (023)  (AD=ODL ) /*.01D003 A003 .
1260 056T #DISPLAY.MARK (024)  (AD=MILT'_' ) /*.99D001 A001 .
1270 060T #DISPLAY.SWITCH (024)  (AD=ODR ZP=ON ) /*.01D002 N02.0.
1280 067T #DISPLAY.STATUS (024)  (AD=ODL ) /*.01D003 A003 .
1290/
1300 002T #DISPLAY.MARK (025)  (AD=MILT'_' ) /*.99D001 A001 .
1310 006T #DISPLAY.SWITCH (025)  (AD=ODR ZP=ON ) /*.01D002 N02.0.
1320 013T #DISPLAY.STATUS (025)  (AD=ODL ) /*.01D003 A003 .
1330 020T #DISPLAY.MARK (026)  (AD=MILT'_' ) /*.99D001 A001 .
1340 024T #DISPLAY.SWITCH (026)  (AD=ODR ZP=ON ) /*.01D002 N02.0.
1350 031T #DISPLAY.STATUS (026)  (AD=ODL ) /*.01D003 A003 .
1360 038T #DISPLAY.MARK (027)  (AD=MILT'_' ) /*.99D001 A001 .
1370 042T #DISPLAY.SWITCH (027)  (AD=ODR ZP=ON ) /*.01D002 N02.0.
1380 049T #DISPLAY.STATUS (027)  (AD=ODL ) /*.01D003 A003 .
1390 056T #DISPLAY.MARK (028)  (AD=MILT'_' ) /*.99D001 A001 .
1400 060T #DISPLAY.SWITCH (028)  (AD=ODR ZP=ON ) /*.01D002 N02.0.
1410 067T #DISPLAY.STATUS (028)  (AD=ODL ) /*.01D003 A003 .
1420/
1430 002T #DISPLAY.MARK (029)  (AD=MILT'_' ) /*.99D001 A001 .
1440 006T #DISPLAY.SWITCH (029)  (AD=ODR ZP=ON ) /*.01D002 N02.0.
1450 013T #DISPLAY.STATUS (029)  (AD=ODL ) /*.01D003 A003 .
1460 020T #DISPLAY.MARK (030)  (AD=MILT'_' ) /*.99D001 A001 .
1470 024T #DISPLAY.SWITCH (030)  (AD=ODR ZP=ON ) /*.01D002 N02.0.
1480 031T #DISPLAY.STATUS (030)  (AD=ODL ) /*.01D003 A003 .
1490 038T #DISPLAY.MARK (031)  (AD=MILT'_' ) /*.99D001 A001 .
1500 042T #DISPLAY.SWITCH (031)  (AD=ODR ZP=ON ) /*.01D002 N02.0.
1510 049T #DISPLAY.STATUS (031)  (AD=ODL ) /*.01D003 A003 .
1520 056T #DISPLAY.MARK (032)  (AD=MILT'_' ) /*.99D001 A001 .
1530 060T #DISPLAY.SWITCH (032)  (AD=ODR ZP=ON ) /*.01D002 N02.0.
1540 067T #DISPLAY.STATUS (032)  (AD=ODL ) /*.01D003 A003 .
1550/
1560/
1570/
1580 002T 'Markieren Sie den gewuenschten Schalter mit ''X'''
1590/
1600* MAP2: VALIDATION *****************************************************
1610* MAP2: END OF MAP *****************************************************
1620END
