0010* MAP2: PROTOTYPE
0020* INPUT USING MAP 'XXXXXXXX'
0030*     ##TITLE #DISPLAY.MARK(*) #DISPLAY.STATUS(*) #DISPLAY.SWITCH(*)
0040*     #FUNCTION #OPERATION #SWITCH-TYPE #USERID
0050DEFINE DATA PARAMETER
00601 ##TITLE (A078)
00701 #DISPLAY.MARK (A001/00001:00032)
00801 #DISPLAY.STATUS (A003/00001:00032)
00901 #DISPLAY.SWITCH (N02.0/00001:00032)
01001 #FUNCTION (A008)
01101 #OPERATION (A006)
01201 #SWITCH-TYPE (A007)
01301 #USERID (A008)
0140END-DEFINE
0150FORMAT PS=021 LS=080 ZP=OFF SG=OFF KD=ON  IP=OFF
0160* MAP2: MAP PROFILES *****************************        410***********
0170* .TTAAAMMOO   D I D I N D I D I        ?_)¬&:+(                       *
0180* 023079        N0 NUCN             X        01 SYSPROF YL           1 *
0190************************************************************************
0200INPUT          (     IP=OFF                                           /*
0210                                                                       )
0220 002T ##TITLE  (AD=ODL ) /*.01D078 A078 .
0230/
0240/
0250 002T 'Function .......'
0260 019T #FUNCTION  (AD=MILT'_' ) /*.99D008 A008 .
0270 028T '(read/write/attrib)'
0280/
0290 002T 'Operation ......'
0300 019T #OPERATION  (AD=MILT'_' ) /*.99D006 A006 .
0310 028T '(invert/on/off)'
0320/
0330 002T 'Switch-Type ....'
0340 019T #SWITCH-TYPE  (AD=MILT'_' ) /*.99D007 A007 .
0350 028T '(user/process)'
0360/
0370 002T 'BS2000-UserID ..'
0380 019T #USERID  (AD=MILT'_' ) /*.99U008 A008 .
0390/
0400/
0410 004T 'Switch Status     Switch Status     Switch Status'
0420 058T 'Switch Status'
0430/
0440 002T '_ ______ ______   _ ______ ______   _ ______ ______   _'
0450 058T '______ ______'
0460/
0470 002T #DISPLAY.MARK (001)  (AD=MILT'_' ) /*.99D001 A001 .
0480   /* A1000320000100001000010000100001010008004000017H
0490 006T #DISPLAY.SWITCH (001)  (AD=ODR ZP=ON ) /*.01D002 N02.0.
0500   /* A1000320000100001000010000100001010008004000016H
0510 013T #DISPLAY.STATUS (001)  (AD=ODL ) /*.01D003 A003 .
0520   /* A1000320000100001000010000100001010008004000015H
0530 020T #DISPLAY.MARK (002)  (AD=MILT'_' ) /*.99D001 A001 .
0540 024T #DISPLAY.SWITCH (002)  (AD=ODR ZP=ON ) /*.01D002 N02.0.
0550 031T #DISPLAY.STATUS (002)  (AD=ODL ) /*.01D003 A003 .
0560 038T #DISPLAY.MARK (003)  (AD=MILT'_' ) /*.99D001 A001 .
0570 042T #DISPLAY.SWITCH (003)  (AD=ODR ZP=ON ) /*.01D002 N02.0.
0580 049T #DISPLAY.STATUS (003)  (AD=ODL ) /*.01D003 A003 .
0590 056T #DISPLAY.MARK (004)  (AD=MILT'_' ) /*.99D001 A001 .
0600 060T #DISPLAY.SWITCH (004)  (AD=ODR ZP=ON ) /*.01D002 N02.0.
0610 067T #DISPLAY.STATUS (004)  (AD=ODL ) /*.01D003 A003 .
0620/
0630 002T #DISPLAY.MARK (005)  (AD=MILT'_' ) /*.99D001 A001 .
0640 006T #DISPLAY.SWITCH (005)  (AD=ODR ZP=ON ) /*.01D002 N02.0.
0650 013T #DISPLAY.STATUS (005)  (AD=ODL ) /*.01D003 A003 .
0660 020T #DISPLAY.MARK (006)  (AD=MILT'_' ) /*.99D001 A001 .
0670 024T #DISPLAY.SWITCH (006)  (AD=ODR ZP=ON ) /*.01D002 N02.0.
0680 031T #DISPLAY.STATUS (006)  (AD=ODL ) /*.01D003 A003 .
0690 038T #DISPLAY.MARK (007)  (AD=MILT'_' ) /*.99D001 A001 .
0700 042T #DISPLAY.SWITCH (007)  (AD=ODR ZP=ON ) /*.01D002 N02.0.
0710 049T #DISPLAY.STATUS (007)  (AD=ODL ) /*.01D003 A003 .
0720 056T #DISPLAY.MARK (008)  (AD=MILT'_' ) /*.99D001 A001 .
0730 060T #DISPLAY.SWITCH (008)  (AD=ODR ZP=ON ) /*.01D002 N02.0.
0740 067T #DISPLAY.STATUS (008)  (AD=ODL ) /*.01D003 A003 .
0750/
0760 002T #DISPLAY.MARK (009)  (AD=MILT'_' ) /*.99D001 A001 .
0770 006T #DISPLAY.SWITCH (009)  (AD=ODR ZP=ON ) /*.01D002 N02.0.
0780 013T #DISPLAY.STATUS (009)  (AD=ODL ) /*.01D003 A003 .
0790 020T #DISPLAY.MARK (010)  (AD=MILT'_' ) /*.99D001 A001 .
0800 024T #DISPLAY.SWITCH (010)  (AD=ODR ZP=ON ) /*.01D002 N02.0.
0810 031T #DISPLAY.STATUS (010)  (AD=ODL ) /*.01D003 A003 .
0820 038T #DISPLAY.MARK (011)  (AD=MILT'_' ) /*.99D001 A001 .
0830 042T #DISPLAY.SWITCH (011)  (AD=ODR ZP=ON ) /*.01D002 N02.0.
0840 049T #DISPLAY.STATUS (011)  (AD=ODL ) /*.01D003 A003 .
0850 056T #DISPLAY.MARK (012)  (AD=MILT'_' ) /*.99D001 A001 .
0860 060T #DISPLAY.SWITCH (012)  (AD=ODR ZP=ON ) /*.01D002 N02.0.
0870 067T #DISPLAY.STATUS (012)  (AD=ODL ) /*.01D003 A003 .
0880/
0890 002T #DISPLAY.MARK (013)  (AD=MILT'_' ) /*.99D001 A001 .
0900 006T #DISPLAY.SWITCH (013)  (AD=ODR ZP=ON ) /*.01D002 N02.0.
0910 013T #DISPLAY.STATUS (013)  (AD=ODL ) /*.01D003 A003 .
0920 020T #DISPLAY.MARK (014)  (AD=MILT'_' ) /*.99D001 A001 .
0930 024T #DISPLAY.SWITCH (014)  (AD=ODR ZP=ON ) /*.01D002 N02.0.
0940 031T #DISPLAY.STATUS (014)  (AD=ODL ) /*.01D003 A003 .
0950 038T #DISPLAY.MARK (015)  (AD=MILT'_' ) /*.99D001 A001 .
0960 042T #DISPLAY.SWITCH (015)  (AD=ODR ZP=ON ) /*.01D002 N02.0.
0970 049T #DISPLAY.STATUS (015)  (AD=ODL ) /*.01D003 A003 .
0980 056T #DISPLAY.MARK (016)  (AD=MILT'_' ) /*.99D001 A001 .
0990 060T #DISPLAY.SWITCH (016)  (AD=ODR ZP=ON ) /*.01D002 N02.0.
1000 067T #DISPLAY.STATUS (016)  (AD=ODL ) /*.01D003 A003 .
1010/
1020 002T #DISPLAY.MARK (017)  (AD=MILT'_' ) /*.99D001 A001 .
1030 006T #DISPLAY.SWITCH (017)  (AD=ODR ZP=ON ) /*.01D002 N02.0.
1040 013T #DISPLAY.STATUS (017)  (AD=ODL ) /*.01D003 A003 .
1050 020T #DISPLAY.MARK (018)  (AD=MILT'_' ) /*.99D001 A001 .
1060 024T #DISPLAY.SWITCH (018)  (AD=ODR ZP=ON ) /*.01D002 N02.0.
1070 031T #DISPLAY.STATUS (018)  (AD=ODL ) /*.01D003 A003 .
1080 038T #DISPLAY.MARK (019)  (AD=MILT'_' ) /*.99D001 A001 .
1090 042T #DISPLAY.SWITCH (019)  (AD=ODR ZP=ON ) /*.01D002 N02.0.
1100 049T #DISPLAY.STATUS (019)  (AD=ODL ) /*.01D003 A003 .
1110 056T #DISPLAY.MARK (020)  (AD=MILT'_' ) /*.99D001 A001 .
1120 060T #DISPLAY.SWITCH (020)  (AD=ODR ZP=ON ) /*.01D002 N02.0.
1130 067T #DISPLAY.STATUS (020)  (AD=ODL ) /*.01D003 A003 .
1140/
1150 002T #DISPLAY.MARK (021)  (AD=MILT'_' ) /*.99D001 A001 .
1160 006T #DISPLAY.SWITCH (021)  (AD=ODR ZP=ON ) /*.01D002 N02.0.
1170 013T #DISPLAY.STATUS (021)  (AD=ODL ) /*.01D003 A003 .
1180 020T #DISPLAY.MARK (022)  (AD=MILT'_' ) /*.99D001 A001 .
1190 024T #DISPLAY.SWITCH (022)  (AD=ODR ZP=ON ) /*.01D002 N02.0.
1200 031T #DISPLAY.STATUS (022)  (AD=ODL ) /*.01D003 A003 .
1210 038T #DISPLAY.MARK (023)  (AD=MILT'_' ) /*.99D001 A001 .
1220 042T #DISPLAY.SWITCH (023)  (AD=ODR ZP=ON ) /*.01D002 N02.0.
1230 049T #DISPLAY.STATUS (023)  (AD=ODL ) /*.01D003 A003 .
1240 056T #DISPLAY.MARK (024)  (AD=MILT'_' ) /*.99D001 A001 .
1250 060T #DISPLAY.SWITCH (024)  (AD=ODR ZP=ON ) /*.01D002 N02.0.
1260 067T #DISPLAY.STATUS (024)  (AD=ODL ) /*.01D003 A003 .
1270/
1280 002T #DISPLAY.MARK (025)  (AD=MILT'_' ) /*.99D001 A001 .
1290 006T #DISPLAY.SWITCH (025)  (AD=ODR ZP=ON ) /*.01D002 N02.0.
1300 013T #DISPLAY.STATUS (025)  (AD=ODL ) /*.01D003 A003 .
1310 020T #DISPLAY.MARK (026)  (AD=MILT'_' ) /*.99D001 A001 .
1320 024T #DISPLAY.SWITCH (026)  (AD=ODR ZP=ON ) /*.01D002 N02.0.
1330 031T #DISPLAY.STATUS (026)  (AD=ODL ) /*.01D003 A003 .
1340 038T #DISPLAY.MARK (027)  (AD=MILT'_' ) /*.99D001 A001 .
1350 042T #DISPLAY.SWITCH (027)  (AD=ODR ZP=ON ) /*.01D002 N02.0.
1360 049T #DISPLAY.STATUS (027)  (AD=ODL ) /*.01D003 A003 .
1370 056T #DISPLAY.MARK (028)  (AD=MILT'_' ) /*.99D001 A001 .
1380 060T #DISPLAY.SWITCH (028)  (AD=ODR ZP=ON ) /*.01D002 N02.0.
1390 067T #DISPLAY.STATUS (028)  (AD=ODL ) /*.01D003 A003 .
1400/
1410 002T #DISPLAY.MARK (029)  (AD=MILT'_' ) /*.99D001 A001 .
1420 006T #DISPLAY.SWITCH (029)  (AD=ODR ZP=ON ) /*.01D002 N02.0.
1430 013T #DISPLAY.STATUS (029)  (AD=ODL ) /*.01D003 A003 .
1440 020T #DISPLAY.MARK (030)  (AD=MILT'_' ) /*.99D001 A001 .
1450 024T #DISPLAY.SWITCH (030)  (AD=ODR ZP=ON ) /*.01D002 N02.0.
1460 031T #DISPLAY.STATUS (030)  (AD=ODL ) /*.01D003 A003 .
1470 038T #DISPLAY.MARK (031)  (AD=MILT'_' ) /*.99D001 A001 .
1480 042T #DISPLAY.SWITCH (031)  (AD=ODR ZP=ON ) /*.01D002 N02.0.
1490 049T #DISPLAY.STATUS (031)  (AD=ODL ) /*.01D003 A003 .
1500 056T #DISPLAY.MARK (032)  (AD=MILT'_' ) /*.99D001 A001 .
1510 060T #DISPLAY.SWITCH (032)  (AD=ODR ZP=ON ) /*.01D002 N02.0.
1520 067T #DISPLAY.STATUS (032)  (AD=ODL ) /*.01D003 A003 .
1530/
1540/
1550/
1560 002T 'Please mark specific Switch(es) with ''X'''
1570/
1580* MAP2: VALIDATION *****************************************************
1590* MAP2: END OF MAP *****************************************************
1600END
