0010* MAP2: PROTOTYPE
0020* INPUT USING MAP 'XXXXXXXX'
0030*     ##TITLE SYSTEM-INFO.AUTO-LOGON SYSTEM-INFO.CONFIGURATION-NAME
0040*     SYSTEM-INFO.ESY-VERSION SYSTEM-INFO.JOBVAR
0050*     SYSTEM-INFO.LMS-VERSION SYSTEM-INFO.LOCAL-DATX
0060*     SYSTEM-INFO.LOCAL-TIMX SYSTEM-INFO.LOGON-ID
0070*     SYSTEM-INFO.MEMORY-SIZE SYSTEM-INFO.MODE
0080*     SYSTEM-INFO.OPERATING-SYSTEM-ID SYSTEM-INFO.OPERATING-SYSTEM-TYPE
0090*     SYSTEM-INFO.SECURITY SYSTEM-INFO.SYSTEM-BASE-ADDRESS
0100*     SYSTEM-INFO.SYSTEM-RELEASE SYSTEM-INFO.SYSTEM-TYPE
0110DEFINE DATA PARAMETER
01201 ##TITLE (A078)
01301 SYSTEM-INFO.AUTO-LOGON (A003)
01401 SYSTEM-INFO.CONFIGURATION-NAME (A021)
01501 SYSTEM-INFO.ESY-VERSION (A008)
01601 SYSTEM-INFO.JOBVAR (A003)
01701 SYSTEM-INFO.LMS-VERSION (N03.0)
01801 SYSTEM-INFO.LOCAL-DATX (D)
01901 SYSTEM-INFO.LOCAL-TIMX (T)
02001 SYSTEM-INFO.LOGON-ID (A008)
02101 SYSTEM-INFO.MEMORY-SIZE (A008)
02201 SYSTEM-INFO.MODE (A008)
02301 SYSTEM-INFO.OPERATING-SYSTEM-ID (A008)
02401 SYSTEM-INFO.OPERATING-SYSTEM-TYPE (A004)
02501 SYSTEM-INFO.SECURITY (A004)
02601 SYSTEM-INFO.SYSTEM-BASE-ADDRESS (A008)
02701 SYSTEM-INFO.SYSTEM-RELEASE (A008)
02801 SYSTEM-INFO.SYSTEM-TYPE (A008)
0290END-DEFINE
0300FORMAT PS=021 LS=080 ZP=OFF SG=OFF KD=ON  IP=OFF
0310* MAP2: MAP PROFILES *****************************        410***********
0320* .TTAAAMMOO   D I D I N D I D I        ?_)¬&:+(                       *
0330* 023079        N0NNUCN             X        01 SYSPROF YL           1 *
0340************************************************************************
0350INPUT          (     IP=OFF                                           /*
0360                                                                       )
0370 002T ##TITLE  (AD=ODL ) /*.01D078 A078 .
0380/
0390/
0400 002T 'System Type .............'
0410 028T SYSTEM-INFO.SYSTEM-TYPE  (AD=ODL ) /*.01D008 A008 .
0420 050T 'Local Date .......'
0430 069T SYSTEM-INFO.LOCAL-DATX  (AD=ODL EM=YYYY-MM-DD ) /*.01D010 D    .
0440/
0450 002T 'System Release ..........'
0460 028T SYSTEM-INFO.SYSTEM-RELEASE  (AD=ODL ) /*.01D008 A008 .
0470 050T 'Local Time .......'
0480 069T SYSTEM-INFO.LOCAL-TIMX  (AD=ODL EM=HH:II:SS ) /*.01D008 T    .
0490/
0500 002T 'Mode'
0510 007T '.' (020)
0520 028T SYSTEM-INFO.MODE  (AD=ODL ) /*.01D008 A008 .
0530/
0540/
0550 002T 'Logon ID'
0560 011T '.' (016)
0570 028T SYSTEM-INFO.LOGON-ID  (AD=ODL ) /*.01D008 A008 .
0580/
0590 002T 'Security'
0600 011T '.' (016)
0610 028T SYSTEM-INFO.SECURITY  (AD=ODL ) /*.01D004 A004 .
0620/
0630 002T 'Auto Logon ..............'
0640 028T SYSTEM-INFO.AUTO-LOGON  (AD=ODL ) /*.01D003 A003 .
0650/
0660/
0670 002T 'NPR Version .............'
0680 028T SYSTEM-INFO.ESY-VERSION  (AD=ODL ) /*.01U008 A008 .
0690/
0700 002T 'LMS Version .............'
0710 028T SYSTEM-INFO.LMS-VERSION  (AD=ODL ) /*.01D003 N03.0.
0720/
0730/
0740 002T 'System Base Address .....'
0750 028T SYSTEM-INFO.SYSTEM-BASE-ADDRESS  (AD=ODL ) /*.01U008 A008 .
0760/
0770 002T 'Configuration Name ......'
0780 028T SYSTEM-INFO.CONFIGURATION-NAME  (AD=ODL ) /*.01U021 A021 .
0790/
0800 002T 'Memory Size .............'
0810 028T SYSTEM-INFO.MEMORY-SIZE  (AD=ODL ) /*.01D008 A008 .
0820/
0830/
0840 002T 'Operation System Type ...'
0850 028T SYSTEM-INFO.OPERATING-SYSTEM-TYPE  (AD=ODL ) /*.01D004 A004 .
0860/
0870 002T 'Operating System ID .....'
0880 028T SYSTEM-INFO.OPERATING-SYSTEM-ID  (AD=ODL ) /*.01D008 A008 .
0890/
0900/
0910 002T 'Jobvar'
0920 009T '.' (018)
0930 028T SYSTEM-INFO.JOBVAR  (AD=ODL ) /*.01D003 A003 .
0940* MAP2: VALIDATION *****************************************************
0950RULEVAR D01SYSTEM-INFO.SYSTEM-TYPE
0960* CDIR SYSTEM-INFO                      SYSTEM-TYPE                     ;
0970RULEVAR D01SYSTEM-INFO.LOCAL-DATX
0980* CDIR SYSTEM-INFO                      LOCAL-DATX                      ;
0990RULEVAR D01SYSTEM-INFO.SYSTEM-RELEASE
1000* CDIR SYSTEM-INFO                      SYSTEM-RELEASE                  ;
1010RULEVAR D01SYSTEM-INFO.LOCAL-TIMX
1020* CDIR SYSTEM-INFO                      LOCAL-TIMX                      ;
1030RULEVAR D01SYSTEM-INFO.MODE
1040* CDIR SYSTEM-INFO                      MODE                            ;
1050RULEVAR D01SYSTEM-INFO.LOGON-ID
1060* CDIR SYSTEM-INFO                      LOGON-ID                        ;
1070RULEVAR D01SYSTEM-INFO.SECURITY
1080* CDIR SYSTEM-INFO                      SECURITY                        ;
1090RULEVAR D01SYSTEM-INFO.AUTO-LOGON
1100* CDIR SYSTEM-INFO                      AUTO-LOGON                      ;
1110RULEVAR D01SYSTEM-INFO.ESY-VERSION
1120* CDIR SYSTEM-INFO                      NPR-VERSION                     ;
1130RULEVAR D01SYSTEM-INFO.LMS-VERSION
1140* CDIR SYSTEM-INFO                      LMS-VERSION                     ;
1150RULEVAR D01SYSTEM-INFO.SYSTEM-BASE-ADDRESS
1160* CDIR SYSTEM-INFO                      SYSTEM-BASE-ADDRESS             ;
1170RULEVAR D01SYSTEM-INFO.CONFIGURATION-NAME
1180* CDIR SYSTEM-INFO                      CONFIGURATION-NAME              ;
1190RULEVAR D01SYSTEM-INFO.MEMORY-SIZE
1200* CDIR SYSTEM-INFO                      MEMORY-SIZE                     ;
1210RULEVAR D01SYSTEM-INFO.OPERATING-SYSTEM-TYPE
1220* CDIR SYSTEM-INFO                      OPERATING-SYSTEM-TYPE           ;
1230RULEVAR D01SYSTEM-INFO.OPERATING-SYSTEM-ID
1240* CDIR SYSTEM-INFO                      OPERATING-SYSTEM-ID             ;
1250RULEVAR D01SYSTEM-INFO.JOBVAR
1260* CDIR SYSTEM-INFO                      JOBVAR                          ;
1270* MAP2: END OF MAP *****************************************************
1280END
