0010* MAP2: PROTOTYPE
0020* INPUT USING MAP 'XXXXXXXX'
0030*     ##TITLE #CMD(*) #RESULT(*)
0040DEFINE DATA PARAMETER
00501 ##TITLE (A078)
00601 #CMD (A078/00001:00010)
00701 #RESULT (A078/00001:00005)
0080END-DEFINE
0090FORMAT PS=021 LS=080 ZP=OFF SG=OFF KD=ON  IP=OFF
0100* MAP2: MAP PROFILES *****************************        410***********
0110* .TTAAAMMOO   D I D I N D I D I        ?_)¬&:+(                       *
0120* 023079        N0NNUCN             X        01 SYSPROF YL           1 *
0130************************************************************************
0140INPUT          (     IP=OFF                                           /*
0150                                                                       )
0160 002T ##TITLE  (AD=ODL ) /*.01D078 A078 .
0170/
0180/
0190 002T 'Kommando'
0200/
0210 002T #CMD (001)  (AD=MIT'_' CD=NE ) /*.99U078 A078 .
0220   /**A1000100000100001000010000100001100010001001000001000HV
0230/
0240 002T #CMD (002)  (AD=MIT'_' CD=NE ) /*.99U078 A078 .
0250/
0260 002T #CMD (003)  (AD=MIT'_' CD=NE ) /*.99U078 A078 .
0270/
0280 002T #CMD (004)  (AD=MIT'_' CD=NE ) /*.99U078 A078 .
0290/
0300 002T #CMD (005)  (AD=MIT'_' CD=NE ) /*.99U078 A078 .
0310/
0320 002T #CMD (006)  (AD=MIT'_' CD=NE ) /*.99U078 A078 .
0330/
0340 002T #CMD (007)  (AD=MIT'_' CD=NE ) /*.99U078 A078 .
0350/
0360 002T #CMD (008)  (AD=MIT'_' CD=NE ) /*.99U078 A078 .
0370/
0380 002T #CMD (009)  (AD=MIT'_' CD=NE ) /*.99U078 A078 .
0390/
0400 002T #CMD (010)  (AD=MIT'_' CD=NE ) /*.99U078 A078 .
0410/
0420/
0430 002T 'Ergebnis'
0440/
0450 002T #RESULT (001)  (AD=OD CD=NE ) /*.01U078 A078 .
0460   /**A1000050000100001000010000100001100005001001000001000HV
0470/
0480 002T #RESULT (002)  (AD=OD CD=NE ) /*.01U078 A078 .
0490/
0500 002T #RESULT (003)  (AD=OD CD=NE ) /*.01U078 A078 .
0510/
0520 002T #RESULT (004)  (AD=OD CD=NE ) /*.01U078 A078 .
0530/
0540 002T #RESULT (005)  (AD=OD CD=NE ) /*.01U078 A078 .
0550/
0560* MAP2: VALIDATION *****************************************************
0570* MAP2: END OF MAP *****************************************************
0580END
