0010* MAP2: PROTOTYPE
0020* INPUT USING MAP 'XXXXXXXX'
0030*     ##TITLE #CVAR #DISPLAY.#LOGON-TIME(*) #DISPLAY.JOB-ID(*)
0040*     #DISPLAY.JOB-NAME(*) #DISPLAY.LAST-COMMAND(*)
0050*     #DISPLAY.LOADED-PROGRAM(*) #DISPLAY.LOGON-DATX(*)
0060*     #DISPLAY.TYPE-NUMBER(*) #DISPLAY.USER(*) #JOB-NAME #USER
0070DEFINE DATA PARAMETER
00801 ##TITLE (A078)
00901  #CVAR (C)
01001 #DISPLAY.#LOGON-TIME (A005/00001:00015)
01101 #DISPLAY.JOB-ID (A005/00001:00015)
01201 #DISPLAY.JOB-NAME (A008/    1:00015)
01301 #DISPLAY.LAST-COMMAND (A012/00001:00015)
01401 #DISPLAY.LOADED-PROGRAM (A020/00001:00015)
01501 #DISPLAY.LOGON-DATX (D/00001:00015)
01601 #DISPLAY.TYPE-NUMBER (N01.0/00001:00015)
01701 #DISPLAY.USER (A008/00001:00015)
01801 #JOB-NAME (A008)
01901 #USER (A008)
0200END-DEFINE
0210FORMAT PS=021 LS=080 ZP=OFF SG=OFF KD=ON  IP=OFF
0220* MAP2: MAP PROFILES *****************************        410***********
0230* .TTAAAMMOO   D I D I N D I D I        ?_)¬&:+(                       *
0240* 023079        N0NNUCN             X        01 SYSPROF YL   #CVAR   1 *
0250************************************************************************
0260INPUT          (     CV=#CVAR                                         /*
0270                                                                       )
0280 002T ##TITLE  (AD=ODL ) /*.01D078 A078 .
0290/
0300/
0310 002T 'UserID'
0320 011T 'Job-Name TSN'
0330 026T 'T Command'
0340 041T 'Program'
0350 064T 'Logon Date/Time'
0360/
0370 002T #USER  (AD=MYLT'_' CV=#CVAR ) /*.99D008 A008 .
0380 011T #JOB-NAME  (AD=MYLT'_' CV=#CVAR ) /*.99D008 A008 .
0390 020T '_____ _ ____________'
0400 041T '_' (020)
0410 064T '_' (016)
0420/
0430 002T #DISPLAY.USER (1+000)  (AD=ODL ) /*.01D008 A008 .
0440   /* A1000150000100001000010000100001100015001000001H
0450 011T #DISPLAY.JOB-NAME (1+000)  (AD=ODL ) /*.01D008 A008 .
0460   /* A1000150000100001    10000100001100015001000001H
0470 020T #DISPLAY.JOB-ID (1+000)  (AD=ODL ) /*.01D005 A005 .
0480   /* A1000150000100001000010000100001100015001000001H
0490 026T #DISPLAY.TYPE-NUMBER (1+000)  (AD=ODL ) /*.01D001 N01.0.
0500   /* A1000150000100001000010000100001100015001000001H
0510 028T #DISPLAY.LAST-COMMAND (1+000)  (AD=ODL ) /*.01D012 A012 .
0520   /* A1000150000100001000010000100001100015001000001H
0530 041T #DISPLAY.LOADED-PROGRAM (1+000)  (AD=ODL ) /*.01U020 A020 .
0540   /* A1000150000100001    10000100001100015001000001H
0550 064T #DISPLAY.LOGON-DATX (001)  (AD=ODL EM=YYYY-MM-DD ) /*.01D010 D    .
0560   /**A1000150000100001000010000100001100015001001000001000HV
0570 075T #DISPLAY.#LOGON-TIME (001)  (AD=ODL ) /*.01D005 A005 .
0580   /**A1000150000100001000010000100001100015001001000001000HV
0590/
0600 002T #DISPLAY.USER (1+001)  (AD=ODL ) /*.01D008 A008 .
0610 011T #DISPLAY.JOB-NAME (1+001)  (AD=ODL ) /*.01D008 A008 .
0620 020T #DISPLAY.JOB-ID (1+001)  (AD=ODL ) /*.01D005 A005 .
0630 026T #DISPLAY.TYPE-NUMBER (1+001)  (AD=ODL ) /*.01D001 N01.0.
0640 028T #DISPLAY.LAST-COMMAND (1+001)  (AD=ODL ) /*.01D012 A012 .
0650 041T #DISPLAY.LOADED-PROGRAM (1+001)  (AD=ODL ) /*.01U020 A020 .
0660 064T #DISPLAY.LOGON-DATX (002)  (AD=ODL EM=YYYY-MM-DD ) /*.01D010 D    .
0670 075T #DISPLAY.#LOGON-TIME (002)  (AD=ODL ) /*.01D005 A005 .
0680/
0690 002T #DISPLAY.USER (1+002)  (AD=ODL ) /*.01D008 A008 .
0700 011T #DISPLAY.JOB-NAME (1+002)  (AD=ODL ) /*.01D008 A008 .
0710 020T #DISPLAY.JOB-ID (1+002)  (AD=ODL ) /*.01D005 A005 .
0720 026T #DISPLAY.TYPE-NUMBER (1+002)  (AD=ODL ) /*.01D001 N01.0.
0730 028T #DISPLAY.LAST-COMMAND (1+002)  (AD=ODL ) /*.01D012 A012 .
0740 041T #DISPLAY.LOADED-PROGRAM (1+002)  (AD=ODL ) /*.01U020 A020 .
0750 064T #DISPLAY.LOGON-DATX (003)  (AD=ODL EM=YYYY-MM-DD ) /*.01D010 D    .
0760 075T #DISPLAY.#LOGON-TIME (003)  (AD=ODL ) /*.01D005 A005 .
0770/
0780 002T #DISPLAY.USER (1+003)  (AD=ODL ) /*.01D008 A008 .
0790 011T #DISPLAY.JOB-NAME (1+003)  (AD=ODL ) /*.01D008 A008 .
0800 020T #DISPLAY.JOB-ID (1+003)  (AD=ODL ) /*.01D005 A005 .
0810 026T #DISPLAY.TYPE-NUMBER (1+003)  (AD=ODL ) /*.01D001 N01.0.
0820 028T #DISPLAY.LAST-COMMAND (1+003)  (AD=ODL ) /*.01D012 A012 .
0830 041T #DISPLAY.LOADED-PROGRAM (1+003)  (AD=ODL ) /*.01U020 A020 .
0840 064T #DISPLAY.LOGON-DATX (004)  (AD=ODL EM=YYYY-MM-DD ) /*.01D010 D    .
0850 075T #DISPLAY.#LOGON-TIME (004)  (AD=ODL ) /*.01D005 A005 .
0860/
0870 002T #DISPLAY.USER (1+004)  (AD=ODL ) /*.01D008 A008 .
0880 011T #DISPLAY.JOB-NAME (1+004)  (AD=ODL ) /*.01D008 A008 .
0890 020T #DISPLAY.JOB-ID (1+004)  (AD=ODL ) /*.01D005 A005 .
0900 026T #DISPLAY.TYPE-NUMBER (1+004)  (AD=ODL ) /*.01D001 N01.0.
0910 028T #DISPLAY.LAST-COMMAND (1+004)  (AD=ODL ) /*.01D012 A012 .
0920 041T #DISPLAY.LOADED-PROGRAM (1+004)  (AD=ODL ) /*.01U020 A020 .
0930 064T #DISPLAY.LOGON-DATX (005)  (AD=ODL EM=YYYY-MM-DD ) /*.01D010 D    .
0940 075T #DISPLAY.#LOGON-TIME (005)  (AD=ODL ) /*.01D005 A005 .
0950/
0960 002T #DISPLAY.USER (1+005)  (AD=ODL ) /*.01D008 A008 .
0970 011T #DISPLAY.JOB-NAME (1+005)  (AD=ODL ) /*.01D008 A008 .
0980 020T #DISPLAY.JOB-ID (1+005)  (AD=ODL ) /*.01D005 A005 .
0990 026T #DISPLAY.TYPE-NUMBER (1+005)  (AD=ODL ) /*.01D001 N01.0.
1000 028T #DISPLAY.LAST-COMMAND (1+005)  (AD=ODL ) /*.01D012 A012 .
1010 041T #DISPLAY.LOADED-PROGRAM (1+005)  (AD=ODL ) /*.01U020 A020 .
1020 064T #DISPLAY.LOGON-DATX (006)  (AD=ODL EM=YYYY-MM-DD ) /*.01D010 D    .
1030 075T #DISPLAY.#LOGON-TIME (006)  (AD=ODL ) /*.01D005 A005 .
1040/
1050 002T #DISPLAY.USER (1+006)  (AD=ODL ) /*.01D008 A008 .
1060 011T #DISPLAY.JOB-NAME (1+006)  (AD=ODL ) /*.01D008 A008 .
1070 020T #DISPLAY.JOB-ID (1+006)  (AD=ODL ) /*.01D005 A005 .
1080 026T #DISPLAY.TYPE-NUMBER (1+006)  (AD=ODL ) /*.01D001 N01.0.
1090 028T #DISPLAY.LAST-COMMAND (1+006)  (AD=ODL ) /*.01D012 A012 .
1100 041T #DISPLAY.LOADED-PROGRAM (1+006)  (AD=ODL ) /*.01U020 A020 .
1110 064T #DISPLAY.LOGON-DATX (007)  (AD=ODL EM=YYYY-MM-DD ) /*.01D010 D    .
1120 075T #DISPLAY.#LOGON-TIME (007)  (AD=ODL ) /*.01D005 A005 .
1130/
1140 002T #DISPLAY.USER (1+007)  (AD=ODL ) /*.01D008 A008 .
1150 011T #DISPLAY.JOB-NAME (1+007)  (AD=ODL ) /*.01D008 A008 .
1160 020T #DISPLAY.JOB-ID (1+007)  (AD=ODL ) /*.01D005 A005 .
1170 026T #DISPLAY.TYPE-NUMBER (1+007)  (AD=ODL ) /*.01D001 N01.0.
1180 028T #DISPLAY.LAST-COMMAND (1+007)  (AD=ODL ) /*.01D012 A012 .
1190 041T #DISPLAY.LOADED-PROGRAM (1+007)  (AD=ODL ) /*.01U020 A020 .
1200 064T #DISPLAY.LOGON-DATX (008)  (AD=ODL EM=YYYY-MM-DD ) /*.01D010 D    .
1210 075T #DISPLAY.#LOGON-TIME (008)  (AD=ODL ) /*.01D005 A005 .
1220/
1230 002T #DISPLAY.USER (1+008)  (AD=ODL ) /*.01D008 A008 .
1240 011T #DISPLAY.JOB-NAME (1+008)  (AD=ODL ) /*.01D008 A008 .
1250 020T #DISPLAY.JOB-ID (1+008)  (AD=ODL ) /*.01D005 A005 .
1260 026T #DISPLAY.TYPE-NUMBER (1+008)  (AD=ODL ) /*.01D001 N01.0.
1270 028T #DISPLAY.LAST-COMMAND (1+008)  (AD=ODL ) /*.01D012 A012 .
1280 041T #DISPLAY.LOADED-PROGRAM (1+008)  (AD=ODL ) /*.01U020 A020 .
1290 064T #DISPLAY.LOGON-DATX (009)  (AD=ODL EM=YYYY-MM-DD ) /*.01D010 D    .
1300 075T #DISPLAY.#LOGON-TIME (009)  (AD=ODL ) /*.01D005 A005 .
1310/
1320 002T #DISPLAY.USER (1+009)  (AD=ODL ) /*.01D008 A008 .
1330 011T #DISPLAY.JOB-NAME (1+009)  (AD=ODL ) /*.01D008 A008 .
1340 020T #DISPLAY.JOB-ID (1+009)  (AD=ODL ) /*.01D005 A005 .
1350 026T #DISPLAY.TYPE-NUMBER (1+009)  (AD=ODL ) /*.01D001 N01.0.
1360 028T #DISPLAY.LAST-COMMAND (1+009)  (AD=ODL ) /*.01D012 A012 .
1370 041T #DISPLAY.LOADED-PROGRAM (1+009)  (AD=ODL ) /*.01U020 A020 .
1380 064T #DISPLAY.LOGON-DATX (010)  (AD=ODL EM=YYYY-MM-DD ) /*.01D010 D    .
1390 075T #DISPLAY.#LOGON-TIME (010)  (AD=ODL ) /*.01D005 A005 .
1400/
1410 002T #DISPLAY.USER (1+010)  (AD=ODL ) /*.01D008 A008 .
1420 011T #DISPLAY.JOB-NAME (1+010)  (AD=ODL ) /*.01D008 A008 .
1430 020T #DISPLAY.JOB-ID (1+010)  (AD=ODL ) /*.01D005 A005 .
1440 026T #DISPLAY.TYPE-NUMBER (1+010)  (AD=ODL ) /*.01D001 N01.0.
1450 028T #DISPLAY.LAST-COMMAND (1+010)  (AD=ODL ) /*.01D012 A012 .
1460 041T #DISPLAY.LOADED-PROGRAM (1+010)  (AD=ODL ) /*.01U020 A020 .
1470 064T #DISPLAY.LOGON-DATX (011)  (AD=ODL EM=YYYY-MM-DD ) /*.01D010 D    .
1480 075T #DISPLAY.#LOGON-TIME (011)  (AD=ODL ) /*.01D005 A005 .
1490/
1500 002T #DISPLAY.USER (1+011)  (AD=ODL ) /*.01D008 A008 .
1510 011T #DISPLAY.JOB-NAME (1+011)  (AD=ODL ) /*.01D008 A008 .
1520 020T #DISPLAY.JOB-ID (1+011)  (AD=ODL ) /*.01D005 A005 .
1530 026T #DISPLAY.TYPE-NUMBER (1+011)  (AD=ODL ) /*.01D001 N01.0.
1540 028T #DISPLAY.LAST-COMMAND (1+011)  (AD=ODL ) /*.01D012 A012 .
1550 041T #DISPLAY.LOADED-PROGRAM (1+011)  (AD=ODL ) /*.01U020 A020 .
1560 064T #DISPLAY.LOGON-DATX (012)  (AD=ODL EM=YYYY-MM-DD ) /*.01D010 D    .
1570 075T #DISPLAY.#LOGON-TIME (012)  (AD=ODL ) /*.01D005 A005 .
1580/
1590 002T #DISPLAY.USER (1+012)  (AD=ODL ) /*.01D008 A008 .
1600 011T #DISPLAY.JOB-NAME (1+012)  (AD=ODL ) /*.01D008 A008 .
1610 020T #DISPLAY.JOB-ID (1+012)  (AD=ODL ) /*.01D005 A005 .
1620 026T #DISPLAY.TYPE-NUMBER (1+012)  (AD=ODL ) /*.01D001 N01.0.
1630 028T #DISPLAY.LAST-COMMAND (1+012)  (AD=ODL ) /*.01D012 A012 .
1640 041T #DISPLAY.LOADED-PROGRAM (1+012)  (AD=ODL ) /*.01U020 A020 .
1650 064T #DISPLAY.LOGON-DATX (013)  (AD=ODL EM=YYYY-MM-DD ) /*.01D010 D    .
1660 075T #DISPLAY.#LOGON-TIME (013)  (AD=ODL ) /*.01D005 A005 .
1670/
1680 002T #DISPLAY.USER (1+013)  (AD=ODL ) /*.01D008 A008 .
1690 011T #DISPLAY.JOB-NAME (1+013)  (AD=ODL ) /*.01D008 A008 .
1700 020T #DISPLAY.JOB-ID (1+013)  (AD=ODL ) /*.01D005 A005 .
1710 026T #DISPLAY.TYPE-NUMBER (1+013)  (AD=ODL ) /*.01D001 N01.0.
1720 028T #DISPLAY.LAST-COMMAND (1+013)  (AD=ODL ) /*.01D012 A012 .
1730 041T #DISPLAY.LOADED-PROGRAM (1+013)  (AD=ODL ) /*.01U020 A020 .
1740 064T #DISPLAY.LOGON-DATX (014)  (AD=ODL EM=YYYY-MM-DD ) /*.01D010 D    .
1750 075T #DISPLAY.#LOGON-TIME (014)  (AD=ODL ) /*.01D005 A005 .
1760/
1770 002T #DISPLAY.USER (1+014)  (AD=ODL ) /*.01D008 A008 .
1780 011T #DISPLAY.JOB-NAME (1+014)  (AD=ODL ) /*.01D008 A008 .
1790 020T #DISPLAY.JOB-ID (1+014)  (AD=ODL ) /*.01D005 A005 .
1800 026T #DISPLAY.TYPE-NUMBER (1+014)  (AD=ODL ) /*.01D001 N01.0.
1810 028T #DISPLAY.LAST-COMMAND (1+014)  (AD=ODL ) /*.01D012 A012 .
1820 041T #DISPLAY.LOADED-PROGRAM (1+014)  (AD=ODL ) /*.01U020 A020 .
1830 064T #DISPLAY.LOGON-DATX (015)  (AD=ODL EM=YYYY-MM-DD ) /*.01D010 D    .
1840 075T #DISPLAY.#LOGON-TIME (015)  (AD=ODL ) /*.01D005 A005 .
1850/
1860/
1870* MAP2: VALIDATION *****************************************************
1880* MAP2: END OF MAP *****************************************************
1890END
