0010* MAP2: PROTOTYPE
0020* INPUT USING MAP 'XXXXXXXX'
0030*     ##TITLE #FUNCTION #USER-ID #USERID-PUBSET
0040*     USER-ATTRIBUTES.ACCOUNT-NUMBER USER-ATTRIBUTES.AUDIT
0050*     USER-ATTRIBUTES.CLASS USER-ATTRIBUTES.COMMANDS-FILE-NAME
0060*     USER-ATTRIBUTES.DEFAULT-PUBSET USER-ATTRIBUTES.ENFORCE
0070*     USER-ATTRIBUTES.EXPRESS USER-ATTRIBUTES.INHIBIT-DEACTIVATION
0080*     USER-ATTRIBUTES.MAIL-ADDRESS USER-ATTRIBUTES.MAX-ACC-REC
0090*     USER-ATTRIBUTES.MAX-CPU-TIME USER-ATTRIBUTES.MAX-INPUT-CARDS
0100*     USER-ATTRIBUTES.MAX-OUTPUT-LINES USER-ATTRIBUTES.NO-TIME-LIMIT
0110*     USER-ATTRIBUTES.PASSWORD USER-ATTRIBUTES.PASSWORD-MODS
0120*     USER-ATTRIBUTES.PRIORITY USER-ATTRIBUTES.PUBLIC-SPACE
0130*     USER-ATTRIBUTES.RESIDENT-PAGES USER-ATTRIBUTES.SEVER
0140*     USER-ATTRIBUTES.TEST-PRIVILEGE USER-ATTRIBUTES.TP-IGNORE
0150*     USER-ATTRIBUTES.TTYPL USER-ATTRIBUTES.USER-ADDRESS-SPACE
0160*     USER-ATTRIBUTES.USER-PRIVILEGE
0170DEFINE DATA PARAMETER
01801 ##TITLE (A078)
01901 #FUNCTION (A008)
02001 #USER-ID (A008)
02101 #USERID-PUBSET (A004)
02201 USER-ATTRIBUTES.ACCOUNT-NUMBER (A008)
02301 USER-ATTRIBUTES.AUDIT (A003)
02401 USER-ATTRIBUTES.CLASS (N03.0)
02501 USER-ATTRIBUTES.COMMANDS-FILE-NAME (A054)
02601 USER-ATTRIBUTES.DEFAULT-PUBSET (A004)
02701 USER-ATTRIBUTES.ENFORCE (A003)
02801 USER-ATTRIBUTES.EXPRESS (A003)
02901 USER-ATTRIBUTES.INHIBIT-DEACTIVATION (A003)
03001 USER-ATTRIBUTES.MAIL-ADDRESS (A064)
03101 USER-ATTRIBUTES.MAX-ACC-REC (A005)
03201 USER-ATTRIBUTES.MAX-CPU-TIME (N05.0)
03301 USER-ATTRIBUTES.MAX-INPUT-CARDS (A008)
03401 USER-ATTRIBUTES.MAX-OUTPUT-LINES (A008)
03501 USER-ATTRIBUTES.NO-TIME-LIMIT (A003)
03601 USER-ATTRIBUTES.PASSWORD (A008)
03701 USER-ATTRIBUTES.PASSWORD-MODS (A003)
03801 USER-ATTRIBUTES.PRIORITY (N03.0)
03901 USER-ATTRIBUTES.PUBLIC-SPACE (N08.0)
04001 USER-ATTRIBUTES.RESIDENT-PAGES (N05.0)
04101 USER-ATTRIBUTES.SEVER (A003)
04201 USER-ATTRIBUTES.TEST-PRIVILEGE (A003)
04301 USER-ATTRIBUTES.TP-IGNORE (A004)
04401 USER-ATTRIBUTES.TTYPL (A003)
04501 USER-ATTRIBUTES.USER-ADDRESS-SPACE (N05.0)
04601 USER-ATTRIBUTES.USER-PRIVILEGE (A004)
0470END-DEFINE
0480FORMAT PS=021 LS=080 ZP=OFF SG=OFF KD=ON  IP=OFF
0490* MAP2: MAP PROFILES *****************************        410***********
0500* .TTAAAMMOO   D I D I N D I D I        ?_)¬&:+(                       *
0510* 023079        N0NNUCN             X        01 SYSPROF YL           1 *
0520************************************************************************
0530INPUT          (     IP=OFF                                           /*
0540                                                                       )
0550 002T ##TITLE  (AD=ODL ) /*.01D078 A078 .
0560/
0570/
0580 002T 'Function .......'
0590 019T #FUNCTION  (AD=MILT'_' CD=NE ) /*.99U008 A008 .
0600 031T '(READ/READNXT)'
0610/
0620 002T 'User-ID ........'
0630 019T #USER-ID  (AD=MILT'_' CD=NE ) /*.99U008 A008 .
0640 031T '(TSOS only)'
0650/
0660 002T 'User ID Pubset .'
0670 019T #USERID-PUBSET  (AD=MILT'_' CD=NE ) /*.99U004 A004 .
0680/
0690/
0700 002T 'Sever ..........'
0710 019T USER-ATTRIBUTES.SEVER  (AD=ODL ) /*.01D003 A003 .
0720/
0730 002T 'Password .......'
0740 019T USER-ATTRIBUTES.PASSWORD  (AD=ODL ) /*.01D008 A008 .
0750 028T 'hex ....'
0760 037T USER-ATTRIBUTES.PASSWORD  (AD=ODL EM=H(9) ) /*.02D016 A008 .
0770 054T 'Mods allowed ..'
0780 070T USER-ATTRIBUTES.PASSWORD-MODS  (AD=ODL ) /*.01D003 A003 .
0790/
0800 002T 'Max Acc Records.'
0810 019T USER-ATTRIBUTES.MAX-ACC-REC  (AD=ODL ) /*.01D005 A005 .
0820/
0830 002T 'Public Space ...'
0840 019T USER-ATTRIBUTES.PUBLIC-SPACE  (AD=ODL ) /*.01D008 N08.0.
0850 028T 'Resident Pages ....'
0860 048T USER-ATTRIBUTES.RESIDENT-PAGES  (AD=ODL ) /*.01D005 N05.0.
0870 054T 'User Adr Space.'
0880 070T USER-ATTRIBUTES.USER-ADDRESS-SPACE  (AD=ODL ) /*.01U005 N05.0.
0890/
0900 002T 'Enforce ........'
0910 019T USER-ATTRIBUTES.ENFORCE  (AD=ODL ) /*.01D003 A003 .
0920 028T 'Audit ...............'
0930 050T USER-ATTRIBUTES.AUDIT  (AD=ODL ) /*.01D003 A003 .
0940 054T 'Tape ignore ...'
0950 070T USER-ATTRIBUTES.TP-IGNORE  (AD=ODL ) /*.01D004 A004 .
0960/
0970 002T 'Default Pubset .'
0980 019T USER-ATTRIBUTES.DEFAULT-PUBSET  (AD=ODL ) /*.01U004 A004 .
0990 028T 'Test Privilege ......'
1000 050T USER-ATTRIBUTES.TEST-PRIVILEGE  (AD=ODL ) /*.01D003 A003 .
1010/
1020 002T 'Command File ...'
1030 019T USER-ATTRIBUTES.COMMANDS-FILE-NAME  (AD=ODL ) /*.01D054 A054 .
1040/
1050 002T 'Mail Address ...'
1060 019T USER-ATTRIBUTES.MAIL-ADDRESS  (AD=ODL AL=060  ) /*.01D060 A064 .
1070/
1080 002T 'Account Number .'
1090 019T USER-ATTRIBUTES.ACCOUNT-NUMBER  (AD=ODL ) /*.01D008 A008 .
1100 028T 'Max CPU Time ......'
1110 048T USER-ATTRIBUTES.MAX-CPU-TIME  (AD=ODL ) /*.01D005 N05.0.
1120 054T 'No Time limit..'
1130 070T USER-ATTRIBUTES.NO-TIME-LIMIT  (AD=ODL ) /*.01D003 A003 .
1140/
1150 002T 'Express ........'
1160 019T USER-ATTRIBUTES.EXPRESS  (AD=ODL ) /*.01D003 A003 .
1170 028T 'Priority ............'
1180 050T USER-ATTRIBUTES.PRIORITY  (AD=ODL ) /*.01D003 N03.0.
1190 054T 'TTYPL .........'
1200 070T USER-ATTRIBUTES.TTYPL  (AD=ODL ) /*.01D003 A003 .
1210/
1220 002T 'Inhibit Decat ..'
1230 019T USER-ATTRIBUTES.INHIBIT-DEACTIVATION  (AD=ODL ) /*.01D003 A003 .
1240 028T 'Class ...............'
1250 050T USER-ATTRIBUTES.CLASS  (AD=ODL ) /*.01D003 N03.0.
1260 054T 'User Privilege.'
1270 070T USER-ATTRIBUTES.USER-PRIVILEGE  (AD=ODL ) /*.01D004 A004 .
1280/
1290 002T 'Max out lines ..'
1300 019T USER-ATTRIBUTES.MAX-OUTPUT-LINES  (AD=ODL ) /*.01D008 A008 .
1310 028T 'Max input cards.'
1320 045T USER-ATTRIBUTES.MAX-INPUT-CARDS  (AD=ODL ) /*.01D008 A008 .
1330/
1340/
1350/
1360* MAP2: VALIDATION *****************************************************
1370RULEVAR D01#FUNCTION
1380INCDIR USER-ATTRIBUTES                  ACTION                          ;
1390RULEVAR D01USER-ATTRIBUTES.SEVER
1400* CDIR USER-ATTRIBUTES                  SEVER                           ;
1410RULEVAR D01USER-ATTRIBUTES.PASSWORD
1420* CDIR USER-ATTRIBUTES                  PASSWORD                        ;
1430RULEVAR D01USER-ATTRIBUTES.PASSWORD-MODS
1440* CDIR USER-ATTRIBUTES                  PASSWORD-MODS                   ;
1450RULEVAR D01USER-ATTRIBUTES.MAX-ACC-REC
1460* CDIR USER-ATTRIBUTES                  MAX-ACC-REC                     ;
1470RULEVAR D01USER-ATTRIBUTES.PUBLIC-SPACE
1480* CDIR USER-ATTRIBUTES                  PUBLIC-SPACE                    ;
1490RULEVAR D01USER-ATTRIBUTES.RESIDENT-PAGES
1500* CDIR USER-ATTRIBUTES                  RESIDENT-PAGES                  ;
1510RULEVAR D01USER-ATTRIBUTES.USER-ADDRESS-SPACE
1520* CDIR USER-ATTRIBUTES                  MAX-ADDRESS-SPACE               ;
1530RULEVAR D01USER-ATTRIBUTES.ENFORCE
1540* CDIR USER-ATTRIBUTES                  ENFORCE                         ;
1550RULEVAR D01USER-ATTRIBUTES.AUDIT
1560* CDIR USER-ATTRIBUTES                  AUDIT                           ;
1570RULEVAR D01USER-ATTRIBUTES.TP-IGNORE
1580* CDIR USER-ATTRIBUTES                  TP-IGNORE                       ;
1590RULEVAR D01USER-ATTRIBUTES.DEFAULT-PUBSET
1600* CDIR USER-ATTRIBUTES                  DEFAULT-PUBSET                  ;
1610RULEVAR D01USER-ATTRIBUTES.TEST-PRIVILEGE
1620* CDIR USER-ATTRIBUTES                  TEST-PRIVILEGE                  ;
1630RULEVAR D01USER-ATTRIBUTES.COMMANDS-FILE-NAME
1640* CDIR USER-ATTRIBUTES                  COMMANDS-FILE-NAME              ;
1650RULEVAR D01USER-ATTRIBUTES.MAIL-ADDRESS
1660* CDIR USER-ATTRIBUTES                  MAIL-ADDRESS                    ;
1670RULEVAR D01USER-ATTRIBUTES.ACCOUNT-NUMBER
1680* CDIR USER-ATTRIBUTES                  ACCOUNT-NUMBER                  ;
1690RULEVAR D01USER-ATTRIBUTES.MAX-CPU-TIME
1700* CDIR USER-ATTRIBUTES                  MAX-CPU-TIME                    ;
1710RULEVAR D01USER-ATTRIBUTES.NO-TIME-LIMIT
1720* CDIR USER-ATTRIBUTES                  NO-TIME-LIMIT                   ;
1730RULEVAR D01USER-ATTRIBUTES.EXPRESS
1740* CDIR USER-ATTRIBUTES                  EXPRESS                         ;
1750RULEVAR D01USER-ATTRIBUTES.PRIORITY
1760* CDIR USER-ATTRIBUTES                  PRIORITY                        ;
1770RULEVAR D01USER-ATTRIBUTES.TTYPL
1780* CDIR USER-ATTRIBUTES                  TTYPL                           ;
1790RULEVAR D01USER-ATTRIBUTES.INHIBIT-DEACTIVATION
1800* CDIR USER-ATTRIBUTES                  INHIBIT-DEACTIVATION            ;
1810RULEVAR D01USER-ATTRIBUTES.CLASS
1820* CDIR USER-ATTRIBUTES                  CLASS                           ;
1830RULEVAR D01USER-ATTRIBUTES.USER-PRIVILEGE
1840* CDIR USER-ATTRIBUTES                  USER-PRIVILEGE                  ;
1850RULEVAR D01USER-ATTRIBUTES.MAX-OUTPUT-LINES
1860* CDIR USER-ATTRIBUTES                  MAX-OUTPUT-LINES                ;
1870RULEVAR D01USER-ATTRIBUTES.MAX-INPUT-CARDS
1880* CDIR USER-ATTRIBUTES                  MAX-INPUT-CARDS                 ;
1890* MAP2: END OF MAP *****************************************************
1900END
