0010*
0020* Display User Attributes
0030*
0040DEFINE DATA GLOBAL USING TUTO
0050            LOCAL  USING BUSATT-L
0060            LOCAL
007001  #USER-ID          (A8)
008001  #USERID-PUBSET    (A4)
009001  #FUNCTION         (A8)      INIT <'READ'>
0100END-DEFINE
0110PERFORM PF-KEY
0120*
0130* ------------------------------ MAIN LOOP ----------------------------
0140*
0150REPEAT
0160PERFORM SCREEN-IO
0170FND.
0180FIND USER-ATTRIBUTES
0190     WITH NODE             =  ##NODE
0200      AND  USER-ID         =  #USER-ID
0210      AND  USERID-PUBSET   =  #USERID-PUBSET
0220                     AND  FUNCTION        =  #FUNCTION
0230*
0240  IF ERROR-CODE NE 0 OR SYSTEM-CODE NE 0
0250     INCLUDE BERR---C
0260     ESCAPE BOTTOM (FND.)
0270*
0280  END-IF
0290END-FIND
0300END-REPEAT
0310*
0320* ------------------------------ SCREEN-IO ----------------------------
0330*
0340DEFINE SUBROUTINE SCREEN-IO
0350INPUT WITH TEXT *##MSG-NR,
0360                 ##MSG-TXT1,
0370                 ##MSG-TXT2
0380      USING MAP 'BUSERA-&'
0390RESET ##MSG
0400END-SUBROUTINE
0410*
0420* ------------------------------ PF-KEY -------------------------------
0430*
0440INCLUDE C-PFKEY
0450END
