0010* MAP2: PROTOTYPE
0020* INPUT USING MAP 'XXXXXXXX'
0030*     ##TITLE #CVAR #DISPLAY.DSNAME(*) #DISPLAY.FILE-SIZE(*) #DSNAME
0040*     #FILE-SIZE #VOLSER
0050DEFINE DATA PARAMETER
00601 ##TITLE (A078)
00701  #CVAR (C)
00801 #DISPLAY.DSNAME (A054/    1:00015)
00901 #DISPLAY.FILE-SIZE (N07.0/00001:00015)
01001 #DSNAME (A054)
01101 #FILE-SIZE (N07.0)
01201 #VOLSER (A006)
0130END-DEFINE
0140FORMAT PS=021 LS=080 ZP=OFF SG=OFF KD=ON  IP=OFF
0150* MAP2: MAP PROFILES *****************************        410***********
0160* .TTAAAMMOO   D I D I N D I D I        ?_)¬&:+(                       *
0170* 023079        N0NNUCN             X        01 SYSPROF YL   #CVAR   1 *
0180************************************************************************
0190INPUT          (     CV=#CVAR                                         /*
0200                                                                       )
0210 002T ##TITLE  (AD=ODL ) /*.01D078 A078 .
0220/
0230/
0240 003T 'Volser'
0250 012T 'Datei'
0260 067T 'PamSeiten'
0270/
0280 003T #VOLSER  (AD=MYT'_' CD=NE CV=#CVAR ) /*.99U006 A006 .
0290 012T #DSNAME  (AD=MYLT'_' CD=NE CV=#CVAR ) /*.99D054 A054 .
0300 068T #FILE-SIZE  (AD=MYR'_' CV=#CVAR ) /*.99U007 N07.0.
0310/
0320 012T #DISPLAY.DSNAME (1+000)  (AD=ODL ) /*.01D054 A054 .
0330   /* A1000150000100001    10000100001100015001000001H
0340 068T #DISPLAY.FILE-SIZE (1+000)  (AD=ODR ) /*.01U007 N07.0.
0350   /* A1000150000100001    10000100001100015001000001H
0360/
0370 012T #DISPLAY.DSNAME (1+001)  (AD=ODL ) /*.01D054 A054 .
0380 068T #DISPLAY.FILE-SIZE (1+001)  (AD=ODR ) /*.01U007 N07.0.
0390/
0400 012T #DISPLAY.DSNAME (1+002)  (AD=ODL ) /*.01D054 A054 .
0410 068T #DISPLAY.FILE-SIZE (1+002)  (AD=ODR ) /*.01U007 N07.0.
0420/
0430 012T #DISPLAY.DSNAME (1+003)  (AD=ODL ) /*.01D054 A054 .
0440 068T #DISPLAY.FILE-SIZE (1+003)  (AD=ODR ) /*.01U007 N07.0.
0450/
0460 012T #DISPLAY.DSNAME (1+004)  (AD=ODL ) /*.01D054 A054 .
0470 068T #DISPLAY.FILE-SIZE (1+004)  (AD=ODR ) /*.01U007 N07.0.
0480/
0490 012T #DISPLAY.DSNAME (1+005)  (AD=ODL ) /*.01D054 A054 .
0500 068T #DISPLAY.FILE-SIZE (1+005)  (AD=ODR ) /*.01U007 N07.0.
0510/
0520 012T #DISPLAY.DSNAME (1+006)  (AD=ODL ) /*.01D054 A054 .
0530 068T #DISPLAY.FILE-SIZE (1+006)  (AD=ODR ) /*.01U007 N07.0.
0540/
0550 012T #DISPLAY.DSNAME (1+007)  (AD=ODL ) /*.01D054 A054 .
0560 068T #DISPLAY.FILE-SIZE (1+007)  (AD=ODR ) /*.01U007 N07.0.
0570/
0580 012T #DISPLAY.DSNAME (1+008)  (AD=ODL ) /*.01D054 A054 .
0590 068T #DISPLAY.FILE-SIZE (1+008)  (AD=ODR ) /*.01U007 N07.0.
0600/
0610 012T #DISPLAY.DSNAME (1+009)  (AD=ODL ) /*.01D054 A054 .
0620 068T #DISPLAY.FILE-SIZE (1+009)  (AD=ODR ) /*.01U007 N07.0.
0630/
0640 012T #DISPLAY.DSNAME (1+010)  (AD=ODL ) /*.01D054 A054 .
0650 068T #DISPLAY.FILE-SIZE (1+010)  (AD=ODR ) /*.01U007 N07.0.
0660/
0670 012T #DISPLAY.DSNAME (1+011)  (AD=ODL ) /*.01D054 A054 .
0680 068T #DISPLAY.FILE-SIZE (1+011)  (AD=ODR ) /*.01U007 N07.0.
0690/
0700 012T #DISPLAY.DSNAME (1+012)  (AD=ODL ) /*.01D054 A054 .
0710 068T #DISPLAY.FILE-SIZE (1+012)  (AD=ODR ) /*.01U007 N07.0.
0720/
0730 012T #DISPLAY.DSNAME (1+013)  (AD=ODL ) /*.01D054 A054 .
0740 068T #DISPLAY.FILE-SIZE (1+013)  (AD=ODR ) /*.01U007 N07.0.
0750/
0760 012T #DISPLAY.DSNAME (1+014)  (AD=ODL ) /*.01D054 A054 .
0770 068T #DISPLAY.FILE-SIZE (1+014)  (AD=ODR ) /*.01U007 N07.0.
0780/
0790/
0800* MAP2: VALIDATION *****************************************************
0810* MAP2: END OF MAP *****************************************************
0820END
