0010* MAP2: PROTOTYPE
0020* INPUT USING MAP 'XXXXXXXX'
0030*     ##TITLE #CVAR #DISPLAY.DSNAME(*) #DISPLAY.FILE-SIZE(*) #DSNAME
0040*     #FILE-SIZE #VOLSER
0050DEFINE DATA PARAMETER
00601 ##TITLE (A078)
00701  #CVAR (C)
00801 #DISPLAY.DSNAME (A054/    1:00015)
00901 #DISPLAY.FILE-SIZE (N07.0/00001:00015)
01001 #DSNAME (A054)
01101 #FILE-SIZE (N07.0)
01201 #VOLSER (A006)
0130END-DEFINE
0140FORMAT PS=021 LS=080 ZP=OFF SG=OFF KD=ON  IP=OFF
0150* MAP2: MAP PROFILES *****************************        410***********
0160* .TTAAAMMOO   D I D I N D I D I        ?_)¬&:+(                       *
0170* 023079        N0NNUCN             X        01 SYSPROF YL   #CVAR   1 *
0180************************************************************************
0190INPUT          (     CV=#CVAR                                         /*
0200                                                                       )
0210 002T ##TITLE  (AD=ODL ) /*.01D078 A078 .
0220/
0230/
0240 003T 'Volser   Dsname'
0250 067T 'PamPages'
0260/
0270 003T #VOLSER  (AD=MYT'_' CD=NE CV=#CVAR ) /*.99U006 A006 .
0280 012T #DSNAME  (AD=MYLT'_' CD=NE CV=#CVAR ) /*.99D054 A054 .
0290 068T #FILE-SIZE  (AD=MYR'_' CV=#CVAR ) /*.99U007 N07.0.
0300/
0310 012T #DISPLAY.DSNAME (1+000)  (AD=ODL ) /*.01D054 A054 .
0320   /* A1000150000100001    10000100001100015001000001H
0330 068T #DISPLAY.FILE-SIZE (1+000)  (AD=ODR ) /*.01U007 N07.0.
0340   /* A1000150000100001    10000100001100015001000001H
0350/
0360 012T #DISPLAY.DSNAME (1+001)  (AD=ODL ) /*.01D054 A054 .
0370 068T #DISPLAY.FILE-SIZE (1+001)  (AD=ODR ) /*.01U007 N07.0.
0380/
0390 012T #DISPLAY.DSNAME (1+002)  (AD=ODL ) /*.01D054 A054 .
0400 068T #DISPLAY.FILE-SIZE (1+002)  (AD=ODR ) /*.01U007 N07.0.
0410/
0420 012T #DISPLAY.DSNAME (1+003)  (AD=ODL ) /*.01D054 A054 .
0430 068T #DISPLAY.FILE-SIZE (1+003)  (AD=ODR ) /*.01U007 N07.0.
0440/
0450 012T #DISPLAY.DSNAME (1+004)  (AD=ODL ) /*.01D054 A054 .
0460 068T #DISPLAY.FILE-SIZE (1+004)  (AD=ODR ) /*.01U007 N07.0.
0470/
0480 012T #DISPLAY.DSNAME (1+005)  (AD=ODL ) /*.01D054 A054 .
0490 068T #DISPLAY.FILE-SIZE (1+005)  (AD=ODR ) /*.01U007 N07.0.
0500/
0510 012T #DISPLAY.DSNAME (1+006)  (AD=ODL ) /*.01D054 A054 .
0520 068T #DISPLAY.FILE-SIZE (1+006)  (AD=ODR ) /*.01U007 N07.0.
0530/
0540 012T #DISPLAY.DSNAME (1+007)  (AD=ODL ) /*.01D054 A054 .
0550 068T #DISPLAY.FILE-SIZE (1+007)  (AD=ODR ) /*.01U007 N07.0.
0560/
0570 012T #DISPLAY.DSNAME (1+008)  (AD=ODL ) /*.01D054 A054 .
0580 068T #DISPLAY.FILE-SIZE (1+008)  (AD=ODR ) /*.01U007 N07.0.
0590/
0600 012T #DISPLAY.DSNAME (1+009)  (AD=ODL ) /*.01D054 A054 .
0610 068T #DISPLAY.FILE-SIZE (1+009)  (AD=ODR ) /*.01U007 N07.0.
0620/
0630 012T #DISPLAY.DSNAME (1+010)  (AD=ODL ) /*.01D054 A054 .
0640 068T #DISPLAY.FILE-SIZE (1+010)  (AD=ODR ) /*.01U007 N07.0.
0650/
0660 012T #DISPLAY.DSNAME (1+011)  (AD=ODL ) /*.01D054 A054 .
0670 068T #DISPLAY.FILE-SIZE (1+011)  (AD=ODR ) /*.01U007 N07.0.
0680/
0690 012T #DISPLAY.DSNAME (1+012)  (AD=ODL ) /*.01D054 A054 .
0700 068T #DISPLAY.FILE-SIZE (1+012)  (AD=ODR ) /*.01U007 N07.0.
0710/
0720 012T #DISPLAY.DSNAME (1+013)  (AD=ODL ) /*.01D054 A054 .
0730 068T #DISPLAY.FILE-SIZE (1+013)  (AD=ODR ) /*.01U007 N07.0.
0740/
0750 012T #DISPLAY.DSNAME (1+014)  (AD=ODL ) /*.01D054 A054 .
0760 068T #DISPLAY.FILE-SIZE (1+014)  (AD=ODR ) /*.01U007 N07.0.
0770/
0780/
0790* MAP2: VALIDATION *****************************************************
0800* MAP2: END OF MAP *****************************************************
0810END
