0010* MAP2: PROTOTYPE
0020* INPUT USING MAP 'XXXXXXXX'
0030*     ##TITLE #CHARS #CONTROL #COPIES #DATA(*) #DEVICE #DSNAME
0040*     #END-NUMBER #JOB-NAME #OBJECT #PASSWORD #RECLEN(*) #START-NUMBER
0050DEFINE DATA PARAMETER
00601 ##TITLE (A078)
00701 #CHARS (A064)
00801 #CONTROL (A012)
00901 #COPIES (I1)
01001 #DATA (A060/00001:00010)
01101 #DEVICE (A008)
01201 #DSNAME (A054)
01301 #END-NUMBER (N05.0)
01401 #JOB-NAME (A008)
01501 #OBJECT (A007)
01601 #PASSWORD (A008)
01701 #RECLEN (N03.0/00001:00010)
01801 #START-NUMBER (N05.0)
0190END-DEFINE
0200FORMAT PS=021 LS=080 ZP=OFF SG=OFF KD=ON  IP=OFF
0210* MAP2: MAP PROFILES *****************************        410***********
0220* .TTAAAMMOO   D I D I N D I D I        ?_)¬&:+(                       *
0230* 023079        N0NNUCN             X        01 SYSPROF YL           1 *
0240************************************************************************
0250INPUT          (     IP=OFF                                           /*
0260                                                                       )
0270 002T ##TITLE  (AD=ODL ) /*.01D078 A078 .
0280/
0290/
0300 002T 'Object ......'
0310 016T #OBJECT  (AD=MILT'_' CD=NE ) /*.99U007 A007 .
0320 024T '(FILE/RECORDS)'
0330/
0340 002T 'Dsname ......'
0350 016T #DSNAME  (AD=MILT'_' CD=NE ) /*.99D054 A054 .
0360/
0370 002T 'Password ....'
0380 016T #PASSWORD  (AD=MILT'_' CD=NE ) /*.99D008 A008 .
0390/
0400 002T 'Control .....'
0410 016T #CONTROL  (AD=MILT'_' CD=NE ) /*.99D012 A012 .
0420 029T '(1/2/3/e/a/i)'
0430/
0440 002T 'Job Name ....'
0450 016T #JOB-NAME  (AD=MILT'_' CD=NE ) /*.99D008 A008 .
0460 025T 'Copies ....'
0470 037T #COPIES  (AD=MILT'_' CD=NE ) /*.99U003 I1   .
0480/
0490 002T 'Device ......'
0500 016T #DEVICE  (AD=MILT'_' CD=NE ) /*.99D008 A008 .
0510 025T 'Starno ....'
0520 037T #START-NUMBER  (AD=MILT'_' CD=NE ) /*.99U005 N05.0.
0530 044T 'Endno ...'
0540 054T #END-NUMBER  (AD=MILT'_' CD=NE ) /*.99U005 N05.0.
0550/
0560 002T 'Chars .......'
0570 016T #CHARS  (AD=MILT'_' CD=NE ) /*.99U064 A064 .
0580/
0590 006T 'Reclen   Data'
0600/
0610 006T '------'
0620 014T '----+----1----+----2----+----3----+----4----+----5----+---'-
0630      '-6'
0640/
0650 008T #RECLEN (1+000)  (AD=MILT'_' CD=NE ) /*.99U003 N03.0.
0660   /* A1000100000100001    10000100001100010001000001H
0670 014T #DATA (1+000)  (AD=MILT'_' CD=NE ) /*.99U060 A060 .
0680   /* A1000100000100001    10000100001100010001000001H
0690/
0700 008T #RECLEN (1+001)  (AD=MILT'_' CD=NE ) /*.99U003 N03.0.
0710 014T #DATA (1+001)  (AD=MILT'_' CD=NE ) /*.99U060 A060 .
0720/
0730 008T #RECLEN (1+002)  (AD=MILT'_' CD=NE ) /*.99U003 N03.0.
0740 014T #DATA (1+002)  (AD=MILT'_' CD=NE ) /*.99U060 A060 .
0750/
0760 008T #RECLEN (1+003)  (AD=MILT'_' CD=NE ) /*.99U003 N03.0.
0770 014T #DATA (1+003)  (AD=MILT'_' CD=NE ) /*.99U060 A060 .
0780/
0790 008T #RECLEN (1+004)  (AD=MILT'_' CD=NE ) /*.99U003 N03.0.
0800 014T #DATA (1+004)  (AD=MILT'_' CD=NE ) /*.99U060 A060 .
0810/
0820 008T #RECLEN (1+005)  (AD=MILT'_' CD=NE ) /*.99U003 N03.0.
0830 014T #DATA (1+005)  (AD=MILT'_' CD=NE ) /*.99U060 A060 .
0840/
0850 008T #RECLEN (1+006)  (AD=MILT'_' CD=NE ) /*.99U003 N03.0.
0860 014T #DATA (1+006)  (AD=MILT'_' CD=NE ) /*.99U060 A060 .
0870/
0880 008T #RECLEN (1+007)  (AD=MILT'_' CD=NE ) /*.99U003 N03.0.
0890 014T #DATA (1+007)  (AD=MILT'_' CD=NE ) /*.99U060 A060 .
0900/
0910 008T #RECLEN (1+008)  (AD=MILT'_' CD=NE ) /*.99U003 N03.0.
0920 014T #DATA (1+008)  (AD=MILT'_' CD=NE ) /*.99U060 A060 .
0930/
0940 008T #RECLEN (1+009)  (AD=MILT'_' CD=NE ) /*.99U003 N03.0.
0950 014T #DATA (1+009)  (AD=MILT'_' CD=NE ) /*.99U060 A060 .
0960* MAP2: VALIDATION *****************************************************
0970* MAP2: END OF MAP *****************************************************
0980END
