0010* MAP2: PROTOTYPE
0020* INPUT USING MAP 'XXXXXXXX'
0030*     ##TITLE #DATA(*) #DISP #DSNAME #PASSWORD #RECLEN(*)
0040DEFINE DATA PARAMETER
00501 ##TITLE (A078)
00601 #DATA (A060/    1:00010)
00701 #DISP (A003)
00801 #DSNAME (A054)
00901 #PASSWORD (A008)
01001 #RECLEN (N05.0/    1:00010)
0110END-DEFINE
0120FORMAT PS=021 LS=080 ZP=OFF SG=OFF KD=ON  IP=OFF
0130* MAP2: MAP PROFILES *****************************        410***********
0140* .TTAAAMMOO   D I D I N D I D I        ?_)¬&:+(                       *
0150* 023079        N0NNUCN             X        01 SYSPROF YL           1 *
0160************************************************************************
0170INPUT          (     IP=OFF                                           /*
0180                                                                       )
0190 002T ##TITLE  (AD=ODL ) /*.01D078 A078 .
0200/
0210/
0220 002T 'Datei ...............'
0230 024T #DSNAME  (AD=MILT'_' CD=NE ) /*.99D054 A054 .
0240/
0250 002T 'Passwort ............'
0260 024T #PASSWORD  (AD=MILT'_' CD=NE ) /*.99U008 A008 .
0270/
0280 002T 'Disposition .........'
0290 024T #DISP  (AD=MILT'_' CD=NE ) /*.99D003 A003 .
0300 028T '(MOD/NEW)'
0310/
0320/
0330 006T 'Laenge'
0340 015T 'Daten'
0350/
0360 006T '------'
0370 014T '----+----1----+----2----+----3----+----4----+----5----+---'-
0380      '-6'
0390/
0400 007T #RECLEN (1+000)  (AD=MILT'_' CD=NE ) /*.99D005 N05.0.
0410   /* A1000100000100001    10000100001100010001000001H
0420 014T #DATA (1+000)  (AD=MILT'_' CD=NE ) /*.99D060 A060 .
0430   /* A1000100000100001    10000100001100010001000001H
0440/
0450 007T #RECLEN (1+001)  (AD=MILT'_' CD=NE ) /*.99D005 N05.0.
0460 014T #DATA (1+001)  (AD=MILT'_' CD=NE ) /*.99D060 A060 .
0470/
0480 007T #RECLEN (1+002)  (AD=MILT'_' CD=NE ) /*.99D005 N05.0.
0490 014T #DATA (1+002)  (AD=MILT'_' CD=NE ) /*.99D060 A060 .
0500/
0510 007T #RECLEN (1+003)  (AD=MILT'_' CD=NE ) /*.99D005 N05.0.
0520 014T #DATA (1+003)  (AD=MILT'_' CD=NE ) /*.99D060 A060 .
0530/
0540 007T #RECLEN (1+004)  (AD=MILT'_' CD=NE ) /*.99D005 N05.0.
0550 014T #DATA (1+004)  (AD=MILT'_' CD=NE ) /*.99D060 A060 .
0560/
0570 007T #RECLEN (1+005)  (AD=MILT'_' CD=NE ) /*.99D005 N05.0.
0580 014T #DATA (1+005)  (AD=MILT'_' CD=NE ) /*.99D060 A060 .
0590/
0600 007T #RECLEN (1+006)  (AD=MILT'_' CD=NE ) /*.99D005 N05.0.
0610 014T #DATA (1+006)  (AD=MILT'_' CD=NE ) /*.99D060 A060 .
0620/
0630 007T #RECLEN (1+007)  (AD=MILT'_' CD=NE ) /*.99D005 N05.0.
0640 014T #DATA (1+007)  (AD=MILT'_' CD=NE ) /*.99D060 A060 .
0650/
0660 007T #RECLEN (1+008)  (AD=MILT'_' CD=NE ) /*.99D005 N05.0.
0670 014T #DATA (1+008)  (AD=MILT'_' CD=NE ) /*.99D060 A060 .
0680/
0690 007T #RECLEN (1+009)  (AD=MILT'_' CD=NE ) /*.99D005 N05.0.
0700 014T #DATA (1+009)  (AD=MILT'_' CD=NE ) /*.99D060 A060 .
0710/
0720 014T '----+----1----+----2----+----3----+----4----+----5----+---'-
0730      '-6'
0740/
0750/
0760* MAP2: VALIDATION *****************************************************
0770* MAP2: END OF MAP *****************************************************
0780END
