0010* MAP2: PROTOTYPE
0020* INPUT USING MAP 'XXXXXXXX'
0030*     ##TITLE #DATA(*) #DISPOSITION #DSNAME #ELEMENT #ELEMENT-PASSWORD
0040*     #ELEMENT-TYPE #ELEMENT-VERSION #PASSWORD #REC-LEN(*)
0050DEFINE DATA PARAMETER
00601 ##TITLE (A078)
00701 #DATA (A060/    1:00010)
00801 #DISPOSITION (A003)
00901 #DSNAME (A054)
01001 #ELEMENT (A064)
01101 #ELEMENT-PASSWORD (A008)
01201 #ELEMENT-TYPE (A008)
01301 #ELEMENT-VERSION (A024)
01401 #PASSWORD (A008)
01501 #REC-LEN (N05.0/00001:00010)
0160END-DEFINE
0170FORMAT PS=021 LS=080 ZP=OFF SG=OFF KD=ON  IP=OFF
0180* MAP2: MAP PROFILES *****************************        410***********
0190* .TTAAAMMOO   D I D I N D I D I        ?_)¬&:+(                       *
0200* 023079        N0NNUCN             X        01 SYSPROF YL           1 *
0210************************************************************************
0220INPUT          (     IP=OFF                                           /*
0230                                                                       )
0240 002T ##TITLE  (AD=ODL ) /*.01D078 A078 .
0250/
0260/
0270 002T 'Datei ...............'
0280 024T #DSNAME  (AD=MILT'_' CD=NE ) /*.99D054 A054 .
0290/
0300 002T 'Passwort ............'
0310 024T #PASSWORD  (AD=MILT'_' CD=NE ) /*.99U008 A008 .
0320/
0330 002T 'Element .............'
0340 024T #ELEMENT  (AD=MILT'_' CD=NE AL=054  ) /*.99U054 A064 .
0350/
0360 002T 'Element Type ........'
0370 024T #ELEMENT-TYPE  (AD=MILT'_' CD=NE ) /*.99U008 A008 .
0380/
0390 002T 'Element Passwort ....'
0400 024T #ELEMENT-PASSWORD  (AD=MILT'_' CD=NE ) /*.99U008 A008 .
0410/
0420 002T 'Version .............'
0430 024T #ELEMENT-VERSION  (AD=MILT'_' CD=NE ) /*.99U024 A024 .
0440/
0450 002T 'Disposition .........'
0460 024T #DISPOSITION  (AD=MILT'_' CD=NE ) /*.99U003 A003 .
0470 028T '(MOD/NEW)'
0480/
0490 002T 'Laenge'
0500 015T 'Daten'
0510/
0520 002T '----------'
0530 014T '----+----1----+----2----+----3----+----4----+----5----+---'-
0540      '-6'
0550/
0560 005T #REC-LEN (001)  (AD=MILT'_' CD=NE ) /*.99D005 N05.0.
0570   /* A1000100000100001000010000100001100010001000001H
0580 014T #DATA (1+000)  (AD=MILT'_' CD=NE ) /*.99D060 A060 .
0590   /* A1000100000100001    10000100001100010001000001H
0600/
0610 005T #REC-LEN (002)  (AD=MILT'_' CD=NE ) /*.99D005 N05.0.
0620 014T #DATA (1+001)  (AD=MILT'_' CD=NE ) /*.99D060 A060 .
0630/
0640 005T #REC-LEN (003)  (AD=MILT'_' CD=NE ) /*.99D005 N05.0.
0650 014T #DATA (1+002)  (AD=MILT'_' CD=NE ) /*.99D060 A060 .
0660/
0670 005T #REC-LEN (004)  (AD=MILT'_' CD=NE ) /*.99D005 N05.0.
0680 014T #DATA (1+003)  (AD=MILT'_' CD=NE ) /*.99D060 A060 .
0690/
0700 005T #REC-LEN (005)  (AD=MILT'_' CD=NE ) /*.99D005 N05.0.
0710 014T #DATA (1+004)  (AD=MILT'_' CD=NE ) /*.99D060 A060 .
0720/
0730 005T #REC-LEN (006)  (AD=MILT'_' CD=NE ) /*.99D005 N05.0.
0740 014T #DATA (1+005)  (AD=MILT'_' CD=NE ) /*.99D060 A060 .
0750/
0760 005T #REC-LEN (007)  (AD=MILT'_' CD=NE ) /*.99D005 N05.0.
0770 014T #DATA (1+006)  (AD=MILT'_' CD=NE ) /*.99D060 A060 .
0780/
0790 005T #REC-LEN (008)  (AD=MILT'_' CD=NE ) /*.99D005 N05.0.
0800 014T #DATA (1+007)  (AD=MILT'_' CD=NE ) /*.99D060 A060 .
0810/
0820 005T #REC-LEN (009)  (AD=MILT'_' CD=NE ) /*.99D005 N05.0.
0830 014T #DATA (1+008)  (AD=MILT'_' CD=NE ) /*.99D060 A060 .
0840/
0850 005T #REC-LEN (010)  (AD=MILT'_' CD=NE ) /*.99D005 N05.0.
0860 014T #DATA (1+009)  (AD=MILT'_' CD=NE ) /*.99D060 A060 .
0870* MAP2: VALIDATION *****************************************************
0880* MAP2: END OF MAP *****************************************************
0890END
