0010* MAP2: PROTOTYPE
0020* INPUT USING MAP 'XXXXXXXX'
0030*     ##TITLE #DATA(*) #DISP #DSNAME #PASSWORD #RECLEN(*)
0040DEFINE DATA PARAMETER
00501 ##TITLE (A078)
00601 #DATA (A060/    1:00010)
00701 #DISP (A003)
00801 #DSNAME (A054)
00901 #PASSWORD (A008)
01001 #RECLEN (N05.0/    1:00010)
0110END-DEFINE
0120FORMAT PS=021 LS=080 ZP=OFF SG=OFF KD=ON  IP=OFF
0130* MAP2: MAP PROFILES *****************************        410***********
0140* .TTAAAMMOO   D I D I N D I D I        ?_)¬&:+(                       *
0150* 023079        N0NNUCN             X        01 SYSPROF YL           1 *
0160************************************************************************
0170INPUT          (     IP=OFF                                           /*
0180                                                                       )
0190 002T ##TITLE  (AD=ODL ) /*.01D078 A078 .
0200/
0210/
0220 002T 'Dsname ..............'
0230 024T #DSNAME  (AD=MILT'_' CD=NE ) /*.99D054 A054 .
0240/
0250 002T 'Password ............'
0260 024T #PASSWORD  (AD=MILT'_' CD=NE ) /*.99U008 A008 .
0270/
0280 002T 'Disposition .........'
0290 024T #DISP  (AD=MILT'_' CD=NE ) /*.99D003 A003 .
0300 028T '(MOD/NEW)'
0310/
0320/
0330 006T 'Reclen   Data'
0340/
0350 006T '------'
0360 014T '----+----1----+----2----+----3----+----4----+----5----+---'-
0370      '-6'
0380/
0390 007T #RECLEN (1+000)  (AD=MILT'_' CD=NE ) /*.99D005 N05.0.
0400   /* A1000100000100001    10000100001100010001000001H
0410 014T #DATA (1+000)  (AD=MILT'_' CD=NE ) /*.99D060 A060 .
0420   /* A1000100000100001    10000100001100010001000001H
0430/
0440 007T #RECLEN (1+001)  (AD=MILT'_' CD=NE ) /*.99D005 N05.0.
0450 014T #DATA (1+001)  (AD=MILT'_' CD=NE ) /*.99D060 A060 .
0460/
0470 007T #RECLEN (1+002)  (AD=MILT'_' CD=NE ) /*.99D005 N05.0.
0480 014T #DATA (1+002)  (AD=MILT'_' CD=NE ) /*.99D060 A060 .
0490/
0500 007T #RECLEN (1+003)  (AD=MILT'_' CD=NE ) /*.99D005 N05.0.
0510 014T #DATA (1+003)  (AD=MILT'_' CD=NE ) /*.99D060 A060 .
0520/
0530 007T #RECLEN (1+004)  (AD=MILT'_' CD=NE ) /*.99D005 N05.0.
0540 014T #DATA (1+004)  (AD=MILT'_' CD=NE ) /*.99D060 A060 .
0550/
0560 007T #RECLEN (1+005)  (AD=MILT'_' CD=NE ) /*.99D005 N05.0.
0570 014T #DATA (1+005)  (AD=MILT'_' CD=NE ) /*.99D060 A060 .
0580/
0590 007T #RECLEN (1+006)  (AD=MILT'_' CD=NE ) /*.99D005 N05.0.
0600 014T #DATA (1+006)  (AD=MILT'_' CD=NE ) /*.99D060 A060 .
0610/
0620 007T #RECLEN (1+007)  (AD=MILT'_' CD=NE ) /*.99D005 N05.0.
0630 014T #DATA (1+007)  (AD=MILT'_' CD=NE ) /*.99D060 A060 .
0640/
0650 007T #RECLEN (1+008)  (AD=MILT'_' CD=NE ) /*.99D005 N05.0.
0660 014T #DATA (1+008)  (AD=MILT'_' CD=NE ) /*.99D060 A060 .
0670/
0680 007T #RECLEN (1+009)  (AD=MILT'_' CD=NE ) /*.99D005 N05.0.
0690 014T #DATA (1+009)  (AD=MILT'_' CD=NE ) /*.99D060 A060 .
0700/
0710 014T '----+----1----+----2----+----3----+----4----+----5----+---'-
0720      '-6'
0730/
0740/
0750* MAP2: VALIDATION *****************************************************
0760* MAP2: END OF MAP *****************************************************
0770END
