0010* Display active tasks
0020*
0030DEFINE DATA
0040   GLOBAL USING TUTO
0050   LOCAL  USING ACTIVE-L
0060   LOCAL  1 #DPN (N3)
0070END-DEFINE
0080*
0090WRITE TITLE ##TITLE (AD=OI) /
0100*
0110REPEAT
0120*
0130   FIND ACTIVE-JOBS WITH NODE = ##NODE
0140*
0150      IF ERROR-CODE NE 0
0160         ASSIGN ##MSG-NR   = 1000
0170         ASSIGN ##MSG-TXT1 = ERROR-TEXT
0180         STOP
0190      END-IF
0200*
0210      ASSIGN #DPN = DISPATCHING-PRIORITY
0220*
0230      DISPLAY NOTITLE (ZP=OFF)
0240                      'DP' #DPN 'ID' JES-INIT-ID TYPE
0250                      'NAME' JOB-NAME 'PROC' PROC-NAME
0260                      'STEP' STEP-NAME 'SIO' SIO-COUNT
0270                      STATUS REGION
0280   END-FIND
0290*
0300   NEWPAGE
0310*
0320END-REPEAT
0330*
0340END
