0010* Perform various operations on LIB directory
0020*
0030DEFINE DATA
0040   GLOBAL USING TUTO
0050   LOCAL  USING DLIBUPDL
0060END-DEFINE
0070*
0080INPUT (AD=MI'_')
0090  / ##TITLE (AD=OI IP=OFF)
0100 // '  Dataset......:' LIB-UPDATE.DSNAME
0110  / '  Library......:' LIB-UPDATE.LIBRARY
0120  / '  Sub-Library..:' LIB-UPDATE.SUB-LIBRARY
0130  / '  VSAM Catalog.:' LIB-UPDATE.VSAM-CATALOG
0140  / '  Volume.......:' LIB-UPDATE.VOLSER
0150  / '  Function.....:' LIB-UPDATE.FUNCTION '(RENAME/SCRATCH/ALIAS)'
0160 // '  Member.......:' LIB-UPDATE.MEMBER
0170  / '  Type.........:' LIB-UPDATE.MEMBER-TYPE
0180  / '  Newname......:' LIB-UPDATE.NEWNAME-MEMBER
0190  / '  New type.....:' LIB-UPDATE.NEWNAME-MEMBER-TYPE
0200  / '  Password.....:' LIB-UPDATE.MEMBER-PASSWORD
0210*
0220PROCESS LIB-UPDATE
0230        USING DSNAME              = LIB-UPDATE.DSNAME
0240          ,   LIBRARY             = LIB-UPDATE.LIBRARY
0250          ,   SUB-LIBRARY         = LIB-UPDATE.SUB-LIBRARY
0260          ,   VSAM-CATALOG        = LIB-UPDATE.VSAM-CATALOG
0270          ,   VOLSER              = LIB-UPDATE.VOLSER
0280          ,   FUNCTION            = LIB-UPDATE.FUNCTION
0290          ,   MEMBER              = LIB-UPDATE.MEMBER
0300          ,   MEMBER-TYPE         = LIB-UPDATE.MEMBER-TYPE
0310          ,   NEWNAME-MEMBER      = LIB-UPDATE.NEWNAME-MEMBER
0320          ,   NEWNAME-MEMBER-TYPE = LIB-UPDATE.NEWNAME-MEMBER-TYPE
0330          ,   PASSWORD            = LIB-UPDATE.MEMBER-PASSWORD
0340          ,   NODE                = ##NODE
0350       GIVING ERROR-CODE
0360              ERROR-TEXT
0370*
0380IF ERROR-CODE > 0
0390   REINPUT ERROR-TEXT
0400ELSE
0410   REINPUT *1007
0420END-IF
0430*
0440END
