0010* MAP2: PROTOTYPE
0020* INPUT USING MAP 'XXXXXXXX'
0030*     ##TITLE #ADDRESS #AREA(*) #AREA-ADR(*) #AREA-HEX(*,*) #CV-ADDR
0040*     #CV-OFF #OFFSET
0050DEFINE DATA PARAMETER
00601 ##TITLE (A078)
00701 #ADDRESS (B004)
00801 #AREA (A018/00001:00016)
00901 #AREA-ADR (B004/00001:00016)
01001 #AREA-HEX (B004/00001:00016,00001:00004)
01101  #CV-ADDR (C)
01201  #CV-OFF (C)
01301 #OFFSET (B004)
0140END-DEFINE
0150FORMAT PS=021 LS=080 ZP=OFF SG=OFF KD=ON  IP=OFF
0160* MAP2: MAP PROFILES *****************************        410***********
0170* .TTAAAMMOO   D I D I N D I D I        ?_)¬&:+(                       *
0180* 023079        N0 NUCN             X        01 SYSPROF YL           1 *
0190************************************************************************
0200INPUT          (     IP=OFF                                           /*
0210                                                                       )
0220 002T ##TITLE  (AD=OD ) /*.01U078 A078 .
0230/
0240/
0250 002T 'Address...'
0260 013T #ADDRESS  (AD=MYT CV=#CV-ADDR ) /*.99U008 B004 .
0270 024T 'Offset....'
0280 035T #OFFSET  (AD=MYT CV=#CV-OFF ) /*.99U008 B004 .
0290/
0300/
0310 002T #AREA-ADR (001)  (AD=OD ) /*.01U008 B004 .
0320   /**A1000160000100001000010000100001100016001001000001000HV
0330 013T #AREA-HEX (001,001)  (AD=OD ) /*.01U008 B004 .
0340   /**A2000160000400001000010000100001120016004001000003000HV
0350 024T #AREA-HEX (001,002)  (AD=OD ) /*.01U008 B004 .
0360 035T #AREA-HEX (001,003)  (AD=OD ) /*.01U008 B004 .
0370 046T #AREA-HEX (001,004)  (AD=OD ) /*.01U008 B004 .
0380 057T #AREA (001)  (AD=OD ) /*.01U018 A018 .
0390   /**A1000160000100001000010000100001100016001001000001000HV
0400/
0410 002T #AREA-ADR (002)  (AD=OD ) /*.01U008 B004 .
0420 013T #AREA-HEX (002,001)  (AD=OD ) /*.01U008 B004 .
0430 024T #AREA-HEX (002,002)  (AD=OD ) /*.01U008 B004 .
0440 035T #AREA-HEX (002,003)  (AD=OD ) /*.01U008 B004 .
0450 046T #AREA-HEX (002,004)  (AD=OD ) /*.01U008 B004 .
0460 057T #AREA (002)  (AD=OD ) /*.01U018 A018 .
0470/
0480 002T #AREA-ADR (003)  (AD=OD ) /*.01U008 B004 .
0490 013T #AREA-HEX (003,001)  (AD=OD ) /*.01U008 B004 .
0500 024T #AREA-HEX (003,002)  (AD=OD ) /*.01U008 B004 .
0510 035T #AREA-HEX (003,003)  (AD=OD ) /*.01U008 B004 .
0520 046T #AREA-HEX (003,004)  (AD=OD ) /*.01U008 B004 .
0530 057T #AREA (003)  (AD=OD ) /*.01U018 A018 .
0540/
0550 002T #AREA-ADR (004)  (AD=OD ) /*.01U008 B004 .
0560 013T #AREA-HEX (004,001)  (AD=OD ) /*.01U008 B004 .
0570 024T #AREA-HEX (004,002)  (AD=OD ) /*.01U008 B004 .
0580 035T #AREA-HEX (004,003)  (AD=OD ) /*.01U008 B004 .
0590 046T #AREA-HEX (004,004)  (AD=OD ) /*.01U008 B004 .
0600 057T #AREA (004)  (AD=OD ) /*.01U018 A018 .
0610/
0620 002T #AREA-ADR (005)  (AD=OD ) /*.01U008 B004 .
0630 013T #AREA-HEX (005,001)  (AD=OD ) /*.01U008 B004 .
0640 024T #AREA-HEX (005,002)  (AD=OD ) /*.01U008 B004 .
0650 035T #AREA-HEX (005,003)  (AD=OD ) /*.01U008 B004 .
0660 046T #AREA-HEX (005,004)  (AD=OD ) /*.01U008 B004 .
0670 057T #AREA (005)  (AD=OD ) /*.01U018 A018 .
0680/
0690 002T #AREA-ADR (006)  (AD=OD ) /*.01U008 B004 .
0700 013T #AREA-HEX (006,001)  (AD=OD ) /*.01U008 B004 .
0710 024T #AREA-HEX (006,002)  (AD=OD ) /*.01U008 B004 .
0720 035T #AREA-HEX (006,003)  (AD=OD ) /*.01U008 B004 .
0730 046T #AREA-HEX (006,004)  (AD=OD ) /*.01U008 B004 .
0740 057T #AREA (006)  (AD=OD ) /*.01U018 A018 .
0750/
0760 002T #AREA-ADR (007)  (AD=OD ) /*.01U008 B004 .
0770 013T #AREA-HEX (007,001)  (AD=OD ) /*.01U008 B004 .
0780 024T #AREA-HEX (007,002)  (AD=OD ) /*.01U008 B004 .
0790 035T #AREA-HEX (007,003)  (AD=OD ) /*.01U008 B004 .
0800 046T #AREA-HEX (007,004)  (AD=OD ) /*.01U008 B004 .
0810 057T #AREA (007)  (AD=OD ) /*.01U018 A018 .
0820/
0830 002T #AREA-ADR (008)  (AD=OD ) /*.01U008 B004 .
0840 013T #AREA-HEX (008,001)  (AD=OD ) /*.01U008 B004 .
0850 024T #AREA-HEX (008,002)  (AD=OD ) /*.01U008 B004 .
0860 035T #AREA-HEX (008,003)  (AD=OD ) /*.01U008 B004 .
0870 046T #AREA-HEX (008,004)  (AD=OD ) /*.01U008 B004 .
0880 057T #AREA (008)  (AD=OD ) /*.01U018 A018 .
0890/
0900 002T #AREA-ADR (009)  (AD=OD ) /*.01U008 B004 .
0910 013T #AREA-HEX (009,001)  (AD=OD ) /*.01U008 B004 .
0920 024T #AREA-HEX (009,002)  (AD=OD ) /*.01U008 B004 .
0930 035T #AREA-HEX (009,003)  (AD=OD ) /*.01U008 B004 .
0940 046T #AREA-HEX (009,004)  (AD=OD ) /*.01U008 B004 .
0950 057T #AREA (009)  (AD=OD ) /*.01U018 A018 .
0960/
0970 002T #AREA-ADR (010)  (AD=OD ) /*.01U008 B004 .
0980 013T #AREA-HEX (010,001)  (AD=OD ) /*.01U008 B004 .
0990 024T #AREA-HEX (010,002)  (AD=OD ) /*.01U008 B004 .
1000 035T #AREA-HEX (010,003)  (AD=OD ) /*.01U008 B004 .
1010 046T #AREA-HEX (010,004)  (AD=OD ) /*.01U008 B004 .
1020 057T #AREA (010)  (AD=OD ) /*.01U018 A018 .
1030/
1040 002T #AREA-ADR (011)  (AD=OD ) /*.01U008 B004 .
1050 013T #AREA-HEX (011,001)  (AD=OD ) /*.01U008 B004 .
1060 024T #AREA-HEX (011,002)  (AD=OD ) /*.01U008 B004 .
1070 035T #AREA-HEX (011,003)  (AD=OD ) /*.01U008 B004 .
1080 046T #AREA-HEX (011,004)  (AD=OD ) /*.01U008 B004 .
1090 057T #AREA (011)  (AD=OD ) /*.01U018 A018 .
1100/
1110 002T #AREA-ADR (012)  (AD=OD ) /*.01U008 B004 .
1120 013T #AREA-HEX (012,001)  (AD=OD ) /*.01U008 B004 .
1130 024T #AREA-HEX (012,002)  (AD=OD ) /*.01U008 B004 .
1140 035T #AREA-HEX (012,003)  (AD=OD ) /*.01U008 B004 .
1150 046T #AREA-HEX (012,004)  (AD=OD ) /*.01U008 B004 .
1160 057T #AREA (012)  (AD=OD ) /*.01U018 A018 .
1170/
1180 002T #AREA-ADR (013)  (AD=OD ) /*.01U008 B004 .
1190 013T #AREA-HEX (013,001)  (AD=OD ) /*.01U008 B004 .
1200 024T #AREA-HEX (013,002)  (AD=OD ) /*.01U008 B004 .
1210 035T #AREA-HEX (013,003)  (AD=OD ) /*.01U008 B004 .
1220 046T #AREA-HEX (013,004)  (AD=OD ) /*.01U008 B004 .
1230 057T #AREA (013)  (AD=OD ) /*.01U018 A018 .
1240/
1250 002T #AREA-ADR (014)  (AD=OD ) /*.01U008 B004 .
1260 013T #AREA-HEX (014,001)  (AD=OD ) /*.01U008 B004 .
1270 024T #AREA-HEX (014,002)  (AD=OD ) /*.01U008 B004 .
1280 035T #AREA-HEX (014,003)  (AD=OD ) /*.01U008 B004 .
1290 046T #AREA-HEX (014,004)  (AD=OD ) /*.01U008 B004 .
1300 057T #AREA (014)  (AD=OD ) /*.01U018 A018 .
1310/
1320 002T #AREA-ADR (015)  (AD=OD ) /*.01U008 B004 .
1330 013T #AREA-HEX (015,001)  (AD=OD ) /*.01U008 B004 .
1340 024T #AREA-HEX (015,002)  (AD=OD ) /*.01U008 B004 .
1350 035T #AREA-HEX (015,003)  (AD=OD ) /*.01U008 B004 .
1360 046T #AREA-HEX (015,004)  (AD=OD ) /*.01U008 B004 .
1370 057T #AREA (015)  (AD=OD ) /*.01U018 A018 .
1380/
1390 002T #AREA-ADR (016)  (AD=OD ) /*.01U008 B004 .
1400 013T #AREA-HEX (016,001)  (AD=OD ) /*.01U008 B004 .
1410 024T #AREA-HEX (016,002)  (AD=OD ) /*.01U008 B004 .
1420 035T #AREA-HEX (016,003)  (AD=OD ) /*.01U008 B004 .
1430 046T #AREA-HEX (016,004)  (AD=OD ) /*.01U008 B004 .
1440 057T #AREA (016)  (AD=OD ) /*.01U018 A018 .
1450/
1460* MAP2: VALIDATION *****************************************************
1470* MAP2: END OF MAP *****************************************************
1480END
