0010* Execute NET operator commands and display response
0020*
0030DEFINE DATA
0040   GLOBAL USING TUTO
0050   LOCAL  USING NETOP-L
0060END-DEFINE
0070*
0080REPEAT
0090   INPUT (AD=MI'_')
0100     // ##TITLE (AD=OI IP=OFF)
0110     // 'Command:'(I)  / ' ' NET-OPER.COMMAND (AL=79)
0120     // 'Purge previous messages ? (y/n) ' (I) NET-OPER.PURGE-PREVIOUS
0130*
0140   FIND NET-OPER WITH COMMAND        = NET-OPER.COMMAND
0150                  AND NODE           = ##NODE
0160                  AND PURGE-PREVIOUS = NET-OPER.PURGE-PREVIOUS
0170*
0180      IF ERROR-CODE > 0
0190         ASSIGN ##MSG-NR   = 1000
0200         ASSIGN ##MSG-TXT1 = ERROR-TEXT
0210         STOP
0220      END-IF
0230*
0240      IF LINE-STATUS NE 'YES'
0250         NEWPAGE
0260      END-IF
0270*
0280      WRITE NOTITLE TIME-STAMP LINE (AL=70)
0290*
0300   END-FIND
0310END-REPEAT
0320END
