0010* Logon/Logoff to NATURAL PROCESS
0020*
0030DEFINE DATA
0040   GLOBAL USING TUTO
0050   LOCAL USING NPLOGONL
0060END-DEFINE
0070*
0080ASSIGN NATPROC-LOGON.LOGON-ID = *INIT-USER
0090ASSIGN NATPROC-LOGON.FUNCTION = 'LOGON'
0100*
0110ASSIGN ##MSG-NR = 1010
0120INPUT (AD=MI) TEXT *##MSG-NR, ##MSG-TXT1, ##MSG-TXT2
0130              MARK *NATPROC-LOGON.PASSWORD
0140    / ##TITLE (AD=OI IP=OFF)
0150   // 'Function:' NATPROC-LOGON.FUNCTION
0160    / 'User-ID :' NATPROC-LOGON.LOGON-ID
0170    / 'Password:' NATPROC-LOGON.PASSWORD (AD=N)
0180    / 'Node    :' ##NODE (SG=OFF)
0190*
0200DECIDE FOR FIRST CONDITION
0210   WHEN NATPROC-LOGON.LOGON-ID = ' '
0220      REINPUT *1025
0230   WHEN NATPROC-LOGON.PASSWORD = ' ' AND NATPROC-LOGON.FUNCTION= 'LOGON'
0240      REINPUT *1026 MARK *NATPROC-LOGON.PASSWORD
0250   WHEN NONE
0260      IGNORE
0270END-DECIDE
0280*
0290PROCESS NATPROC-LOGON USING LOGON-ID = NATPROC-LOGON.LOGON-ID
0300                        ,   PASSWORD = NATPROC-LOGON.PASSWORD
0310                        ,   FUNCTION = NATPROC-LOGON.FUNCTION
0320                        ,   NODE     = ##NODE
0330                     GIVING ERROR-CODE
0340                            ERROR-TEXT
0350REINPUT ERROR-TEXT
0360*
0370END
