0010* DISPLAY USERS OF NATURAL PROCESS
0020*
0030DEFINE DATA
0040   GLOBAL USING TUTO
0050   LOCAL USING NP-USERL
0060   LOCAL 1 #FULL-SCAN (A3)
0070END-DEFINE
0080*
0090INPUT (AD=MIT'_' ZP=OFF)
0100   //  ##TITLE (AD=OI IP=OFF)
0110   //  '  Display internal tasks....:' #FULL-SCAN '(YES/NO)'
0120*
0130IF #FULL-SCAN NE 'YES' AND
0140   #FULL-SCAN NE 'NO'  AND
0150   #FULL-SCAN NE '  '
0160   REINPUT WITH TEXT 'Please enter YES or NO'
0170END-IF
0180*
0190FIND NATPROC-USERS WITH NODE = ##NODE
0200                   AND FULL-SCAN = #FULL-SCAN
0210*
0220   IF ERROR-CODE NE 0
0230      ASSIGN ##MSG-NR   = 1000
0240      ASSIGN ##MSG-TXT1 = ERROR-TEXT
0250      STOP
0260   END-IF
0270*
0280   DISPLAY USER-ID
0290           ADABAS-ID
0300           'ESY-ID' NATPROC-ID (EM=X(4))
0310           CPU
0320           LAST-ACTIVITY
0330           IO-COUNT
0340           TASK-ID
0350           'INT' INTERNAL-TASK
0360*          CORE-USED
0370*          CORE-FREE
0380END-FIND
0390*
0400END
