0010* MAP2: PROTOTYPE
0020* INPUT USING MAP 'XXXXXXXX'
0030*     #REC(*) #SIG(*) SEND-EMAIL.CC-RECIPIENT(*) SEND-EMAIL.DSNAME
0040*     SEND-EMAIL.RECIPIENT(*) SEND-EMAIL.REPLY-TO SEND-EMAIL.SUBJECT
0050*     SEND-EMAIL.VOLSER
0060DEFINE DATA PARAMETER
00701 #REC (A073/00001:00006)
00801 #SIG (A064/00001:00003)
00901 SEND-EMAIL.CC-RECIPIENT (A128/00001:00020)
01001 SEND-EMAIL.DSNAME (A054)
01101 SEND-EMAIL.RECIPIENT (A128/00001:00020)
01201 SEND-EMAIL.REPLY-TO (A128)
01301 SEND-EMAIL.SUBJECT (A128)
01401 SEND-EMAIL.VOLSER (A006)
0150END-DEFINE
0160FORMAT PS=023 LS=080 ZP=OFF SG=OFF KD=OFF IP=OFF
0170* MAP2: MAP PROFILES *****************************        410***********
0180* .TTAAAMMOO   D I D I N D I D I        ?_@¬&;+#                       *
0190* 023079        N0NNUCN             X        01 SYSPROF NL             *
0200************************************************************************
0210INPUT          (     IP=OFF                                           /*
0220                                                                       )
0230 029T 'Send e-mail via Internet'(I)
0240/
0250 029T '(lower case acceptable)'
0260/
0270/
0280 002T 'To:'(I)
0290 007T '(1)'(I)
0300 011T SEND-EMAIL.RECIPIENT (001)  (AD=MIL'_' AL=064  ) /*.99U064 A128 .
0310   /**A1000200000100001000010000100001100002001001000001000HV
0320/
0330 007T '(2)'
0340 011T SEND-EMAIL.RECIPIENT (002)  (AD=MIL'_' AL=064  ) /*.99U064 A128 .
0350/
0360 002T 'Cc:'(I)
0370 007T '(1)'(I)
0380 011T SEND-EMAIL.CC-RECIPIENT (001)  (AD=MIL'_' AL=064  ) /*.99U064 A128 .
0390   /**A1000200000100001000010000100001100002001001000001000HV
0400/
0410 007T '(2)'
0420 011T SEND-EMAIL.CC-RECIPIENT (002)  (AD=MIL'_' AL=064  ) /*.99U064 A128 .
0430/
0440 002T 'Reply-to'(I)
0450 011T SEND-EMAIL.REPLY-TO  (AD=MIL'_' AL=064  ) /*.99U064 A128 .
0460/
0470 002T 'Subject:'(I)
0480 011T SEND-EMAIL.SUBJECT  (AD=MIL'_' AL=064  ) /*.99U064 A128 .
0490/
0500 002T 'Dataset:'(I)
0510 011T SEND-EMAIL.DSNAME  (AD=MILT'_' AL=044  ) /*.99V044 A054            .
0520 058T 'on Volser:'(I)
0530 069T SEND-EMAIL.VOLSER  (AD=MILT'_' ) /*.99V006 A006            .
0540/
0550/
0560 002T 'Message text:'(I)
0570/
0580 002T #REC (1+000)  (AD=MIL'_' ) /*.99D073 A073 .
0590   /**A1000060000100001000010000100001100006001001000001000HV
0600/
0610 002T #REC (1+001)  (AD=MIL'_' ) /*.99D073 A073 .
0620/
0630 002T #REC (1+002)  (AD=MIL'_' ) /*.99D073 A073 .
0640/
0650 002T #REC (1+003)  (AD=MIL'_' ) /*.99D073 A073 .
0660/
0670 002T #REC (1+004)  (AD=MIL'_' ) /*.99D073 A073 .
0680/
0690 002T #REC (1+005)  (AD=MIL'_' ) /*.99D073 A073 .
0700/
0710 002T '(.sig)'(I)
0720 011T #SIG (1+000)  (AD=MIL'_' ) /*.99D064 A064 .
0730   /**A1000030000100001000010000100001100003001001000001000HV
0740/
0750 011T #SIG (1+001)  (AD=MIL'_' ) /*.99D064 A064 .
0760/
0770 011T #SIG (1+002)  (AD=MIL'_' ) /*.99D064 A064 .
0780/
0790/
0800* MAP2: VALIDATION *****************************************************
0810RULEVAR D01SEND-EMAIL.DSNAME
0820INCDIR SEND-EMAIL                       DSNAME                          ;
0830RULEVAR D01SEND-EMAIL.VOLSER
0840INCDIR SEND-EMAIL                       VOLSER                          ;
0850* MAP2: END OF MAP *****************************************************
0860END
