0010* Send a message to a COM-PLETE/TSO user or CONSOLE
0020*
0030DEFINE DATA
0040   GLOBAL USING TUTO
0050   LOCAL USING MSG-L
0060   LOCAL 01 #CONS    (A1)
0070         01 #USER    (A8)
0080         01 #NOLOGSW (A1)
0090END-DEFINE
0100*
0110INPUT (AD=MI'_' IP=OFF)
0120    / ##TITLE (AD=OI IP=OFF)
0130   // 'Message :'(I)
0140    / SEND-MESSAGE.MESSAGE
0150   // 'to operator console :' (I) #CONS
0160   // 'or to user          :' (I) #USER
0170   // 'Send to console if'    (I)
0180    / 'user not logged on ?:' (I) #NOLOGSW
0190*
0200IF SEND-MESSAGE.MESSAGE = ' '
0210   REINPUT *1013 MARK *SEND-MESSAGE.MESSAGE
0220END-IF
0230*
0240IF #CONS = ' '
0250   IF #USER = ' '
0260      REINPUT *1014 MARK *#CONS
0270   ELSE
0280      ASSIGN SEND-MESSAGE.DESTINATION = #USER
0290   END-IF
0300ELSE
0310   ASSIGN SEND-MESSAGE.DESTINATION = '*CONSOLE'
0320END-IF
0330*
0340IF #NOLOGSW = 'Y'
0350   ASSIGN SEND-MESSAGE.NOLOG = 'CONSOLE'
0360END-IF
0370*
0380PROCESS SEND-MESSAGE USING MESSAGE     = SEND-MESSAGE.MESSAGE
0390                       ,   DESTINATION = SEND-MESSAGE.DESTINATION
0400                       ,   NOLOG       = SEND-MESSAGE.NOLOG
0410                       ,   NODE        = ##NODE
0420                    GIVING ERROR-CODE
0430                           ERROR-TEXT
0440   COMPRESS ERROR-TEXT STATUS TO MESSAGE
0450   REINPUT MESSAGE
0460*
0470END
