0010* MAP2: PROTOTYPE
0020* INPUT USING MAP 'XXXXXXXX'
0030*     ##TITLE #CV-MARK(*) #CVAR #DISPLAY.CLASS(*)
0040*     #DISPLAY.DESTINATION(*) #DISPLAY.DISP(*) #DISPLAY.HOLD(*)
0050*     #DISPLAY.JOB-NAME(*) #DISPLAY.JOB-NUMBER(*) #DISPLAY.MARK(*)
0060*     #DISPLAY.PRIORITY(*) #DISPLAY.QUEUE(*) #DISPLAY.RECORD-COUNT(*)
0070*     #DISPLAY.STATUS(*) #JOB-NAME #QUEUE
0080DEFINE DATA PARAMETER
00901 ##TITLE (A078)
01001  #CV-MARK (C/00001:00015)
01101  #CVAR (C)
01201 #DISPLAY.CLASS (A008/00001:00015)
01301 #DISPLAY.DESTINATION (A008/00001:00015)
01401 #DISPLAY.DISP (A001/00001:00015)
01501 #DISPLAY.HOLD (A003/00001:00015)
01601 #DISPLAY.JOB-NAME (A008/00001:00015)
01701 #DISPLAY.JOB-NUMBER (N05.0/00001:00015)
01801 #DISPLAY.MARK (A001/00001:00015)
01901 #DISPLAY.PRIORITY (N03.0/00001:00015)
02001 #DISPLAY.QUEUE (A003/00001:00015)
02101 #DISPLAY.RECORD-COUNT (N07.0/00001:00015)
02201 #DISPLAY.STATUS (A009/00001:00015)
02301 #JOB-NAME (A008)
02401 #QUEUE (A003)
0250END-DEFINE
0260FORMAT PS=021 LS=080 ZP=OFF SG=OFF KD=ON  IP=OFF
0270* MAP2: MAP PROFILES *****************************        410***********
0280* .TTAAAMMOO   D I D I N D I D I        ?_)¬&:+(                       *
0290* 023079        N0NNUCN             X        01 SYSPROF YL   #CVAR   1 *
0300************************************************************************
0310INPUT          (     CV=#CVAR                                         /*
0320                                                                       )
0330 002T ##TITLE  (AD=ODL ) /*.01D078 A078 .
0340/
0350/
0360 005T 'Job-Name Number Queue C D Prio Records Dest'
0370 053T 'Status'
0380 063T 'Hold'
0390/
0400 005T #JOB-NAME  (AD=MYLT'_' CV=#CVAR ) /*.99D008 A008 .
0410 014T '______'
0420 021T #QUEUE  (AD=MYLT'_' CV=#CVAR ) /*.99U003 A003 .
0430 025T '_ _ _ ___'
0440 036T '_______ ________ _________ ____'
0450/
0460 002T #DISPLAY.MARK (001)  (AD=MYLT'_' CV=#CV-MARK(001) ) /*.99D001 A001 .
0470   /**A1000150000100001000010000100001100015001001000001000HV
0480 005T #DISPLAY.JOB-NAME (001)  (AD=ODL ) /*.01D008 A008 .
0490   /**A1000150000100001000010000100001100015001001000001000HV
0500 014T #DISPLAY.JOB-NUMBER (001)  (AD=ODL ) /*.01D005 N05.0.
0510   /**A1000150000100001000010000100001100015001001000001000HV
0520 021T #DISPLAY.QUEUE (001)  (AD=ODL ) /*.01D003 A003 .
0530   /**A1000150000100001000010000100001100015001001000001000HV
0540 027T #DISPLAY.CLASS (001)  (AD=ODL AL=001  ) /*.01D001 A008 .
0550   /**A1000150000100001000010000100001100015001001000001000HV
0560 029T #DISPLAY.DISP (001)  (AD=ODL ) /*.01D001 A001 .
0570   /**A1000150000100001000010000100001100015001001000001000HV
0580 031T #DISPLAY.PRIORITY (001)  (AD=ODL ) /*.01D003 N03.0.
0590   /**A1000150000100001000010000100001100015001001000001000HV
0600 036T #DISPLAY.RECORD-COUNT (001)  (AD=ODL ) /*.01D007 N07.0.
0610   /**A1000150000100001000010000100001100015001001000001000HV
0620 044T #DISPLAY.DESTINATION (001)  (AD=ODL ) /*.01D008 A008 .
0630   /**A1000150000100001000010000100001100015001001000001000HV
0640 053T #DISPLAY.STATUS (001)  (AD=ODL ) /*.01D009 A009 .
0650   /**A1000150000100001000010000100001100015001001000001000HV
0660 063T #DISPLAY.HOLD (001)  (AD=ODL ) /*.01D003 A003 .
0670   /**A1000150000100001000010000100001100015001001000001000HV
0680/
0690 002T #DISPLAY.MARK (002)  (AD=MYLT'_' CV=#CV-MARK(002) ) /*.99D001 A001 .
0700 005T #DISPLAY.JOB-NAME (002)  (AD=ODL ) /*.01D008 A008 .
0710 014T #DISPLAY.JOB-NUMBER (002)  (AD=ODL ) /*.01D005 N05.0.
0720 021T #DISPLAY.QUEUE (002)  (AD=ODL ) /*.01D003 A003 .
0730 027T #DISPLAY.CLASS (002)  (AD=ODL AL=001  ) /*.01D001 A008 .
0740 029T #DISPLAY.DISP (002)  (AD=ODL ) /*.01D001 A001 .
0750 031T #DISPLAY.PRIORITY (002)  (AD=ODL ) /*.01D003 N03.0.
0760 036T #DISPLAY.RECORD-COUNT (002)  (AD=ODL ) /*.01D007 N07.0.
0770 044T #DISPLAY.DESTINATION (002)  (AD=ODL ) /*.01D008 A008 .
0780 053T #DISPLAY.STATUS (002)  (AD=ODL ) /*.01D009 A009 .
0790 063T #DISPLAY.HOLD (002)  (AD=ODL ) /*.01D003 A003 .
0800/
0810 002T #DISPLAY.MARK (003)  (AD=MYLT'_' CV=#CV-MARK(003) ) /*.99D001 A001 .
0820 005T #DISPLAY.JOB-NAME (003)  (AD=ODL ) /*.01D008 A008 .
0830 014T #DISPLAY.JOB-NUMBER (003)  (AD=ODL ) /*.01D005 N05.0.
0840 021T #DISPLAY.QUEUE (003)  (AD=ODL ) /*.01D003 A003 .
0850 027T #DISPLAY.CLASS (003)  (AD=ODL AL=001  ) /*.01D001 A008 .
0860 029T #DISPLAY.DISP (003)  (AD=ODL ) /*.01D001 A001 .
0870 031T #DISPLAY.PRIORITY (003)  (AD=ODL ) /*.01D003 N03.0.
0880 036T #DISPLAY.RECORD-COUNT (003)  (AD=ODL ) /*.01D007 N07.0.
0890 044T #DISPLAY.DESTINATION (003)  (AD=ODL ) /*.01D008 A008 .
0900 053T #DISPLAY.STATUS (003)  (AD=ODL ) /*.01D009 A009 .
0910 063T #DISPLAY.HOLD (003)  (AD=ODL ) /*.01D003 A003 .
0920/
0930 002T #DISPLAY.MARK (004)  (AD=MYLT'_' CV=#CV-MARK(004) ) /*.99D001 A001 .
0940 005T #DISPLAY.JOB-NAME (004)  (AD=ODL ) /*.01D008 A008 .
0950 014T #DISPLAY.JOB-NUMBER (004)  (AD=ODL ) /*.01D005 N05.0.
0960 021T #DISPLAY.QUEUE (004)  (AD=ODL ) /*.01D003 A003 .
0970 027T #DISPLAY.CLASS (004)  (AD=ODL AL=001  ) /*.01D001 A008 .
0980 029T #DISPLAY.DISP (004)  (AD=ODL ) /*.01D001 A001 .
0990 031T #DISPLAY.PRIORITY (004)  (AD=ODL ) /*.01D003 N03.0.
1000 036T #DISPLAY.RECORD-COUNT (004)  (AD=ODL ) /*.01D007 N07.0.
1010 044T #DISPLAY.DESTINATION (004)  (AD=ODL ) /*.01D008 A008 .
1020 053T #DISPLAY.STATUS (004)  (AD=ODL ) /*.01D009 A009 .
1030 063T #DISPLAY.HOLD (004)  (AD=ODL ) /*.01D003 A003 .
1040/
1050 002T #DISPLAY.MARK (005)  (AD=MYLT'_' CV=#CV-MARK(005) ) /*.99D001 A001 .
1060 005T #DISPLAY.JOB-NAME (005)  (AD=ODL ) /*.01D008 A008 .
1070 014T #DISPLAY.JOB-NUMBER (005)  (AD=ODL ) /*.01D005 N05.0.
1080 021T #DISPLAY.QUEUE (005)  (AD=ODL ) /*.01D003 A003 .
1090 027T #DISPLAY.CLASS (005)  (AD=ODL AL=001  ) /*.01D001 A008 .
1100 029T #DISPLAY.DISP (005)  (AD=ODL ) /*.01D001 A001 .
1110 031T #DISPLAY.PRIORITY (005)  (AD=ODL ) /*.01D003 N03.0.
1120 036T #DISPLAY.RECORD-COUNT (005)  (AD=ODL ) /*.01D007 N07.0.
1130 044T #DISPLAY.DESTINATION (005)  (AD=ODL ) /*.01D008 A008 .
1140 053T #DISPLAY.STATUS (005)  (AD=ODL ) /*.01D009 A009 .
1150 063T #DISPLAY.HOLD (005)  (AD=ODL ) /*.01D003 A003 .
1160/
1170 002T #DISPLAY.MARK (006)  (AD=MYLT'_' CV=#CV-MARK(006) ) /*.99D001 A001 .
1180 005T #DISPLAY.JOB-NAME (006)  (AD=ODL ) /*.01D008 A008 .
1190 014T #DISPLAY.JOB-NUMBER (006)  (AD=ODL ) /*.01D005 N05.0.
1200 021T #DISPLAY.QUEUE (006)  (AD=ODL ) /*.01D003 A003 .
1210 027T #DISPLAY.CLASS (006)  (AD=ODL AL=001  ) /*.01D001 A008 .
1220 029T #DISPLAY.DISP (006)  (AD=ODL ) /*.01D001 A001 .
1230 031T #DISPLAY.PRIORITY (006)  (AD=ODL ) /*.01D003 N03.0.
1240 036T #DISPLAY.RECORD-COUNT (006)  (AD=ODL ) /*.01D007 N07.0.
1250 044T #DISPLAY.DESTINATION (006)  (AD=ODL ) /*.01D008 A008 .
1260 053T #DISPLAY.STATUS (006)  (AD=ODL ) /*.01D009 A009 .
1270 063T #DISPLAY.HOLD (006)  (AD=ODL ) /*.01D003 A003 .
1280/
1290 002T #DISPLAY.MARK (007)  (AD=MYLT'_' CV=#CV-MARK(007) ) /*.99D001 A001 .
1300 005T #DISPLAY.JOB-NAME (007)  (AD=ODL ) /*.01D008 A008 .
1310 014T #DISPLAY.JOB-NUMBER (007)  (AD=ODL ) /*.01D005 N05.0.
1320 021T #DISPLAY.QUEUE (007)  (AD=ODL ) /*.01D003 A003 .
1330 027T #DISPLAY.CLASS (007)  (AD=ODL AL=001  ) /*.01D001 A008 .
1340 029T #DISPLAY.DISP (007)  (AD=ODL ) /*.01D001 A001 .
1350 031T #DISPLAY.PRIORITY (007)  (AD=ODL ) /*.01D003 N03.0.
1360 036T #DISPLAY.RECORD-COUNT (007)  (AD=ODL ) /*.01D007 N07.0.
1370 044T #DISPLAY.DESTINATION (007)  (AD=ODL ) /*.01D008 A008 .
1380 053T #DISPLAY.STATUS (007)  (AD=ODL ) /*.01D009 A009 .
1390 063T #DISPLAY.HOLD (007)  (AD=ODL ) /*.01D003 A003 .
1400/
1410 002T #DISPLAY.MARK (008)  (AD=MYLT'_' CV=#CV-MARK(008) ) /*.99D001 A001 .
1420 005T #DISPLAY.JOB-NAME (008)  (AD=ODL ) /*.01D008 A008 .
1430 014T #DISPLAY.JOB-NUMBER (008)  (AD=ODL ) /*.01D005 N05.0.
1440 021T #DISPLAY.QUEUE (008)  (AD=ODL ) /*.01D003 A003 .
1450 027T #DISPLAY.CLASS (008)  (AD=ODL AL=001  ) /*.01D001 A008 .
1460 029T #DISPLAY.DISP (008)  (AD=ODL ) /*.01D001 A001 .
1470 031T #DISPLAY.PRIORITY (008)  (AD=ODL ) /*.01D003 N03.0.
1480 036T #DISPLAY.RECORD-COUNT (008)  (AD=ODL ) /*.01D007 N07.0.
1490 044T #DISPLAY.DESTINATION (008)  (AD=ODL ) /*.01D008 A008 .
1500 053T #DISPLAY.STATUS (008)  (AD=ODL ) /*.01D009 A009 .
1510 063T #DISPLAY.HOLD (008)  (AD=ODL ) /*.01D003 A003 .
1520/
1530 002T #DISPLAY.MARK (009)  (AD=MYLT'_' CV=#CV-MARK(009) ) /*.99D001 A001 .
1540 005T #DISPLAY.JOB-NAME (009)  (AD=ODL ) /*.01D008 A008 .
1550 014T #DISPLAY.JOB-NUMBER (009)  (AD=ODL ) /*.01D005 N05.0.
1560 021T #DISPLAY.QUEUE (009)  (AD=ODL ) /*.01D003 A003 .
1570 027T #DISPLAY.CLASS (009)  (AD=ODL AL=001  ) /*.01D001 A008 .
1580 029T #DISPLAY.DISP (009)  (AD=ODL ) /*.01D001 A001 .
1590 031T #DISPLAY.PRIORITY (009)  (AD=ODL ) /*.01D003 N03.0.
1600 036T #DISPLAY.RECORD-COUNT (009)  (AD=ODL ) /*.01D007 N07.0.
1610 044T #DISPLAY.DESTINATION (009)  (AD=ODL ) /*.01D008 A008 .
1620 053T #DISPLAY.STATUS (009)  (AD=ODL ) /*.01D009 A009 .
1630 063T #DISPLAY.HOLD (009)  (AD=ODL ) /*.01D003 A003 .
1640/
1650 002T #DISPLAY.MARK (010)  (AD=MYLT'_' CV=#CV-MARK(010) ) /*.99D001 A001 .
1660 005T #DISPLAY.JOB-NAME (010)  (AD=ODL ) /*.01D008 A008 .
1670 014T #DISPLAY.JOB-NUMBER (010)  (AD=ODL ) /*.01D005 N05.0.
1680 021T #DISPLAY.QUEUE (010)  (AD=ODL ) /*.01D003 A003 .
1690 027T #DISPLAY.CLASS (010)  (AD=ODL AL=001  ) /*.01D001 A008 .
1700 029T #DISPLAY.DISP (010)  (AD=ODL ) /*.01D001 A001 .
1710 031T #DISPLAY.PRIORITY (010)  (AD=ODL ) /*.01D003 N03.0.
1720 036T #DISPLAY.RECORD-COUNT (010)  (AD=ODL ) /*.01D007 N07.0.
1730 044T #DISPLAY.DESTINATION (010)  (AD=ODL ) /*.01D008 A008 .
1740 053T #DISPLAY.STATUS (010)  (AD=ODL ) /*.01D009 A009 .
1750 063T #DISPLAY.HOLD (010)  (AD=ODL ) /*.01D003 A003 .
1760/
1770 002T #DISPLAY.MARK (011)  (AD=MYLT'_' CV=#CV-MARK(011) ) /*.99D001 A001 .
1780 005T #DISPLAY.JOB-NAME (011)  (AD=ODL ) /*.01D008 A008 .
1790 014T #DISPLAY.JOB-NUMBER (011)  (AD=ODL ) /*.01D005 N05.0.
1800 021T #DISPLAY.QUEUE (011)  (AD=ODL ) /*.01D003 A003 .
1810 027T #DISPLAY.CLASS (011)  (AD=ODL AL=001  ) /*.01D001 A008 .
1820 029T #DISPLAY.DISP (011)  (AD=ODL ) /*.01D001 A001 .
1830 031T #DISPLAY.PRIORITY (011)  (AD=ODL ) /*.01D003 N03.0.
1840 036T #DISPLAY.RECORD-COUNT (011)  (AD=ODL ) /*.01D007 N07.0.
1850 044T #DISPLAY.DESTINATION (011)  (AD=ODL ) /*.01D008 A008 .
1860 053T #DISPLAY.STATUS (011)  (AD=ODL ) /*.01D009 A009 .
1870 063T #DISPLAY.HOLD (011)  (AD=ODL ) /*.01D003 A003 .
1880/
1890 002T #DISPLAY.MARK (012)  (AD=MYLT'_' CV=#CV-MARK(012) ) /*.99D001 A001 .
1900 005T #DISPLAY.JOB-NAME (012)  (AD=ODL ) /*.01D008 A008 .
1910 014T #DISPLAY.JOB-NUMBER (012)  (AD=ODL ) /*.01D005 N05.0.
1920 021T #DISPLAY.QUEUE (012)  (AD=ODL ) /*.01D003 A003 .
1930 027T #DISPLAY.CLASS (012)  (AD=ODL AL=001  ) /*.01D001 A008 .
1940 029T #DISPLAY.DISP (012)  (AD=ODL ) /*.01D001 A001 .
1950 031T #DISPLAY.PRIORITY (012)  (AD=ODL ) /*.01D003 N03.0.
1960 036T #DISPLAY.RECORD-COUNT (012)  (AD=ODL ) /*.01D007 N07.0.
1970 044T #DISPLAY.DESTINATION (012)  (AD=ODL ) /*.01D008 A008 .
1980 053T #DISPLAY.STATUS (012)  (AD=ODL ) /*.01D009 A009 .
1990 063T #DISPLAY.HOLD (012)  (AD=ODL ) /*.01D003 A003 .
2000/
2010 002T #DISPLAY.MARK (013)  (AD=MYLT'_' CV=#CV-MARK(013) ) /*.99D001 A001 .
2020 005T #DISPLAY.JOB-NAME (013)  (AD=ODL ) /*.01D008 A008 .
2030 014T #DISPLAY.JOB-NUMBER (013)  (AD=ODL ) /*.01D005 N05.0.
2040 021T #DISPLAY.QUEUE (013)  (AD=ODL ) /*.01D003 A003 .
2050 027T #DISPLAY.CLASS (013)  (AD=ODL AL=001  ) /*.01D001 A008 .
2060 029T #DISPLAY.DISP (013)  (AD=ODL ) /*.01D001 A001 .
2070 031T #DISPLAY.PRIORITY (013)  (AD=ODL ) /*.01D003 N03.0.
2080 036T #DISPLAY.RECORD-COUNT (013)  (AD=ODL ) /*.01D007 N07.0.
2090 044T #DISPLAY.DESTINATION (013)  (AD=ODL ) /*.01D008 A008 .
2100 053T #DISPLAY.STATUS (013)  (AD=ODL ) /*.01D009 A009 .
2110 063T #DISPLAY.HOLD (013)  (AD=ODL ) /*.01D003 A003 .
2120/
2130 002T #DISPLAY.MARK (014)  (AD=MYLT'_' CV=#CV-MARK(014) ) /*.99D001 A001 .
2140 005T #DISPLAY.JOB-NAME (014)  (AD=ODL ) /*.01D008 A008 .
2150 014T #DISPLAY.JOB-NUMBER (014)  (AD=ODL ) /*.01D005 N05.0.
2160 021T #DISPLAY.QUEUE (014)  (AD=ODL ) /*.01D003 A003 .
2170 027T #DISPLAY.CLASS (014)  (AD=ODL AL=001  ) /*.01D001 A008 .
2180 029T #DISPLAY.DISP (014)  (AD=ODL ) /*.01D001 A001 .
2190 031T #DISPLAY.PRIORITY (014)  (AD=ODL ) /*.01D003 N03.0.
2200 036T #DISPLAY.RECORD-COUNT (014)  (AD=ODL ) /*.01D007 N07.0.
2210 044T #DISPLAY.DESTINATION (014)  (AD=ODL ) /*.01D008 A008 .
2220 053T #DISPLAY.STATUS (014)  (AD=ODL ) /*.01D009 A009 .
2230 063T #DISPLAY.HOLD (014)  (AD=ODL ) /*.01D003 A003 .
2240/
2250 002T #DISPLAY.MARK (015)  (AD=MYLT'_' CV=#CV-MARK(015) ) /*.99D001 A001 .
2260 005T #DISPLAY.JOB-NAME (015)  (AD=ODL ) /*.01D008 A008 .
2270 014T #DISPLAY.JOB-NUMBER (015)  (AD=ODL ) /*.01D005 N05.0.
2280 021T #DISPLAY.QUEUE (015)  (AD=ODL ) /*.01D003 A003 .
2290 027T #DISPLAY.CLASS (015)  (AD=ODL AL=001  ) /*.01D001 A008 .
2300 029T #DISPLAY.DISP (015)  (AD=ODL ) /*.01D001 A001 .
2310 031T #DISPLAY.PRIORITY (015)  (AD=ODL ) /*.01D003 N03.0.
2320 036T #DISPLAY.RECORD-COUNT (015)  (AD=ODL ) /*.01D007 N07.0.
2330 044T #DISPLAY.DESTINATION (015)  (AD=ODL ) /*.01D008 A008 .
2340 053T #DISPLAY.STATUS (015)  (AD=ODL ) /*.01D009 A009 .
2350 063T #DISPLAY.HOLD (015)  (AD=ODL ) /*.01D003 A003 .
2360/
2370/
2380* MAP2: VALIDATION *****************************************************
2390* MAP2: END OF MAP *****************************************************
2400END
