0010* MAP2: PROTOTYPE
0020* INPUT USING MAP 'XXXXXXXX'
0030*     ##TITLE #CV-MARK(*) #CVAR #DISPLAY.CLASS(*)
0040*     #DISPLAY.DESTINATION(*) #DISPLAY.DISP(*) #DISPLAY.HOLD(*)
0050*     #DISPLAY.JOB-NAME(*) #DISPLAY.JOB-NUMBER(*) #DISPLAY.MARK(*)
0060*     #DISPLAY.PRIORITY(*) #DISPLAY.QUEUE(*) #DISPLAY.RECORD-COUNT(*)
0070*     #DISPLAY.STATUS(*) #JOB-NAME #QUEUE
0080DEFINE DATA PARAMETER
00901 ##TITLE (A078)
01001  #CV-MARK (C/00001:00015)
01101  #CVAR (C)
01201 #DISPLAY.CLASS (A008/00001:00015)
01301 #DISPLAY.DESTINATION (A008/00001:00015)
01401 #DISPLAY.DISP (A001/00001:00015)
01501 #DISPLAY.HOLD (A003/00001:00015)
01601 #DISPLAY.JOB-NAME (A008/00001:00015)
01701 #DISPLAY.JOB-NUMBER (N05.0/00001:00015)
01801 #DISPLAY.MARK (A001/00001:00015)
01901 #DISPLAY.PRIORITY (N03.0/00001:00015)
02001 #DISPLAY.QUEUE (A003/00001:00015)
02101 #DISPLAY.RECORD-COUNT (N07.0/00001:00015)
02201 #DISPLAY.STATUS (A009/00001:00015)
02301 #JOB-NAME (A008)
02401 #QUEUE (A003)
0250END-DEFINE
0260FORMAT PS=021 LS=080 ZP=OFF SG=OFF KD=ON  IP=OFF
0270* MAP2: MAP PROFILES *****************************        410***********
0280* .TTAAAMMOO   D I D I N D I D I        ?_)¬&:+(                       *
0290* 023079        N0NNUCN             X        01 SYSPROF YL   #CVAR   1 *
0300************************************************************************
0310INPUT          (     CV=#CVAR                                         /*
0320                                                                       )
0330 002T ##TITLE  (AD=ODL ) /*.01D078 A078 .
0340/
0350/
0360 005T 'Job-Name Nummer Queue C D Prio Zeilen'
0370 044T 'Dest'
0380 053T 'Status'
0390 063T 'gehalten'
0400/
0410 005T #JOB-NAME  (AD=MYLT'_' CV=#CVAR ) /*.99D008 A008 .
0420 014T '______'
0430 021T #QUEUE  (AD=MYLT'_' CV=#CVAR ) /*.99U003 A003 .
0440 025T '_ _ _ ___'
0450 036T '_______ ________ _________ ________'
0460/
0470 002T #DISPLAY.MARK (001)  (AD=MYLT'_' CV=#CV-MARK(001) ) /*.99D001 A001 .
0480   /**A1000150000100001000010000100001100015001001000001000HV
0490 005T #DISPLAY.JOB-NAME (001)  (AD=ODL ) /*.01D008 A008 .
0500   /**A1000150000100001000010000100001100015001001000001000HV
0510 014T #DISPLAY.JOB-NUMBER (001)  (AD=ODL ) /*.01D005 N05.0.
0520   /**A1000150000100001000010000100001100015001001000001000HV
0530 021T #DISPLAY.QUEUE (001)  (AD=ODL ) /*.01D003 A003 .
0540   /**A1000150000100001000010000100001100015001001000001000HV
0550 027T #DISPLAY.CLASS (001)  (AD=ODL AL=001  ) /*.01D001 A008 .
0560   /**A1000150000100001000010000100001100015001001000001000HV
0570 029T #DISPLAY.DISP (001)  (AD=ODL ) /*.01D001 A001 .
0580   /**A1000150000100001000010000100001100015001001000001000HV
0590 031T #DISPLAY.PRIORITY (001)  (AD=ODL ) /*.01D003 N03.0.
0600   /**A1000150000100001000010000100001100015001001000001000HV
0610 036T #DISPLAY.RECORD-COUNT (001)  (AD=ODL ) /*.01D007 N07.0.
0620   /**A1000150000100001000010000100001100015001001000001000HV
0630 044T #DISPLAY.DESTINATION (001)  (AD=ODL ) /*.01D008 A008 .
0640   /**A1000150000100001000010000100001100015001001000001000HV
0650 053T #DISPLAY.STATUS (001)  (AD=ODL ) /*.01D009 A009 .
0660   /**A1000150000100001000010000100001100015001001000001000HV
0670 063T #DISPLAY.HOLD (001)  (AD=ODL ) /*.01D003 A003 .
0680   /**A1000150000100001000010000100001100015001001000001000HV
0690/
0700 002T #DISPLAY.MARK (002)  (AD=MYLT'_' CV=#CV-MARK(002) ) /*.99D001 A001 .
0710 005T #DISPLAY.JOB-NAME (002)  (AD=ODL ) /*.01D008 A008 .
0720 014T #DISPLAY.JOB-NUMBER (002)  (AD=ODL ) /*.01D005 N05.0.
0730 021T #DISPLAY.QUEUE (002)  (AD=ODL ) /*.01D003 A003 .
0740 027T #DISPLAY.CLASS (002)  (AD=ODL AL=001  ) /*.01D001 A008 .
0750 029T #DISPLAY.DISP (002)  (AD=ODL ) /*.01D001 A001 .
0760 031T #DISPLAY.PRIORITY (002)  (AD=ODL ) /*.01D003 N03.0.
0770 036T #DISPLAY.RECORD-COUNT (002)  (AD=ODL ) /*.01D007 N07.0.
0780 044T #DISPLAY.DESTINATION (002)  (AD=ODL ) /*.01D008 A008 .
0790 053T #DISPLAY.STATUS (002)  (AD=ODL ) /*.01D009 A009 .
0800 063T #DISPLAY.HOLD (002)  (AD=ODL ) /*.01D003 A003 .
0810/
0820 002T #DISPLAY.MARK (003)  (AD=MYLT'_' CV=#CV-MARK(003) ) /*.99D001 A001 .
0830 005T #DISPLAY.JOB-NAME (003)  (AD=ODL ) /*.01D008 A008 .
0840 014T #DISPLAY.JOB-NUMBER (003)  (AD=ODL ) /*.01D005 N05.0.
0850 021T #DISPLAY.QUEUE (003)  (AD=ODL ) /*.01D003 A003 .
0860 027T #DISPLAY.CLASS (003)  (AD=ODL AL=001  ) /*.01D001 A008 .
0870 029T #DISPLAY.DISP (003)  (AD=ODL ) /*.01D001 A001 .
0880 031T #DISPLAY.PRIORITY (003)  (AD=ODL ) /*.01D003 N03.0.
0890 036T #DISPLAY.RECORD-COUNT (003)  (AD=ODL ) /*.01D007 N07.0.
0900 044T #DISPLAY.DESTINATION (003)  (AD=ODL ) /*.01D008 A008 .
0910 053T #DISPLAY.STATUS (003)  (AD=ODL ) /*.01D009 A009 .
0920 063T #DISPLAY.HOLD (003)  (AD=ODL ) /*.01D003 A003 .
0930/
0940 002T #DISPLAY.MARK (004)  (AD=MYLT'_' CV=#CV-MARK(004) ) /*.99D001 A001 .
0950 005T #DISPLAY.JOB-NAME (004)  (AD=ODL ) /*.01D008 A008 .
0960 014T #DISPLAY.JOB-NUMBER (004)  (AD=ODL ) /*.01D005 N05.0.
0970 021T #DISPLAY.QUEUE (004)  (AD=ODL ) /*.01D003 A003 .
0980 027T #DISPLAY.CLASS (004)  (AD=ODL AL=001  ) /*.01D001 A008 .
0990 029T #DISPLAY.DISP (004)  (AD=ODL ) /*.01D001 A001 .
1000 031T #DISPLAY.PRIORITY (004)  (AD=ODL ) /*.01D003 N03.0.
1010 036T #DISPLAY.RECORD-COUNT (004)  (AD=ODL ) /*.01D007 N07.0.
1020 044T #DISPLAY.DESTINATION (004)  (AD=ODL ) /*.01D008 A008 .
1030 053T #DISPLAY.STATUS (004)  (AD=ODL ) /*.01D009 A009 .
1040 063T #DISPLAY.HOLD (004)  (AD=ODL ) /*.01D003 A003 .
1050/
1060 002T #DISPLAY.MARK (005)  (AD=MYLT'_' CV=#CV-MARK(005) ) /*.99D001 A001 .
1070 005T #DISPLAY.JOB-NAME (005)  (AD=ODL ) /*.01D008 A008 .
1080 014T #DISPLAY.JOB-NUMBER (005)  (AD=ODL ) /*.01D005 N05.0.
1090 021T #DISPLAY.QUEUE (005)  (AD=ODL ) /*.01D003 A003 .
1100 027T #DISPLAY.CLASS (005)  (AD=ODL AL=001  ) /*.01D001 A008 .
1110 029T #DISPLAY.DISP (005)  (AD=ODL ) /*.01D001 A001 .
1120 031T #DISPLAY.PRIORITY (005)  (AD=ODL ) /*.01D003 N03.0.
1130 036T #DISPLAY.RECORD-COUNT (005)  (AD=ODL ) /*.01D007 N07.0.
1140 044T #DISPLAY.DESTINATION (005)  (AD=ODL ) /*.01D008 A008 .
1150 053T #DISPLAY.STATUS (005)  (AD=ODL ) /*.01D009 A009 .
1160 063T #DISPLAY.HOLD (005)  (AD=ODL ) /*.01D003 A003 .
1170/
1180 002T #DISPLAY.MARK (006)  (AD=MYLT'_' CV=#CV-MARK(006) ) /*.99D001 A001 .
1190 005T #DISPLAY.JOB-NAME (006)  (AD=ODL ) /*.01D008 A008 .
1200 014T #DISPLAY.JOB-NUMBER (006)  (AD=ODL ) /*.01D005 N05.0.
1210 021T #DISPLAY.QUEUE (006)  (AD=ODL ) /*.01D003 A003 .
1220 027T #DISPLAY.CLASS (006)  (AD=ODL AL=001  ) /*.01D001 A008 .
1230 029T #DISPLAY.DISP (006)  (AD=ODL ) /*.01D001 A001 .
1240 031T #DISPLAY.PRIORITY (006)  (AD=ODL ) /*.01D003 N03.0.
1250 036T #DISPLAY.RECORD-COUNT (006)  (AD=ODL ) /*.01D007 N07.0.
1260 044T #DISPLAY.DESTINATION (006)  (AD=ODL ) /*.01D008 A008 .
1270 053T #DISPLAY.STATUS (006)  (AD=ODL ) /*.01D009 A009 .
1280 063T #DISPLAY.HOLD (006)  (AD=ODL ) /*.01D003 A003 .
1290/
1300 002T #DISPLAY.MARK (007)  (AD=MYLT'_' CV=#CV-MARK(007) ) /*.99D001 A001 .
1310 005T #DISPLAY.JOB-NAME (007)  (AD=ODL ) /*.01D008 A008 .
1320 014T #DISPLAY.JOB-NUMBER (007)  (AD=ODL ) /*.01D005 N05.0.
1330 021T #DISPLAY.QUEUE (007)  (AD=ODL ) /*.01D003 A003 .
1340 027T #DISPLAY.CLASS (007)  (AD=ODL AL=001  ) /*.01D001 A008 .
1350 029T #DISPLAY.DISP (007)  (AD=ODL ) /*.01D001 A001 .
1360 031T #DISPLAY.PRIORITY (007)  (AD=ODL ) /*.01D003 N03.0.
1370 036T #DISPLAY.RECORD-COUNT (007)  (AD=ODL ) /*.01D007 N07.0.
1380 044T #DISPLAY.DESTINATION (007)  (AD=ODL ) /*.01D008 A008 .
1390 053T #DISPLAY.STATUS (007)  (AD=ODL ) /*.01D009 A009 .
1400 063T #DISPLAY.HOLD (007)  (AD=ODL ) /*.01D003 A003 .
1410/
1420 002T #DISPLAY.MARK (008)  (AD=MYLT'_' CV=#CV-MARK(008) ) /*.99D001 A001 .
1430 005T #DISPLAY.JOB-NAME (008)  (AD=ODL ) /*.01D008 A008 .
1440 014T #DISPLAY.JOB-NUMBER (008)  (AD=ODL ) /*.01D005 N05.0.
1450 021T #DISPLAY.QUEUE (008)  (AD=ODL ) /*.01D003 A003 .
1460 027T #DISPLAY.CLASS (008)  (AD=ODL AL=001  ) /*.01D001 A008 .
1470 029T #DISPLAY.DISP (008)  (AD=ODL ) /*.01D001 A001 .
1480 031T #DISPLAY.PRIORITY (008)  (AD=ODL ) /*.01D003 N03.0.
1490 036T #DISPLAY.RECORD-COUNT (008)  (AD=ODL ) /*.01D007 N07.0.
1500 044T #DISPLAY.DESTINATION (008)  (AD=ODL ) /*.01D008 A008 .
1510 053T #DISPLAY.STATUS (008)  (AD=ODL ) /*.01D009 A009 .
1520 063T #DISPLAY.HOLD (008)  (AD=ODL ) /*.01D003 A003 .
1530/
1540 002T #DISPLAY.MARK (009)  (AD=MYLT'_' CV=#CV-MARK(009) ) /*.99D001 A001 .
1550 005T #DISPLAY.JOB-NAME (009)  (AD=ODL ) /*.01D008 A008 .
1560 014T #DISPLAY.JOB-NUMBER (009)  (AD=ODL ) /*.01D005 N05.0.
1570 021T #DISPLAY.QUEUE (009)  (AD=ODL ) /*.01D003 A003 .
1580 027T #DISPLAY.CLASS (009)  (AD=ODL AL=001  ) /*.01D001 A008 .
1590 029T #DISPLAY.DISP (009)  (AD=ODL ) /*.01D001 A001 .
1600 031T #DISPLAY.PRIORITY (009)  (AD=ODL ) /*.01D003 N03.0.
1610 036T #DISPLAY.RECORD-COUNT (009)  (AD=ODL ) /*.01D007 N07.0.
1620 044T #DISPLAY.DESTINATION (009)  (AD=ODL ) /*.01D008 A008 .
1630 053T #DISPLAY.STATUS (009)  (AD=ODL ) /*.01D009 A009 .
1640 063T #DISPLAY.HOLD (009)  (AD=ODL ) /*.01D003 A003 .
1650/
1660 002T #DISPLAY.MARK (010)  (AD=MYLT'_' CV=#CV-MARK(010) ) /*.99D001 A001 .
1670 005T #DISPLAY.JOB-NAME (010)  (AD=ODL ) /*.01D008 A008 .
1680 014T #DISPLAY.JOB-NUMBER (010)  (AD=ODL ) /*.01D005 N05.0.
1690 021T #DISPLAY.QUEUE (010)  (AD=ODL ) /*.01D003 A003 .
1700 027T #DISPLAY.CLASS (010)  (AD=ODL AL=001  ) /*.01D001 A008 .
1710 029T #DISPLAY.DISP (010)  (AD=ODL ) /*.01D001 A001 .
1720 031T #DISPLAY.PRIORITY (010)  (AD=ODL ) /*.01D003 N03.0.
1730 036T #DISPLAY.RECORD-COUNT (010)  (AD=ODL ) /*.01D007 N07.0.
1740 044T #DISPLAY.DESTINATION (010)  (AD=ODL ) /*.01D008 A008 .
1750 053T #DISPLAY.STATUS (010)  (AD=ODL ) /*.01D009 A009 .
1760 063T #DISPLAY.HOLD (010)  (AD=ODL ) /*.01D003 A003 .
1770/
1780 002T #DISPLAY.MARK (011)  (AD=MYLT'_' CV=#CV-MARK(011) ) /*.99D001 A001 .
1790 005T #DISPLAY.JOB-NAME (011)  (AD=ODL ) /*.01D008 A008 .
1800 014T #DISPLAY.JOB-NUMBER (011)  (AD=ODL ) /*.01D005 N05.0.
1810 021T #DISPLAY.QUEUE (011)  (AD=ODL ) /*.01D003 A003 .
1820 027T #DISPLAY.CLASS (011)  (AD=ODL AL=001  ) /*.01D001 A008 .
1830 029T #DISPLAY.DISP (011)  (AD=ODL ) /*.01D001 A001 .
1840 031T #DISPLAY.PRIORITY (011)  (AD=ODL ) /*.01D003 N03.0.
1850 036T #DISPLAY.RECORD-COUNT (011)  (AD=ODL ) /*.01D007 N07.0.
1860 044T #DISPLAY.DESTINATION (011)  (AD=ODL ) /*.01D008 A008 .
1870 053T #DISPLAY.STATUS (011)  (AD=ODL ) /*.01D009 A009 .
1880 063T #DISPLAY.HOLD (011)  (AD=ODL ) /*.01D003 A003 .
1890/
1900 002T #DISPLAY.MARK (012)  (AD=MYLT'_' CV=#CV-MARK(012) ) /*.99D001 A001 .
1910 005T #DISPLAY.JOB-NAME (012)  (AD=ODL ) /*.01D008 A008 .
1920 014T #DISPLAY.JOB-NUMBER (012)  (AD=ODL ) /*.01D005 N05.0.
1930 021T #DISPLAY.QUEUE (012)  (AD=ODL ) /*.01D003 A003 .
1940 027T #DISPLAY.CLASS (012)  (AD=ODL AL=001  ) /*.01D001 A008 .
1950 029T #DISPLAY.DISP (012)  (AD=ODL ) /*.01D001 A001 .
1960 031T #DISPLAY.PRIORITY (012)  (AD=ODL ) /*.01D003 N03.0.
1970 036T #DISPLAY.RECORD-COUNT (012)  (AD=ODL ) /*.01D007 N07.0.
1980 044T #DISPLAY.DESTINATION (012)  (AD=ODL ) /*.01D008 A008 .
1990 053T #DISPLAY.STATUS (012)  (AD=ODL ) /*.01D009 A009 .
2000 063T #DISPLAY.HOLD (012)  (AD=ODL ) /*.01D003 A003 .
2010/
2020 002T #DISPLAY.MARK (013)  (AD=MYLT'_' CV=#CV-MARK(013) ) /*.99D001 A001 .
2030 005T #DISPLAY.JOB-NAME (013)  (AD=ODL ) /*.01D008 A008 .
2040 014T #DISPLAY.JOB-NUMBER (013)  (AD=ODL ) /*.01D005 N05.0.
2050 021T #DISPLAY.QUEUE (013)  (AD=ODL ) /*.01D003 A003 .
2060 027T #DISPLAY.CLASS (013)  (AD=ODL AL=001  ) /*.01D001 A008 .
2070 029T #DISPLAY.DISP (013)  (AD=ODL ) /*.01D001 A001 .
2080 031T #DISPLAY.PRIORITY (013)  (AD=ODL ) /*.01D003 N03.0.
2090 036T #DISPLAY.RECORD-COUNT (013)  (AD=ODL ) /*.01D007 N07.0.
2100 044T #DISPLAY.DESTINATION (013)  (AD=ODL ) /*.01D008 A008 .
2110 053T #DISPLAY.STATUS (013)  (AD=ODL ) /*.01D009 A009 .
2120 063T #DISPLAY.HOLD (013)  (AD=ODL ) /*.01D003 A003 .
2130/
2140 002T #DISPLAY.MARK (014)  (AD=MYLT'_' CV=#CV-MARK(014) ) /*.99D001 A001 .
2150 005T #DISPLAY.JOB-NAME (014)  (AD=ODL ) /*.01D008 A008 .
2160 014T #DISPLAY.JOB-NUMBER (014)  (AD=ODL ) /*.01D005 N05.0.
2170 021T #DISPLAY.QUEUE (014)  (AD=ODL ) /*.01D003 A003 .
2180 027T #DISPLAY.CLASS (014)  (AD=ODL AL=001  ) /*.01D001 A008 .
2190 029T #DISPLAY.DISP (014)  (AD=ODL ) /*.01D001 A001 .
2200 031T #DISPLAY.PRIORITY (014)  (AD=ODL ) /*.01D003 N03.0.
2210 036T #DISPLAY.RECORD-COUNT (014)  (AD=ODL ) /*.01D007 N07.0.
2220 044T #DISPLAY.DESTINATION (014)  (AD=ODL ) /*.01D008 A008 .
2230 053T #DISPLAY.STATUS (014)  (AD=ODL ) /*.01D009 A009 .
2240 063T #DISPLAY.HOLD (014)  (AD=ODL ) /*.01D003 A003 .
2250/
2260 002T #DISPLAY.MARK (015)  (AD=MYLT'_' CV=#CV-MARK(015) ) /*.99D001 A001 .
2270 005T #DISPLAY.JOB-NAME (015)  (AD=ODL ) /*.01D008 A008 .
2280 014T #DISPLAY.JOB-NUMBER (015)  (AD=ODL ) /*.01D005 N05.0.
2290 021T #DISPLAY.QUEUE (015)  (AD=ODL ) /*.01D003 A003 .
2300 027T #DISPLAY.CLASS (015)  (AD=ODL AL=001  ) /*.01D001 A008 .
2310 029T #DISPLAY.DISP (015)  (AD=ODL ) /*.01D001 A001 .
2320 031T #DISPLAY.PRIORITY (015)  (AD=ODL ) /*.01D003 N03.0.
2330 036T #DISPLAY.RECORD-COUNT (015)  (AD=ODL ) /*.01D007 N07.0.
2340 044T #DISPLAY.DESTINATION (015)  (AD=ODL ) /*.01D008 A008 .
2350 053T #DISPLAY.STATUS (015)  (AD=ODL ) /*.01D009 A009 .
2360 063T #DISPLAY.HOLD (015)  (AD=ODL ) /*.01D003 A003 .
2370/
2380/
2390* MAP2: VALIDATION *****************************************************
2400* MAP2: END OF MAP *****************************************************
2410END
