0010* MAP2: PROTOTYPE
0020* INPUT USING MAP 'XXXXXXXX'
0030*     ##TITLE SYSTEM-INFO.#CPU-ID SYSTEM-INFO.#MODEL
0040*     SYSTEM-INFO.AUTO-LOGON SYSTEM-INFO.ESY-VERSION
0050*     SYSTEM-INFO.GMT-DIFFERENCE SYSTEM-INFO.LAST-IPL-DATX
0060*     SYSTEM-INFO.LAST-IPL-TIMX SYSTEM-INFO.LOCAL-DATX
0070*     SYSTEM-INFO.LOCAL-TIMX SYSTEM-INFO.NODE-ID
0080*     SYSTEM-INFO.PRODUCT-NAME SYSTEM-INFO.PRODUCT-VERSION
0090*     SYSTEM-INFO.SECURITY SYSTEM-INFO.SPOOL-RELEASE
0100*     SYSTEM-INFO.SPOOL-TYPE SYSTEM-INFO.SYSTEM-ID
0110*     SYSTEM-INFO.SYSTEM-RELEASE SYSTEM-INFO.SYSTEM-TYPE
0120DEFINE DATA PARAMETER
01301 ##TITLE (A078)
01401 SYSTEM-INFO.#CPU-ID (A008)
01501 SYSTEM-INFO.#MODEL (A004)
01601 SYSTEM-INFO.AUTO-LOGON (A003)
01701 SYSTEM-INFO.ESY-VERSION (A008)
01801 SYSTEM-INFO.GMT-DIFFERENCE (N03.0)
01901 SYSTEM-INFO.LAST-IPL-DATX (D)
02001 SYSTEM-INFO.LAST-IPL-TIMX (T)
02101 SYSTEM-INFO.LOCAL-DATX (D)
02201 SYSTEM-INFO.LOCAL-TIMX (T)
02301 SYSTEM-INFO.NODE-ID (A050)
02401 SYSTEM-INFO.PRODUCT-NAME (A016)
02501 SYSTEM-INFO.PRODUCT-VERSION (A008)
02601 SYSTEM-INFO.SECURITY (A004)
02701 SYSTEM-INFO.SPOOL-RELEASE (A008)
02801 SYSTEM-INFO.SPOOL-TYPE (A008)
02901 SYSTEM-INFO.SYSTEM-ID (A016)
03001 SYSTEM-INFO.SYSTEM-RELEASE (A008)
03101 SYSTEM-INFO.SYSTEM-TYPE (A008)
0320END-DEFINE
0330FORMAT PS=021 LS=080 ZP=OFF SG=OFF KD=ON  IP=OFF
0340* MAP2: MAP PROFILES *****************************        410***********
0350* .TTAAAMMOO   D I D I N D I D I        ?_)¬&:+(                       *
0360* 023079        N0NNUCN             X        01 SYSPROF YL           1 *
0370************************************************************************
0380INPUT          (     IP=OFF                                           /*
0390                                                                       )
0400 002T ##TITLE  (AD=ODL ) /*.01D078 A078 .
0410/
0420/
0430 004T 'System'
0440/
0450 007T 'ID .............'
0460 024T SYSTEM-INFO.SYSTEM-ID  (AD=OIL CD=NE ) /*.01U016 A016 .
0470 049T 'Local Date .........'
0480 070T SYSTEM-INFO.LOCAL-DATX  (AD=OIL EM=YYYY-MM-DD ) /*.01D010 D    .
0490/
0500 007T 'Type ...........'
0510 024T SYSTEM-INFO.SYSTEM-TYPE  (AD=OIL CD=NE ) /*.01D008 A008 .
0520 049T 'Local Time .........'
0530 070T SYSTEM-INFO.LOCAL-TIMX  (AD=OIL EM=HH:II:SS ) /*.01D008 T    .
0540/
0550 007T 'Release ........'
0560 024T SYSTEM-INFO.SYSTEM-RELEASE  (AD=OIL CD=NE ) /*.01D008 A008 .
0570 049T 'Difference to GMT ..'
0580 070T SYSTEM-INFO.GMT-DIFFERENCE  (AD=OIL EM=SZZ9 ) /*.01D004 N03.0.
0590/
0600 007T 'Product Name ...'
0610 024T SYSTEM-INFO.PRODUCT-NAME  (AD=OI ) /*.01U016 A016 .
0620 049T 'Date of last IPL ...'
0630 070T SYSTEM-INFO.LAST-IPL-DATX  (AD=OIL EM=YYYY-MM-DD ) /*.01D010 D    .
0640/
0650 007T 'Product Version'
0660 024T SYSTEM-INFO.PRODUCT-VERSION  (AD=OI ) /*.01U008 A008 .
0670 049T 'Time of last IPL ...'
0680 070T SYSTEM-INFO.LAST-IPL-TIMX  (AD=OIL ) /*.01D008 T    .
0690/
0700 007T 'CPU ID .........'
0710 024T SYSTEM-INFO.#CPU-ID  (AD=OIL CD=NE ) /*.01D008 A008 .
0720/
0730 007T 'Model ..........'
0740 024T SYSTEM-INFO.#MODEL  (AD=OIL CD=NE ) /*.01D004 A004 .
0750/
0760/
0770 004T 'Spool'
0780/
0790 007T 'Type ...........'
0800 024T SYSTEM-INFO.SPOOL-TYPE  (AD=OIL CD=NE ) /*.01D008 A008 .
0810/
0820 007T 'Release ........'
0830 024T SYSTEM-INFO.SPOOL-RELEASE  (AD=OIL CD=NE ) /*.01D008 A008 .
0840/
0850/
0860 004T 'ENTIRE SYSTEM SERVER'
0870/
0880 007T 'Identifier .....'
0890 024T SYSTEM-INFO.NODE-ID  (AD=OIL CD=NE ) /*.01D050 A050 .
0900/
0910 007T 'Version ........'
0920 024T SYSTEM-INFO.ESY-VERSION  (AD=OIL CD=NE ) /*.01U008 A008 .
0930/
0940 007T 'Security .......'
0950 024T SYSTEM-INFO.SECURITY  (AD=OIL CD=NE ) /*.01D004 A004 .
0960/
0970 007T 'Auto Logon .....'
0980 024T SYSTEM-INFO.AUTO-LOGON  (AD=OIL CD=NE ) /*.01D003 A003 .
0990/
1000* MAP2: VALIDATION *****************************************************
1010RULEVAR D01SYSTEM-INFO.SYSTEM-ID
1020* CDIR SYSTEM-INFO                      SYSTEM-ID                       ;
1030RULEVAR D01SYSTEM-INFO.LOCAL-DATX
1040* CDIR SYSTEM-INFO                      LOCAL-DATX                      ;
1050RULEVAR D01SYSTEM-INFO.SYSTEM-TYPE
1060* CDIR SYSTEM-INFO                      SYSTEM-TYPE                     ;
1070RULEVAR D01SYSTEM-INFO.LOCAL-TIMX
1080* CDIR SYSTEM-INFO                      LOCAL-TIMX                      ;
1090RULEVAR D01SYSTEM-INFO.SYSTEM-RELEASE
1100* CDIR SYSTEM-INFO                      SYSTEM-RELEASE                  ;
1110RULEVAR D01SYSTEM-INFO.GMT-DIFFERENCE
1120* CDIR SYSTEM-INFO                      GMT-DIFFERENCE                  ;
1130RULEVAR D01SYSTEM-INFO.LAST-IPL-DATX
1140* CDIR SYSTEM-INFO                      LAST-IPL-DATX                   ;
1150RULEVAR D01SYSTEM-INFO.LAST-IPL-TIMX
1160* CDIR SYSTEM-INFO                      LAST-IPL-TIMX                   ;
1170RULEVAR D01SYSTEM-INFO.#CPU-ID
1180* CDIR SYSTEM-INFO                      #CPU-ID                         ;
1190RULEVAR D01SYSTEM-INFO.#MODEL
1200* CDIR SYSTEM-INFO                      #MODEL                          ;
1210RULEVAR D01SYSTEM-INFO.SPOOL-TYPE
1220* CDIR SYSTEM-INFO                      SPOOL-TYPE                      ;
1230RULEVAR D01SYSTEM-INFO.SPOOL-RELEASE
1240* CDIR SYSTEM-INFO                      SPOOL-RELEASE                   ;
1250RULEVAR D01SYSTEM-INFO.NODE-ID
1260* CDIR SYSTEM-INFO                      NODE-ID                         ;
1270RULEVAR D01SYSTEM-INFO.ESY-VERSION
1280* CDIR SYSTEM-INFO                      NPR-VERSION                     ;
1290RULEVAR D01SYSTEM-INFO.SECURITY
1300* CDIR SYSTEM-INFO                      SECURITY                        ;
1310RULEVAR D01SYSTEM-INFO.AUTO-LOGON
1320* CDIR SYSTEM-INFO                      AUTO-LOGON                      ;
1330* MAP2: END OF MAP *****************************************************
1340END
