0010* VTOC Maintenance
0020*
0030DEFINE DATA
0040   GLOBAL USING TUTO
0050   LOCAL USING VTOC-U-L
0060END-DEFINE
0070*
0080INPUT (AD=MI'_')
0090   / ##TITLE (AD=OI IP=OFF)
0100  // '  Function..:' VTOC-UPDATE.FUNCTION '(RENAME/SCRATCH/PURGE)'
0110  // '  Volume....:' VTOC-UPDATE.VOLSER
0120   / '  Dsname....:' VTOC-UPDATE.DSNAME
0130  // '  New Name..:' VTOC-UPDATE.NEWNAME
0140*
0150PROCESS VTOC-UPDATE USING NODE     = ##NODE
0160                      ,   DSNAME   = VTOC-UPDATE.DSNAME
0170                      ,   VOLSER   = VTOC-UPDATE.VOLSER
0180                      ,   FUNCTION = VTOC-UPDATE.FUNCTION
0190                      ,   NEWNAME  = VTOC-UPDATE.NEWNAME
0200                   GIVING ERROR-CODE
0210                          ERROR-TEXT
0220IF ERROR-CODE > 0
0230   REINPUT ERROR-TEXT
0240ELSE
0250   REINPUT *1007
0260END-IF
0270END
