0010* MAP2: PROTOTYPE
0020* INPUT USING MAP 'XXXXXXXX'
0030*     #REC(*) #SIG(*) SEND-EMAIL.CC-RECIPIENT(*)
0040*     SEND-EMAIL.RECIPIENT(*) SEND-EMAIL.SUBJECT
0050DEFINE DATA PARAMETER
00601 #REC (A072/00001:00006)
00701 #SIG (A064/00001:00004)
00801 SEND-EMAIL.CC-RECIPIENT (A128/00001:00002)
00901 SEND-EMAIL.RECIPIENT (A128/00001:00002)
01001 SEND-EMAIL.SUBJECT (A128)
0110END-DEFINE
0120FORMAT PS=023 LS=080 ZP=OFF SG=OFF KD=OFF IP=OFF
0130* MAP2: MAP PROFILES *****************************        410***********
0140* .TTAAAMMOO   D I D I N D I D I        ?_@¬&;+#                       *
0150* 023079        N0NNUCN             X        01 SYSPROF NL             *
0160************************************************************************
0170INPUT          (     IP=OFF                                           /*
0180                                                                       )
0190/
0200 023T 'Senden einer e-mail auf das Internet'(I)
0210/
0220 029T '(lower case acceptable)'
0230/
0240/
0250 002T 'An:'(I)
0260 007T '(1)'(I)
0270 011T SEND-EMAIL.RECIPIENT (001)  (AD=MIL'_' AL=064  ) /*.99U064 A128 .
0280   /**A1000020000100001000010000100001100002001001000001000HV
0290/
0300 007T '(2)'
0310 011T SEND-EMAIL.RECIPIENT (002)  (AD=MIL'_' AL=064  ) /*.99U064 A128 .
0320/
0330 002T 'Cc:'(I)
0340 007T '(1)'(I)
0350 011T SEND-EMAIL.CC-RECIPIENT (001)  (AD=MIL'_' AL=064  ) /*.99U064 A128 .
0360   /**A1000020000100001000010000100001100002001001000001000HV
0370/
0380 007T '(2)'
0390 011T SEND-EMAIL.CC-RECIPIENT (002)  (AD=MIL'_' AL=064  ) /*.99U064 A128 .
0400/
0410 002T 'Betreff:'(I)
0420 011T SEND-EMAIL.SUBJECT  (AD=MIL'_' AL=064  ) /*.99U064 A128 .
0430/
0440/
0450 002T 'Nachricht:'(I)
0460/
0470 002T #REC (001)  (AD=MIL'_' ) /*.99D072 A072 .
0480   /**A1000060000100001000010000100001100006001001000001000HV
0490/
0500 002T #REC (002)  (AD=MIL'_' ) /*.99D072 A072 .
0510/
0520 002T #REC (003)  (AD=MIL'_' ) /*.99D072 A072 .
0530/
0540 002T #REC (004)  (AD=MIL'_' ) /*.99D072 A072 .
0550/
0560 002T #REC (005)  (AD=MIL'_' ) /*.99D072 A072 .
0570/
0580 002T #REC (006)  (AD=MIL'_' ) /*.99D072 A072 .
0590/
0600 002T '(.sig)'(I)
0610 011T #SIG (001)  (AD=MIL'_' ) /*.99D064 A064 .
0620   /**A1000040000100001000010000100001100004001001000001000HV
0630/
0640 011T #SIG (002)  (AD=MIL'_' ) /*.99D064 A064 .
0650/
0660 011T #SIG (003)  (AD=MIL'_' ) /*.99D064 A064 .
0670/
0680 011T #SIG (004)  (AD=MIL'_' ) /*.99D064 A064 .
0690/
0700/
0710* MAP2: VALIDATION *****************************************************
0720* MAP2: END OF MAP *****************************************************
0730END
