0010* HEX-SUB  subtract OFFSET TO ADDRESS HEXADECIMAL
0020*
0030DEFINE DATA
0040   PARAMETER 1 #ADDRESS    (B4)
0050             1 #OFFSET     (B4)
0060   LOCAL     1 #ADDRESS-P  (P12)
0070             1 #OFFSET-P   (P12)
0080END-DEFINE
0090*
0100ASSIGN #ADDRESS-P = #ADDRESS
0110ASSIGN #OFFSET-P  = #OFFSET
0120*
0130SUBTRACT #OFFSET-P FROM #ADDRESS-P
0140*
0150ASSIGN #ADDRESS = #ADDRESS-P
0160*
0170END
