0010* HEX-ADD  ADD OFFSET TO ADDRESS HEXADECIMAL             STL 2012-02-29
0020*
0030DEFINE DATA
0040   PARAMETER 1 #ADDRESS    (B8)
0050             1 #OFFSET     (B4)
0060   LOCAL     1 #ADDRESS-P  (P12)
0070             1 #OFFSET-P   (P12)
0080             1 #ADDRESS-G  (B8)
0090             1 REDEFINE #ADDRESS-G
0100              2 #ADDRESS-HF (B4)
0110              2 #ADDRESS-LF (B4)
0120END-DEFINE
0130*
0140MOVE   #ADDRESS  TO #ADDRESS-G
0150ASSIGN #ADDRESS-P = #ADDRESS-LF
0160ASSIGN #OFFSET-P  = #OFFSET
0170*
0180ADD #OFFSET-P TO #ADDRESS-P
0190*
0200ASSIGN #ADDRESS-LF = #ADDRESS-P
0210*
0220IF #ADDRESS-G < #ADDRESS                     /* handle carry
0230THEN ASSIGN #ADDRESS-P  = #ADDRESS-HF
0240     ASSIGN #ADDRESS-P  = #ADDRESS-P  + 1
0250     ASSIGN #ADDRESS-HF = #ADDRESS-P
0260END-IF
0270*
0280MOVE  #ADDRESS-G TO #ADDRESS
0290*
0300END
