0010* MAP2: PROTOTYPE
0020* INPUT USING MAP 'XXXXXXXX'
0030*     ##TITLE #CV-CC(*) #CVAR #DISPLAY.CC(*) #DISPLAY.JOB-NAME(*)
0040*     #DISPLAY.SRB(*) #DISPLAY.START(*) #DISPLAY.STOP(*)
0050*     #DISPLAY.TCB(*) #DSNAME #VOLSER
0060DEFINE DATA PARAMETER
00701 ##TITLE (A078)
00801  #CV-CC (C/00001:00013)
00901  #CVAR (C)
01001 #DISPLAY.CC (B002/00001:00013)
01101 #DISPLAY.JOB-NAME (A008/00001:00013)
01201 #DISPLAY.SRB (T/00001:00013)
01301 #DISPLAY.START (T/00001:00013)
01401 #DISPLAY.STOP (T/00001:00013)
01501 #DISPLAY.TCB (T/00001:00013)
01601 #DSNAME (A044)
01701 #VOLSER (A006)
0180END-DEFINE
0190FORMAT PS=021 LS=080 ZP=OFF SG=OFF KD=ON  IP=OFF
0200* MAP2: MAP PROFILES *****************************        410***********
0210* .TTAAAMMOO   D I D I N D I D I        ?_)¬&:+(                       *
0220* 023079        N0NNUCN             X        01 SYSPROF YL   #CVAR   1 *
0230************************************************************************
0240INPUT          (     CV=#CVAR                                         /*
0250                                                                       )
0260 002T ##TITLE  (AD=ODL ) /*.01D078 A078 .
0270/
0280/
0290 005T 'Dsname ......'
0300 019T #DSNAME  (AD=MYLT'_' CD=NE ) /*.99U044 A044 .
0310/
0320 005T 'Volser ......'
0330 019T #VOLSER  (AD=MYLT'_' CD=NE ) /*.99U006 A006 .
0340/
0350/
0360 005T 'Job-Name Code Start-Date/-Time'
0370 039T 'Stop-Date /-Time'
0380 059T 'SRB Cpu'
0390 070T 'TCB Cpu'
0400/
0410 005T '________ ____ __________ ________ __________ ________ __________ __________'
0420/
0430 005T #DISPLAY.JOB-NAME (1+000)  (AD=OYL CD=NE CV=#CV-CC(1+000) ) /*.01U008 A008 .
0440   /**A1000130000100001000010000100001100013001001000000000VV
0450 014T #DISPLAY.CC (1+000)  (AD=OYL CD=NE CV=#CV-CC(1+000) ) /*.01U004 B002 .
0460   /**A1000130000100001000010000100001100013001001000004004VV
0470 019T #DISPLAY.START (1+000)  (AD=ODL EM=YYYY-MM-DD CD=NE ) /*.01U010 T    .
0480   /**A1000130000100001000010000100001100013001001000001001HV
0490 030T #DISPLAY.START (1+000)  (AD=ODL CD=NE ) /*.02U008 T    .
0500   /**A1000130000100001000010000100001100013001001000001000HV
0510 039T #DISPLAY.STOP (001)  (AD=ODL EM=YYYY-MM-DD ) /*.02D010 T    .
0520   /**A1000130000100001000010000100001100013001001000001000HV
0530 050T #DISPLAY.STOP (1+000)  (AD=ODL CD=NE ) /*.01U008 T    .
0540   /**A1000130000100001000010000100001100013001001000001000HV
0550 059T #DISPLAY.SRB (1+000)  (AD=ODL EM=HH:II:SS.T CD=NE ) /*.01U010 T    .
0560   /**A1000130000100001000010000100001100013001001000001001HV
0570 070T #DISPLAY.TCB (1+000)  (AD=ODL EM=HH:II:SS.T CD=NE ) /*.01U010 T    .
0580   /**A1000130000100001000010000100001100013001001000001001HV
0590/
0600 005T #DISPLAY.JOB-NAME (1+001)  (AD=OYL CD=NE CV=#CV-CC(1+001) ) /*.01U008 A008 .
0610 014T #DISPLAY.CC (1+001)  (AD=OYL CD=NE CV=#CV-CC(1+001) ) /*.01U004 B002 .
0620 019T #DISPLAY.START (1+001)  (AD=ODL EM=YYYY-MM-DD CD=NE ) /*.01U010 T    .
0630 030T #DISPLAY.START (1+001)  (AD=ODL CD=NE ) /*.02U008 T    .
0640 039T #DISPLAY.STOP (002)  (AD=ODL EM=YYYY-MM-DD ) /*.02D010 T    .
0650 050T #DISPLAY.STOP (1+001)  (AD=ODL CD=NE ) /*.01U008 T    .
0660 059T #DISPLAY.SRB (1+001)  (AD=ODL EM=HH:II:SS.T CD=NE ) /*.01U010 T    .
0670 070T #DISPLAY.TCB (1+001)  (AD=ODL EM=HH:II:SS.T CD=NE ) /*.01U010 T    .
0680/
0690 005T #DISPLAY.JOB-NAME (1+002)  (AD=OYL CD=NE CV=#CV-CC(1+002) ) /*.01U008 A008 .
0700 014T #DISPLAY.CC (1+002)  (AD=OYL CD=NE CV=#CV-CC(1+002) ) /*.01U004 B002 .
0710 019T #DISPLAY.START (1+002)  (AD=ODL EM=YYYY-MM-DD CD=NE ) /*.01U010 T    .
0720 030T #DISPLAY.START (1+002)  (AD=ODL CD=NE ) /*.02U008 T    .
0730 039T #DISPLAY.STOP (003)  (AD=ODL EM=YYYY-MM-DD ) /*.02D010 T    .
0740 050T #DISPLAY.STOP (1+002)  (AD=ODL CD=NE ) /*.01U008 T    .
0750 059T #DISPLAY.SRB (1+002)  (AD=ODL EM=HH:II:SS.T CD=NE ) /*.01U010 T    .
0760 070T #DISPLAY.TCB (1+002)  (AD=ODL EM=HH:II:SS.T CD=NE ) /*.01U010 T    .
0770/
0780 005T #DISPLAY.JOB-NAME (1+003)  (AD=OYL CD=NE CV=#CV-CC(1+003) ) /*.01U008 A008 .
0790 014T #DISPLAY.CC (1+003)  (AD=OYL CD=NE CV=#CV-CC(1+003) ) /*.01U004 B002 .
0800 019T #DISPLAY.START (1+003)  (AD=ODL EM=YYYY-MM-DD CD=NE ) /*.01U010 T    .
0810 030T #DISPLAY.START (1+003)  (AD=ODL CD=NE ) /*.02U008 T    .
0820 039T #DISPLAY.STOP (004)  (AD=ODL EM=YYYY-MM-DD ) /*.02D010 T    .
0830 050T #DISPLAY.STOP (1+003)  (AD=ODL CD=NE ) /*.01U008 T    .
0840 059T #DISPLAY.SRB (1+003)  (AD=ODL EM=HH:II:SS.T CD=NE ) /*.01U010 T    .
0850 070T #DISPLAY.TCB (1+003)  (AD=ODL EM=HH:II:SS.T CD=NE ) /*.01U010 T    .
0860/
0870 005T #DISPLAY.JOB-NAME (1+004)  (AD=OYL CD=NE CV=#CV-CC(1+004) ) /*.01U008 A008 .
0880 014T #DISPLAY.CC (1+004)  (AD=OYL CD=NE CV=#CV-CC(1+004) ) /*.01U004 B002 .
0890 019T #DISPLAY.START (1+004)  (AD=ODL EM=YYYY-MM-DD CD=NE ) /*.01U010 T    .
0900 030T #DISPLAY.START (1+004)  (AD=ODL CD=NE ) /*.02U008 T    .
0910 039T #DISPLAY.STOP (005)  (AD=ODL EM=YYYY-MM-DD ) /*.02D010 T    .
0920 050T #DISPLAY.STOP (1+004)  (AD=ODL CD=NE ) /*.01U008 T    .
0930 059T #DISPLAY.SRB (1+004)  (AD=ODL EM=HH:II:SS.T CD=NE ) /*.01U010 T    .
0940 070T #DISPLAY.TCB (1+004)  (AD=ODL EM=HH:II:SS.T CD=NE ) /*.01U010 T    .
0950/
0960 005T #DISPLAY.JOB-NAME (1+005)  (AD=OYL CD=NE CV=#CV-CC(1+005) ) /*.01U008 A008 .
0970 014T #DISPLAY.CC (1+005)  (AD=OYL CD=NE CV=#CV-CC(1+005) ) /*.01U004 B002 .
0980 019T #DISPLAY.START (1+005)  (AD=ODL EM=YYYY-MM-DD CD=NE ) /*.01U010 T    .
0990 030T #DISPLAY.START (1+005)  (AD=ODL CD=NE ) /*.02U008 T    .
1000 039T #DISPLAY.STOP (006)  (AD=ODL EM=YYYY-MM-DD ) /*.02D010 T    .
1010 050T #DISPLAY.STOP (1+005)  (AD=ODL CD=NE ) /*.01U008 T    .
1020 059T #DISPLAY.SRB (1+005)  (AD=ODL EM=HH:II:SS.T CD=NE ) /*.01U010 T    .
1030 070T #DISPLAY.TCB (1+005)  (AD=ODL EM=HH:II:SS.T CD=NE ) /*.01U010 T    .
1040/
1050 005T #DISPLAY.JOB-NAME (1+006)  (AD=OYL CD=NE CV=#CV-CC(1+006) ) /*.01U008 A008 .
1060 014T #DISPLAY.CC (1+006)  (AD=OYL CD=NE CV=#CV-CC(1+006) ) /*.01U004 B002 .
1070 019T #DISPLAY.START (1+006)  (AD=ODL EM=YYYY-MM-DD CD=NE ) /*.01U010 T    .
1080 030T #DISPLAY.START (1+006)  (AD=ODL CD=NE ) /*.02U008 T    .
1090 039T #DISPLAY.STOP (007)  (AD=ODL EM=YYYY-MM-DD ) /*.02D010 T    .
1100 050T #DISPLAY.STOP (1+006)  (AD=ODL CD=NE ) /*.01U008 T    .
1110 059T #DISPLAY.SRB (1+006)  (AD=ODL EM=HH:II:SS.T CD=NE ) /*.01U010 T    .
1120 070T #DISPLAY.TCB (1+006)  (AD=ODL EM=HH:II:SS.T CD=NE ) /*.01U010 T    .
1130/
1140 005T #DISPLAY.JOB-NAME (1+007)  (AD=OYL CD=NE CV=#CV-CC(1+007) ) /*.01U008 A008 .
1150 014T #DISPLAY.CC (1+007)  (AD=OYL CD=NE CV=#CV-CC(1+007) ) /*.01U004 B002 .
1160 019T #DISPLAY.START (1+007)  (AD=ODL EM=YYYY-MM-DD CD=NE ) /*.01U010 T    .
1170 030T #DISPLAY.START (1+007)  (AD=ODL CD=NE ) /*.02U008 T    .
1180 039T #DISPLAY.STOP (008)  (AD=ODL EM=YYYY-MM-DD ) /*.02D010 T    .
1190 050T #DISPLAY.STOP (1+007)  (AD=ODL CD=NE ) /*.01U008 T    .
1200 059T #DISPLAY.SRB (1+007)  (AD=ODL EM=HH:II:SS.T CD=NE ) /*.01U010 T    .
1210 070T #DISPLAY.TCB (1+007)  (AD=ODL EM=HH:II:SS.T CD=NE ) /*.01U010 T    .
1220/
1230 005T #DISPLAY.JOB-NAME (1+008)  (AD=OYL CD=NE CV=#CV-CC(1+008) ) /*.01U008 A008 .
1240 014T #DISPLAY.CC (1+008)  (AD=OYL CD=NE CV=#CV-CC(1+008) ) /*.01U004 B002 .
1250 019T #DISPLAY.START (1+008)  (AD=ODL EM=YYYY-MM-DD CD=NE ) /*.01U010 T    .
1260 030T #DISPLAY.START (1+008)  (AD=ODL CD=NE ) /*.02U008 T    .
1270 039T #DISPLAY.STOP (009)  (AD=ODL EM=YYYY-MM-DD ) /*.02D010 T    .
1280 050T #DISPLAY.STOP (1+008)  (AD=ODL CD=NE ) /*.01U008 T    .
1290 059T #DISPLAY.SRB (1+008)  (AD=ODL EM=HH:II:SS.T CD=NE ) /*.01U010 T    .
1300 070T #DISPLAY.TCB (1+008)  (AD=ODL EM=HH:II:SS.T CD=NE ) /*.01U010 T    .
1310/
1320 005T #DISPLAY.JOB-NAME (1+009)  (AD=OYL CD=NE CV=#CV-CC(1+009) ) /*.01U008 A008 .
1330 014T #DISPLAY.CC (1+009)  (AD=OYL CD=NE CV=#CV-CC(1+009) ) /*.01U004 B002 .
1340 019T #DISPLAY.START (1+009)  (AD=ODL EM=YYYY-MM-DD CD=NE ) /*.01U010 T    .
1350 030T #DISPLAY.START (1+009)  (AD=ODL CD=NE ) /*.02U008 T    .
1360 039T #DISPLAY.STOP (010)  (AD=ODL EM=YYYY-MM-DD ) /*.02D010 T    .
1370 050T #DISPLAY.STOP (1+009)  (AD=ODL CD=NE ) /*.01U008 T    .
1380 059T #DISPLAY.SRB (1+009)  (AD=ODL EM=HH:II:SS.T CD=NE ) /*.01U010 T    .
1390 070T #DISPLAY.TCB (1+009)  (AD=ODL EM=HH:II:SS.T CD=NE ) /*.01U010 T    .
1400/
1410 005T #DISPLAY.JOB-NAME (1+010)  (AD=OYL CD=NE CV=#CV-CC(1+010) ) /*.01U008 A008 .
1420 014T #DISPLAY.CC (1+010)  (AD=OYL CD=NE CV=#CV-CC(1+010) ) /*.01U004 B002 .
1430 019T #DISPLAY.START (1+010)  (AD=ODL EM=YYYY-MM-DD CD=NE ) /*.01U010 T    .
1440 030T #DISPLAY.START (1+010)  (AD=ODL CD=NE ) /*.02U008 T    .
1450 039T #DISPLAY.STOP (011)  (AD=ODL EM=YYYY-MM-DD ) /*.02D010 T    .
1460 050T #DISPLAY.STOP (1+010)  (AD=ODL CD=NE ) /*.01U008 T    .
1470 059T #DISPLAY.SRB (1+010)  (AD=ODL EM=HH:II:SS.T CD=NE ) /*.01U010 T    .
1480 070T #DISPLAY.TCB (1+010)  (AD=ODL EM=HH:II:SS.T CD=NE ) /*.01U010 T    .
1490/
1500 005T #DISPLAY.JOB-NAME (1+011)  (AD=OYL CD=NE CV=#CV-CC(1+011) ) /*.01U008 A008 .
1510 014T #DISPLAY.CC (1+011)  (AD=OYL CD=NE CV=#CV-CC(1+011) ) /*.01U004 B002 .
1520 019T #DISPLAY.START (1+011)  (AD=ODL EM=YYYY-MM-DD CD=NE ) /*.01U010 T    .
1530 030T #DISPLAY.START (1+011)  (AD=ODL CD=NE ) /*.02U008 T    .
1540 039T #DISPLAY.STOP (012)  (AD=ODL EM=YYYY-MM-DD ) /*.02D010 T    .
1550 050T #DISPLAY.STOP (1+011)  (AD=ODL CD=NE ) /*.01U008 T    .
1560 059T #DISPLAY.SRB (1+011)  (AD=ODL EM=HH:II:SS.T CD=NE ) /*.01U010 T    .
1570 070T #DISPLAY.TCB (1+011)  (AD=ODL EM=HH:II:SS.T CD=NE ) /*.01U010 T    .
1580/
1590 005T #DISPLAY.JOB-NAME (1+012)  (AD=OYL CD=NE CV=#CV-CC(1+012) ) /*.01U008 A008 .
1600 014T #DISPLAY.CC (1+012)  (AD=OYL CD=NE CV=#CV-CC(1+012) ) /*.01U004 B002 .
1610 019T #DISPLAY.START (1+012)  (AD=ODL EM=YYYY-MM-DD CD=NE ) /*.01U010 T    .
1620 030T #DISPLAY.START (1+012)  (AD=ODL CD=NE ) /*.02U008 T    .
1630 039T #DISPLAY.STOP (013)  (AD=ODL EM=YYYY-MM-DD ) /*.02D010 T    .
1640 050T #DISPLAY.STOP (1+012)  (AD=ODL CD=NE ) /*.01U008 T    .
1650 059T #DISPLAY.SRB (1+012)  (AD=ODL EM=HH:II:SS.T CD=NE ) /*.01U010 T    .
1660 070T #DISPLAY.TCB (1+012)  (AD=ODL EM=HH:II:SS.T CD=NE ) /*.01U010 T    .
1670/
1680* MAP2: VALIDATION *****************************************************
1690RULEVAR D01#DISPLAY.JOB-NAME
1700* CDIR ACCOUNTING                       JOB-NAME                        ;
1710RULEVAR D01#DISPLAY.CC
1720* CDIR ACCOUNTING                       #CC                             ;
1730RULEVAR D01#DISPLAY.STOP
1740* CDIR ACCOUNTING                       ERROR-CODE                      ;
1750RULEVAR D01#DISPLAY.SRB
1760* CDIR ACCOUNTING                       ERROR-CODE                      ;
1770RULEVAR D01#DISPLAY.TCB
1780* CDIR ACCOUNTING                       ERROR-CODE                      ;
1790* MAP2: END OF MAP *****************************************************
1800END
