0010* MAP2: PROTOTYPE
0020* INPUT USING MAP 'XXXXXXXX'
0030*     ##TITLE #CPU #CVAR #DISPLAY.CPU-USED(*) #DISPLAY.JOB-NAME(*)
0040*     #DISPLAY.JOB-NUMBER(*) #DISPLAY.PROC-NAME(*) #DISPLAY.REGION(*)
0050*     #DISPLAY.STATUS(*) #DISPLAY.STEP-NAME(*) #DISPLAY.TYPE(*)
0060*     #JOB-NAME #STATUS #TYPE
0070DEFINE DATA PARAMETER
00801 ##TITLE (A078)
00901 #CPU (N07.2)
01001  #CVAR (C)
01101 #DISPLAY.CPU-USED (N07.2/00001:00015)
01201 #DISPLAY.JOB-NAME (A008/00001:00015)
01301 #DISPLAY.JOB-NUMBER (N07.0/00001:00015)
01401 #DISPLAY.PROC-NAME (A008/00001:00015)
01501 #DISPLAY.REGION (N07.0/00001:00015)
01601 #DISPLAY.STATUS (A008/00001:00015)
01701 #DISPLAY.STEP-NAME (A008/00001:00015)
01801 #DISPLAY.TYPE (A006/00001:00015)
01901 #JOB-NAME (A008)
02001 #STATUS (A008)
02101 #TYPE (A006)
0220END-DEFINE
0230FORMAT PS=021 LS=080 ZP=OFF SG=OFF KD=ON  IP=OFF
0240* MAP2: MAP PROFILES *****************************        410***********
0250* .TTAAAMMOO   D I D I N D I D I        ?_)¬&:+(                       *
0260* 023079        N0NNUCN             X        01 SYSPROF YL   #CVAR   1 *
0270************************************************************************
0280INPUT          (     CV=#CVAR                                         /*
0290                                                                       )
0300 002T ##TITLE  (AD=ODL ) /*.01D078 A078 .
0310/
0320/
0330 004T 'Job-Name Type'
0340 020T 'Status'
0350 030T 'CPU used'
0360 041T 'Region'
0370 049T 'Job-Nr. ProcName StepName'
0380/
0390 004T #JOB-NAME  (AD=MYLT'_' CV=#CVAR ) /*.99D008 A008 .
0400 013T #TYPE  (AD=MYLT'_' CV=#CVAR ) /*.99D006 A006 .
0410 020T #STATUS  (AD=MYLT'_' CV=#CVAR ) /*.99D008 A008 .
0420 029T #CPU  (AD=MYRT'_' CV=#CVAR ) /*.99D010 N07.2.
0430 040T '________ _______ ________ ________'
0440/
0450 004T #DISPLAY.JOB-NAME (1+000)  (AD=ODL ) /*.01D008 A008 .
0460   /* A1000150000100001000010000100001100015001000001H
0470 013T #DISPLAY.TYPE (1+000)  (AD=ODL ) /*.01D006 A006 .
0480   /* A1000150000100001000010000100001100015001000001H
0490 020T #DISPLAY.STATUS (1+000)  (AD=ODL ) /*.01D008 A008 .
0500   /* A1000150000100001000010000100001100015001000001H
0510 029T #DISPLAY.CPU-USED (1+000)  (AD=ODR ) /*.01U010 N07.2.
0520   /* A1000150000100001000010000100001100015001000001H
0530 041T #DISPLAY.REGION (1)  (AD=ODR ) /*.01U007 N07.0           .
0540   /**A1000150000100001000010000100001100015001001000001000HV
0550 049T #DISPLAY.JOB-NUMBER (001)  (AD=ODL EM=ZZZZZZZ ) /*.01U007 N07.0.
0560   /**A1000150000100001000010000100001100015001001000001000HV
0570 057T #DISPLAY.PROC-NAME (1+000)  (AD=ODL ) /*.01D008 A008 .
0580   /* A1000150000100001000010000100001100015001000001H
0590 066T #DISPLAY.STEP-NAME (1+000)  (AD=ODL ) /*.01D008 A008 .
0600   /* A1000150000100001000010000100001100015001000001H
0610/
0620 004T #DISPLAY.JOB-NAME (1+001)  (AD=ODL ) /*.01D008 A008 .
0630 013T #DISPLAY.TYPE (1+001)  (AD=ODL ) /*.01D006 A006 .
0640 020T #DISPLAY.STATUS (1+001)  (AD=ODL ) /*.01D008 A008 .
0650 029T #DISPLAY.CPU-USED (1+001)  (AD=ODR ) /*.01U010 N07.2.
0660 041T #DISPLAY.REGION (2)  (AD=ODR ) /*.01U007 N07.0           .
0670 049T #DISPLAY.JOB-NUMBER (002)  (AD=ODL EM=ZZZZZZZ ) /*.01U007 N07.0.
0680 057T #DISPLAY.PROC-NAME (1+001)  (AD=ODL ) /*.01D008 A008 .
0690 066T #DISPLAY.STEP-NAME (1+001)  (AD=ODL ) /*.01D008 A008 .
0700/
0710 004T #DISPLAY.JOB-NAME (1+002)  (AD=ODL ) /*.01D008 A008 .
0720 013T #DISPLAY.TYPE (1+002)  (AD=ODL ) /*.01D006 A006 .
0730 020T #DISPLAY.STATUS (1+002)  (AD=ODL ) /*.01D008 A008 .
0740 029T #DISPLAY.CPU-USED (1+002)  (AD=ODR ) /*.01U010 N07.2.
0750 041T #DISPLAY.REGION (3)  (AD=ODR ) /*.01U007 N07.0           .
0760 049T #DISPLAY.JOB-NUMBER (003)  (AD=ODL EM=ZZZZZZZ ) /*.01U007 N07.0.
0770 057T #DISPLAY.PROC-NAME (1+002)  (AD=ODL ) /*.01D008 A008 .
0780 066T #DISPLAY.STEP-NAME (1+002)  (AD=ODL ) /*.01D008 A008 .
0790/
0800 004T #DISPLAY.JOB-NAME (1+003)  (AD=ODL ) /*.01D008 A008 .
0810 013T #DISPLAY.TYPE (1+003)  (AD=ODL ) /*.01D006 A006 .
0820 020T #DISPLAY.STATUS (1+003)  (AD=ODL ) /*.01D008 A008 .
0830 029T #DISPLAY.CPU-USED (1+003)  (AD=ODR ) /*.01U010 N07.2.
0840 041T #DISPLAY.REGION (4)  (AD=ODR ) /*.01U007 N07.0           .
0850 049T #DISPLAY.JOB-NUMBER (004)  (AD=ODL EM=ZZZZZZZ ) /*.01U007 N07.0.
0860 057T #DISPLAY.PROC-NAME (1+003)  (AD=ODL ) /*.01D008 A008 .
0870 066T #DISPLAY.STEP-NAME (1+003)  (AD=ODL ) /*.01D008 A008 .
0880/
0890 004T #DISPLAY.JOB-NAME (1+004)  (AD=ODL ) /*.01D008 A008 .
0900 013T #DISPLAY.TYPE (1+004)  (AD=ODL ) /*.01D006 A006 .
0910 020T #DISPLAY.STATUS (1+004)  (AD=ODL ) /*.01D008 A008 .
0920 029T #DISPLAY.CPU-USED (1+004)  (AD=ODR ) /*.01U010 N07.2.
0930 041T #DISPLAY.REGION (5)  (AD=ODR ) /*.01U007 N07.0           .
0940 049T #DISPLAY.JOB-NUMBER (005)  (AD=ODL EM=ZZZZZZZ ) /*.01U007 N07.0.
0950 057T #DISPLAY.PROC-NAME (1+004)  (AD=ODL ) /*.01D008 A008 .
0960 066T #DISPLAY.STEP-NAME (1+004)  (AD=ODL ) /*.01D008 A008 .
0970/
0980 004T #DISPLAY.JOB-NAME (1+005)  (AD=ODL ) /*.01D008 A008 .
0990 013T #DISPLAY.TYPE (1+005)  (AD=ODL ) /*.01D006 A006 .
1000 020T #DISPLAY.STATUS (1+005)  (AD=ODL ) /*.01D008 A008 .
1010 029T #DISPLAY.CPU-USED (1+005)  (AD=ODR ) /*.01U010 N07.2.
1020 041T #DISPLAY.REGION (6)  (AD=ODR ) /*.01U007 N07.0           .
1030 049T #DISPLAY.JOB-NUMBER (006)  (AD=ODL EM=ZZZZZZZ ) /*.01U007 N07.0.
1040 057T #DISPLAY.PROC-NAME (1+005)  (AD=ODL ) /*.01D008 A008 .
1050 066T #DISPLAY.STEP-NAME (1+005)  (AD=ODL ) /*.01D008 A008 .
1060/
1070 004T #DISPLAY.JOB-NAME (1+006)  (AD=ODL ) /*.01D008 A008 .
1080 013T #DISPLAY.TYPE (1+006)  (AD=ODL ) /*.01D006 A006 .
1090 020T #DISPLAY.STATUS (1+006)  (AD=ODL ) /*.01D008 A008 .
1100 029T #DISPLAY.CPU-USED (1+006)  (AD=ODR ) /*.01U010 N07.2.
1110 041T #DISPLAY.REGION (7)  (AD=ODR ) /*.01U007 N07.0           .
1120 049T #DISPLAY.JOB-NUMBER (007)  (AD=ODL EM=ZZZZZZZ ) /*.01U007 N07.0.
1130 057T #DISPLAY.PROC-NAME (1+006)  (AD=ODL ) /*.01D008 A008 .
1140 066T #DISPLAY.STEP-NAME (1+006)  (AD=ODL ) /*.01D008 A008 .
1150/
1160 004T #DISPLAY.JOB-NAME (1+007)  (AD=ODL ) /*.01D008 A008 .
1170 013T #DISPLAY.TYPE (1+007)  (AD=ODL ) /*.01D006 A006 .
1180 020T #DISPLAY.STATUS (1+007)  (AD=ODL ) /*.01D008 A008 .
1190 029T #DISPLAY.CPU-USED (1+007)  (AD=ODR ) /*.01U010 N07.2.
1200 041T #DISPLAY.REGION (8)  (AD=ODR ) /*.01U007 N07.0           .
1210 049T #DISPLAY.JOB-NUMBER (008)  (AD=ODL EM=ZZZZZZZ ) /*.01U007 N07.0.
1220 057T #DISPLAY.PROC-NAME (1+007)  (AD=ODL ) /*.01D008 A008 .
1230 066T #DISPLAY.STEP-NAME (1+007)  (AD=ODL ) /*.01D008 A008 .
1240/
1250 004T #DISPLAY.JOB-NAME (1+008)  (AD=ODL ) /*.01D008 A008 .
1260 013T #DISPLAY.TYPE (1+008)  (AD=ODL ) /*.01D006 A006 .
1270 020T #DISPLAY.STATUS (1+008)  (AD=ODL ) /*.01D008 A008 .
1280 029T #DISPLAY.CPU-USED (1+008)  (AD=ODR ) /*.01U010 N07.2.
1290 041T #DISPLAY.REGION (9)  (AD=ODR ) /*.01U007 N07.0           .
1300 049T #DISPLAY.JOB-NUMBER (009)  (AD=ODL EM=ZZZZZZZ ) /*.01U007 N07.0.
1310 057T #DISPLAY.PROC-NAME (1+008)  (AD=ODL ) /*.01D008 A008 .
1320 066T #DISPLAY.STEP-NAME (1+008)  (AD=ODL ) /*.01D008 A008 .
1330/
1340 004T #DISPLAY.JOB-NAME (1+009)  (AD=ODL ) /*.01D008 A008 .
1350 013T #DISPLAY.TYPE (1+009)  (AD=ODL ) /*.01D006 A006 .
1360 020T #DISPLAY.STATUS (1+009)  (AD=ODL ) /*.01D008 A008 .
1370 029T #DISPLAY.CPU-USED (1+009)  (AD=ODR ) /*.01U010 N07.2.
1380 041T #DISPLAY.REGION (10)  (AD=ODR ) /*.01U007 N07.0           .
1390 049T #DISPLAY.JOB-NUMBER (010)  (AD=ODL EM=ZZZZZZZ ) /*.01U007 N07.0.
1400 057T #DISPLAY.PROC-NAME (1+009)  (AD=ODL ) /*.01D008 A008 .
1410 066T #DISPLAY.STEP-NAME (1+009)  (AD=ODL ) /*.01D008 A008 .
1420/
1430 004T #DISPLAY.JOB-NAME (1+010)  (AD=ODL ) /*.01D008 A008 .
1440 013T #DISPLAY.TYPE (1+010)  (AD=ODL ) /*.01D006 A006 .
1450 020T #DISPLAY.STATUS (1+010)  (AD=ODL ) /*.01D008 A008 .
1460 029T #DISPLAY.CPU-USED (1+010)  (AD=ODR ) /*.01U010 N07.2.
1470 041T #DISPLAY.REGION (11)  (AD=ODR ) /*.01U007 N07.0           .
1480 049T #DISPLAY.JOB-NUMBER (011)  (AD=ODL EM=ZZZZZZZ ) /*.01U007 N07.0.
1490 057T #DISPLAY.PROC-NAME (1+010)  (AD=ODL ) /*.01D008 A008 .
1500 066T #DISPLAY.STEP-NAME (1+010)  (AD=ODL ) /*.01D008 A008 .
1510/
1520 004T #DISPLAY.JOB-NAME (1+011)  (AD=ODL ) /*.01D008 A008 .
1530 013T #DISPLAY.TYPE (1+011)  (AD=ODL ) /*.01D006 A006 .
1540 020T #DISPLAY.STATUS (1+011)  (AD=ODL ) /*.01D008 A008 .
1550 029T #DISPLAY.CPU-USED (1+011)  (AD=ODR ) /*.01U010 N07.2.
1560 041T #DISPLAY.REGION (12)  (AD=ODR ) /*.01U007 N07.0           .
1570 049T #DISPLAY.JOB-NUMBER (012)  (AD=ODL EM=ZZZZZZZ ) /*.01U007 N07.0.
1580 057T #DISPLAY.PROC-NAME (1+011)  (AD=ODL ) /*.01D008 A008 .
1590 066T #DISPLAY.STEP-NAME (1+011)  (AD=ODL ) /*.01D008 A008 .
1600/
1610 004T #DISPLAY.JOB-NAME (1+012)  (AD=ODL ) /*.01D008 A008 .
1620 013T #DISPLAY.TYPE (1+012)  (AD=ODL ) /*.01D006 A006 .
1630 020T #DISPLAY.STATUS (1+012)  (AD=ODL ) /*.01D008 A008 .
1640 029T #DISPLAY.CPU-USED (1+012)  (AD=ODR ) /*.01U010 N07.2.
1650 041T #DISPLAY.REGION (13)  (AD=ODR ) /*.01U007 N07.0           .
1660 049T #DISPLAY.JOB-NUMBER (013)  (AD=ODL EM=ZZZZZZZ ) /*.01U007 N07.0.
1670 057T #DISPLAY.PROC-NAME (1+012)  (AD=ODL ) /*.01D008 A008 .
1680 066T #DISPLAY.STEP-NAME (1+012)  (AD=ODL ) /*.01D008 A008 .
1690/
1700 004T #DISPLAY.JOB-NAME (1+013)  (AD=ODL ) /*.01D008 A008 .
1710 013T #DISPLAY.TYPE (1+013)  (AD=ODL ) /*.01D006 A006 .
1720 020T #DISPLAY.STATUS (1+013)  (AD=ODL ) /*.01D008 A008 .
1730 029T #DISPLAY.CPU-USED (1+013)  (AD=ODR ) /*.01U010 N07.2.
1740 041T #DISPLAY.REGION (14)  (AD=ODR ) /*.01U007 N07.0           .
1750 049T #DISPLAY.JOB-NUMBER (014)  (AD=ODL EM=ZZZZZZZ ) /*.01U007 N07.0.
1760 057T #DISPLAY.PROC-NAME (1+013)  (AD=ODL ) /*.01D008 A008 .
1770 066T #DISPLAY.STEP-NAME (1+013)  (AD=ODL ) /*.01D008 A008 .
1780/
1790 004T #DISPLAY.JOB-NAME (1+014)  (AD=ODL ) /*.01D008 A008 .
1800 013T #DISPLAY.TYPE (1+014)  (AD=ODL ) /*.01D006 A006 .
1810 020T #DISPLAY.STATUS (1+014)  (AD=ODL ) /*.01D008 A008 .
1820 029T #DISPLAY.CPU-USED (1+014)  (AD=ODR ) /*.01U010 N07.2.
1830 041T #DISPLAY.REGION (15)  (AD=ODR ) /*.01U007 N07.0           .
1840 049T #DISPLAY.JOB-NUMBER (015)  (AD=ODL EM=ZZZZZZZ ) /*.01U007 N07.0.
1850 057T #DISPLAY.PROC-NAME (1+014)  (AD=ODL ) /*.01D008 A008 .
1860 066T #DISPLAY.STEP-NAME (1+014)  (AD=ODL ) /*.01D008 A008 .
1870/
1880/
1890* MAP2: VALIDATION *****************************************************
1900* MAP2: END OF MAP *****************************************************
1910END
