0010* Program   MALLOCS
0020* View      ALLOCATIONS
0030*
0040* Function  Display a list of DD allocations for a given job
0050*
0060* ----------------------------------------------------------------------
0070*
0080DEFINE DATA
0090   GLOBAL USING TUTO
0100   LOCAL  USING ASCB-L
0110   LOCAL  USING ALLOCS-L
0120END-DEFINE
0130FORMAT KD=ON PS=20
0140*
0150REPEAT
0160   INPUT (AD=MI'_')    ##TITLE (AD=OI IP=OFF)
0170                    // '  for job ..:' ADDRESS-SPACE.JOB-NAME
0180*
0190   IF ADDRESS-SPACE.JOB-NAME = ' '
0200      REINPUT *1016
0210   END-IF
0220*
0230   WRITE TITLE
0240      ##TITLE (AD=I)
0250    / 'Job.....'(I) ADDRESS-SPACE.JOB-NAME (AD=I) /
0260*
0270J. FIND (1) ADDRESS-SPACE WITH JOB-NAME = ADDRESS-SPACE.JOB-NAME
0280                               AND NODE = ##NODE
0290*
0300      FIND ALLOCATIONS WITH JOB-NAME    = ADDRESS-SPACE.JOB-NAME
0310                        AND TCB-ADDRESS = ADDRESS-SPACE.TCB
0320                        AND NODE        = ##NODE
0330*
0340         IF ERROR-CODE NE 0
0350            REINPUT ERROR-TEXT
0360         END-IF
0370*
0380         DISPLAY DDNAME CLASS UNIT VOLSER
0390                 DSNAME (AL=27) IO-COUNT ACCESS
0400*
0410      END-FIND
0420   END-FIND
0430*
0440   IF *NUMBER (J.) = 0
0450      REINPUT *1008
0460   END-IF
0470*
0480END-REPEAT
0490END
