0010* MAP2: PROTOTYPE
0020* INPUT USING MAP 'XXXXXXXX'
0030*     ##TITLE #CVAR #DISPLAY.ADR(*) #DISPLAY.ASID(*) #DISPLAY.CPU(*)
0040*     #DISPLAY.DISP(*) #DISPLAY.JOB-NAME(*) #DISPLAY.REGION(*)
0050*     #DISPLAY.STATUS(*) #DISPLAY.TCB-ADR(*) #DISPLAY.TYPE(*) #JOB-NAME
0060*     #STATUS #TYPE
0070DEFINE DATA PARAMETER
00801 ##TITLE (A078)
00901  #CVAR (C)
01001 #DISPLAY.ADR (A008/00001:00015)
01101 #DISPLAY.ASID (N04.0/00001:00015)
01201 #DISPLAY.CPU (N07.2/00001:00015)
01301 #DISPLAY.DISP (A003/00001:00015)
01401 #DISPLAY.JOB-NAME (A008/00001:00015)
01501 #DISPLAY.REGION (N05.0/00001:00015)
01601 #DISPLAY.STATUS (A008/00001:00015)
01701 #DISPLAY.TCB-ADR (A008/00001:00015)
01801 #DISPLAY.TYPE (A006/00001:00015)
01901 #JOB-NAME (A008)
02001 #STATUS (A008)
02101 #TYPE (A006)
0220END-DEFINE
0230FORMAT PS=021 LS=080 ZP=OFF SG=OFF KD=ON  IP=OFF
0240* MAP2: MAP PROFILES *****************************        410***********
0250* .TTAAAMMOO   D I D I N D I D I        ?_)¬&:+(                       *
0260* 023079        N0NNUCN             X        01 SYSPROF YL   #CVAR   1 *
0270************************************************************************
0280INPUT          (     CV=#CVAR                                         /*
0290                                                                       )
0300 002T ##TITLE  (AD=ODL ) /*.01D078 A078 .
0310/
0320/
0330 005T 'Job-Name Adress'
0340 023T 'ASID TCB'
0350 037T 'Status'
0360 046T 'Disp Type'
0370 058T 'CPU used'
0380 069T 'Region'
0390/
0400 005T #JOB-NAME  (AD=MYLT'_' CV=#CVAR ) /*.99D008 A008 .
0410 014T '________ ____ ________'
0420 037T #STATUS  (AD=MYLT CV=#CVAR ) /*.99D008 A008 .
0430 046T '____'
0440 051T #TYPE  (AD=MYLT CV=#CVAR ) /*.99D006 A006 .
0450 058T '__________ ______'
0460/
0470 005T #DISPLAY.JOB-NAME (1+000)  (AD=ODL ) /*.01D008 A008 .
0480   /* A1000150000100001000010000100001100015001000001H
0490 014T #DISPLAY.ADR (1+000)  (AD=ODL ) /*.01D008 A008 .
0500   /* A1000150000100001000010000100001100015001000001H
0510 023T #DISPLAY.ASID (1+000)  (AD=ODR ) /*.01D004 N04.0.
0520   /* A1000150000100001000010000100001100015001000001H
0530 028T #DISPLAY.TCB-ADR (1+000)  (AD=ODL ) /*.01D008 A008 .
0540   /* A1000150000100001000010000100001100015001000001H
0550 037T #DISPLAY.STATUS (1+000)  (AD=ODL ) /*.01D008 A008 .
0560   /* A1000150000100001000010000100001100015001000001H
0570 047T #DISPLAY.DISP (1+000)  (AD=ODL ) /*.01D003 A003 .
0580   /* A1000150000100001000010000100001100015001000001H
0590 051T #DISPLAY.TYPE (1+000)  (AD=ODL ) /*.01D006 A006 .
0600   /* A1000150000100001000010000100001100015001000001H
0610 058T #DISPLAY.CPU (1+000)  (AD=ODR ) /*.01D010 N07.2.
0620   /* A1000150000100001000010000100001100015001000001H
0630 070T #DISPLAY.REGION (1+000)  (AD=ODR ) /*.01D005 N05.0.
0640   /* A1000150000100001000010000100001100015001000001H
0650/
0660 005T #DISPLAY.JOB-NAME (1+001)  (AD=ODL ) /*.01D008 A008 .
0670 014T #DISPLAY.ADR (1+001)  (AD=ODL ) /*.01D008 A008 .
0680 023T #DISPLAY.ASID (1+001)  (AD=ODR ) /*.01D004 N04.0.
0690 028T #DISPLAY.TCB-ADR (1+001)  (AD=ODL ) /*.01D008 A008 .
0700 037T #DISPLAY.STATUS (1+001)  (AD=ODL ) /*.01D008 A008 .
0710 047T #DISPLAY.DISP (1+001)  (AD=ODL ) /*.01D003 A003 .
0720 051T #DISPLAY.TYPE (1+001)  (AD=ODL ) /*.01D006 A006 .
0730 058T #DISPLAY.CPU (1+001)  (AD=ODR ) /*.01D010 N07.2.
0740 070T #DISPLAY.REGION (1+001)  (AD=ODR ) /*.01D005 N05.0.
0750/
0760 005T #DISPLAY.JOB-NAME (1+002)  (AD=ODL ) /*.01D008 A008 .
0770 014T #DISPLAY.ADR (1+002)  (AD=ODL ) /*.01D008 A008 .
0780 023T #DISPLAY.ASID (1+002)  (AD=ODR ) /*.01D004 N04.0.
0790 028T #DISPLAY.TCB-ADR (1+002)  (AD=ODL ) /*.01D008 A008 .
0800 037T #DISPLAY.STATUS (1+002)  (AD=ODL ) /*.01D008 A008 .
0810 047T #DISPLAY.DISP (1+002)  (AD=ODL ) /*.01D003 A003 .
0820 051T #DISPLAY.TYPE (1+002)  (AD=ODL ) /*.01D006 A006 .
0830 058T #DISPLAY.CPU (1+002)  (AD=ODR ) /*.01D010 N07.2.
0840 070T #DISPLAY.REGION (1+002)  (AD=ODR ) /*.01D005 N05.0.
0850/
0860 005T #DISPLAY.JOB-NAME (1+003)  (AD=ODL ) /*.01D008 A008 .
0870 014T #DISPLAY.ADR (1+003)  (AD=ODL ) /*.01D008 A008 .
0880 023T #DISPLAY.ASID (1+003)  (AD=ODR ) /*.01D004 N04.0.
0890 028T #DISPLAY.TCB-ADR (1+003)  (AD=ODL ) /*.01D008 A008 .
0900 037T #DISPLAY.STATUS (1+003)  (AD=ODL ) /*.01D008 A008 .
0910 047T #DISPLAY.DISP (1+003)  (AD=ODL ) /*.01D003 A003 .
0920 051T #DISPLAY.TYPE (1+003)  (AD=ODL ) /*.01D006 A006 .
0930 058T #DISPLAY.CPU (1+003)  (AD=ODR ) /*.01D010 N07.2.
0940 070T #DISPLAY.REGION (1+003)  (AD=ODR ) /*.01D005 N05.0.
0950/
0960 005T #DISPLAY.JOB-NAME (1+004)  (AD=ODL ) /*.01D008 A008 .
0970 014T #DISPLAY.ADR (1+004)  (AD=ODL ) /*.01D008 A008 .
0980 023T #DISPLAY.ASID (1+004)  (AD=ODR ) /*.01D004 N04.0.
0990 028T #DISPLAY.TCB-ADR (1+004)  (AD=ODL ) /*.01D008 A008 .
1000 037T #DISPLAY.STATUS (1+004)  (AD=ODL ) /*.01D008 A008 .
1010 047T #DISPLAY.DISP (1+004)  (AD=ODL ) /*.01D003 A003 .
1020 051T #DISPLAY.TYPE (1+004)  (AD=ODL ) /*.01D006 A006 .
1030 058T #DISPLAY.CPU (1+004)  (AD=ODR ) /*.01D010 N07.2.
1040 070T #DISPLAY.REGION (1+004)  (AD=ODR ) /*.01D005 N05.0.
1050/
1060 005T #DISPLAY.JOB-NAME (1+005)  (AD=ODL ) /*.01D008 A008 .
1070 014T #DISPLAY.ADR (1+005)  (AD=ODL ) /*.01D008 A008 .
1080 023T #DISPLAY.ASID (1+005)  (AD=ODR ) /*.01D004 N04.0.
1090 028T #DISPLAY.TCB-ADR (1+005)  (AD=ODL ) /*.01D008 A008 .
1100 037T #DISPLAY.STATUS (1+005)  (AD=ODL ) /*.01D008 A008 .
1110 047T #DISPLAY.DISP (1+005)  (AD=ODL ) /*.01D003 A003 .
1120 051T #DISPLAY.TYPE (1+005)  (AD=ODL ) /*.01D006 A006 .
1130 058T #DISPLAY.CPU (1+005)  (AD=ODR ) /*.01D010 N07.2.
1140 070T #DISPLAY.REGION (1+005)  (AD=ODR ) /*.01D005 N05.0.
1150/
1160 005T #DISPLAY.JOB-NAME (1+006)  (AD=ODL ) /*.01D008 A008 .
1170 014T #DISPLAY.ADR (1+006)  (AD=ODL ) /*.01D008 A008 .
1180 023T #DISPLAY.ASID (1+006)  (AD=ODR ) /*.01D004 N04.0.
1190 028T #DISPLAY.TCB-ADR (1+006)  (AD=ODL ) /*.01D008 A008 .
1200 037T #DISPLAY.STATUS (1+006)  (AD=ODL ) /*.01D008 A008 .
1210 047T #DISPLAY.DISP (1+006)  (AD=ODL ) /*.01D003 A003 .
1220 051T #DISPLAY.TYPE (1+006)  (AD=ODL ) /*.01D006 A006 .
1230 058T #DISPLAY.CPU (1+006)  (AD=ODR ) /*.01D010 N07.2.
1240 070T #DISPLAY.REGION (1+006)  (AD=ODR ) /*.01D005 N05.0.
1250/
1260 005T #DISPLAY.JOB-NAME (1+007)  (AD=ODL ) /*.01D008 A008 .
1270 014T #DISPLAY.ADR (1+007)  (AD=ODL ) /*.01D008 A008 .
1280 023T #DISPLAY.ASID (1+007)  (AD=ODR ) /*.01D004 N04.0.
1290 028T #DISPLAY.TCB-ADR (1+007)  (AD=ODL ) /*.01D008 A008 .
1300 037T #DISPLAY.STATUS (1+007)  (AD=ODL ) /*.01D008 A008 .
1310 047T #DISPLAY.DISP (1+007)  (AD=ODL ) /*.01D003 A003 .
1320 051T #DISPLAY.TYPE (1+007)  (AD=ODL ) /*.01D006 A006 .
1330 058T #DISPLAY.CPU (1+007)  (AD=ODR ) /*.01D010 N07.2.
1340 070T #DISPLAY.REGION (1+007)  (AD=ODR ) /*.01D005 N05.0.
1350/
1360 005T #DISPLAY.JOB-NAME (1+008)  (AD=ODL ) /*.01D008 A008 .
1370 014T #DISPLAY.ADR (1+008)  (AD=ODL ) /*.01D008 A008 .
1380 023T #DISPLAY.ASID (1+008)  (AD=ODR ) /*.01D004 N04.0.
1390 028T #DISPLAY.TCB-ADR (1+008)  (AD=ODL ) /*.01D008 A008 .
1400 037T #DISPLAY.STATUS (1+008)  (AD=ODL ) /*.01D008 A008 .
1410 047T #DISPLAY.DISP (1+008)  (AD=ODL ) /*.01D003 A003 .
1420 051T #DISPLAY.TYPE (1+008)  (AD=ODL ) /*.01D006 A006 .
1430 058T #DISPLAY.CPU (1+008)  (AD=ODR ) /*.01D010 N07.2.
1440 070T #DISPLAY.REGION (1+008)  (AD=ODR ) /*.01D005 N05.0.
1450/
1460 005T #DISPLAY.JOB-NAME (1+009)  (AD=ODL ) /*.01D008 A008 .
1470 014T #DISPLAY.ADR (1+009)  (AD=ODL ) /*.01D008 A008 .
1480 023T #DISPLAY.ASID (1+009)  (AD=ODR ) /*.01D004 N04.0.
1490 028T #DISPLAY.TCB-ADR (1+009)  (AD=ODL ) /*.01D008 A008 .
1500 037T #DISPLAY.STATUS (1+009)  (AD=ODL ) /*.01D008 A008 .
1510 047T #DISPLAY.DISP (1+009)  (AD=ODL ) /*.01D003 A003 .
1520 051T #DISPLAY.TYPE (1+009)  (AD=ODL ) /*.01D006 A006 .
1530 058T #DISPLAY.CPU (1+009)  (AD=ODR ) /*.01D010 N07.2.
1540 070T #DISPLAY.REGION (1+009)  (AD=ODR ) /*.01D005 N05.0.
1550/
1560 005T #DISPLAY.JOB-NAME (1+010)  (AD=ODL ) /*.01D008 A008 .
1570 014T #DISPLAY.ADR (1+010)  (AD=ODL ) /*.01D008 A008 .
1580 023T #DISPLAY.ASID (1+010)  (AD=ODR ) /*.01D004 N04.0.
1590 028T #DISPLAY.TCB-ADR (1+010)  (AD=ODL ) /*.01D008 A008 .
1600 037T #DISPLAY.STATUS (1+010)  (AD=ODL ) /*.01D008 A008 .
1610 047T #DISPLAY.DISP (1+010)  (AD=ODL ) /*.01D003 A003 .
1620 051T #DISPLAY.TYPE (1+010)  (AD=ODL ) /*.01D006 A006 .
1630 058T #DISPLAY.CPU (1+010)  (AD=ODR ) /*.01D010 N07.2.
1640 070T #DISPLAY.REGION (1+010)  (AD=ODR ) /*.01D005 N05.0.
1650/
1660 005T #DISPLAY.JOB-NAME (1+011)  (AD=ODL ) /*.01D008 A008 .
1670 014T #DISPLAY.ADR (1+011)  (AD=ODL ) /*.01D008 A008 .
1680 023T #DISPLAY.ASID (1+011)  (AD=ODR ) /*.01D004 N04.0.
1690 028T #DISPLAY.TCB-ADR (1+011)  (AD=ODL ) /*.01D008 A008 .
1700 037T #DISPLAY.STATUS (1+011)  (AD=ODL ) /*.01D008 A008 .
1710 047T #DISPLAY.DISP (1+011)  (AD=ODL ) /*.01D003 A003 .
1720 051T #DISPLAY.TYPE (1+011)  (AD=ODL ) /*.01D006 A006 .
1730 058T #DISPLAY.CPU (1+011)  (AD=ODR ) /*.01D010 N07.2.
1740 070T #DISPLAY.REGION (1+011)  (AD=ODR ) /*.01D005 N05.0.
1750/
1760 005T #DISPLAY.JOB-NAME (1+012)  (AD=ODL ) /*.01D008 A008 .
1770 014T #DISPLAY.ADR (1+012)  (AD=ODL ) /*.01D008 A008 .
1780 023T #DISPLAY.ASID (1+012)  (AD=ODR ) /*.01D004 N04.0.
1790 028T #DISPLAY.TCB-ADR (1+012)  (AD=ODL ) /*.01D008 A008 .
1800 037T #DISPLAY.STATUS (1+012)  (AD=ODL ) /*.01D008 A008 .
1810 047T #DISPLAY.DISP (1+012)  (AD=ODL ) /*.01D003 A003 .
1820 051T #DISPLAY.TYPE (1+012)  (AD=ODL ) /*.01D006 A006 .
1830 058T #DISPLAY.CPU (1+012)  (AD=ODR ) /*.01D010 N07.2.
1840 070T #DISPLAY.REGION (1+012)  (AD=ODR ) /*.01D005 N05.0.
1850/
1860 005T #DISPLAY.JOB-NAME (1+013)  (AD=ODL ) /*.01D008 A008 .
1870 014T #DISPLAY.ADR (1+013)  (AD=ODL ) /*.01D008 A008 .
1880 023T #DISPLAY.ASID (1+013)  (AD=ODR ) /*.01D004 N04.0.
1890 028T #DISPLAY.TCB-ADR (1+013)  (AD=ODL ) /*.01D008 A008 .
1900 037T #DISPLAY.STATUS (1+013)  (AD=ODL ) /*.01D008 A008 .
1910 047T #DISPLAY.DISP (1+013)  (AD=ODL ) /*.01D003 A003 .
1920 051T #DISPLAY.TYPE (1+013)  (AD=ODL ) /*.01D006 A006 .
1930 058T #DISPLAY.CPU (1+013)  (AD=ODR ) /*.01D010 N07.2.
1940 070T #DISPLAY.REGION (1+013)  (AD=ODR ) /*.01D005 N05.0.
1950/
1960 005T #DISPLAY.JOB-NAME (1+014)  (AD=ODL ) /*.01D008 A008 .
1970 014T #DISPLAY.ADR (1+014)  (AD=ODL ) /*.01D008 A008 .
1980 023T #DISPLAY.ASID (1+014)  (AD=ODR ) /*.01D004 N04.0.
1990 028T #DISPLAY.TCB-ADR (1+014)  (AD=ODL ) /*.01D008 A008 .
2000 037T #DISPLAY.STATUS (1+014)  (AD=ODL ) /*.01D008 A008 .
2010 047T #DISPLAY.DISP (1+014)  (AD=ODL ) /*.01D003 A003 .
2020 051T #DISPLAY.TYPE (1+014)  (AD=ODL ) /*.01D006 A006 .
2030 058T #DISPLAY.CPU (1+014)  (AD=ODR ) /*.01D010 N07.2.
2040 070T #DISPLAY.REGION (1+014)  (AD=ODR ) /*.01D005 N05.0.
2050/
2060/
2070* MAP2: VALIDATION *****************************************************
2080* MAP2: END OF MAP *****************************************************
2090END
