0010* MAP2: PROTOTYPE
0020* INPUT USING MAP 'XXXXXXXX'
0030*     ##TITLE #CVAR #DISPLAY.ADR(*) #DISPLAY.ASID(*) #DISPLAY.CPU(*)
0040*     #DISPLAY.DISP(*) #DISPLAY.JOB-NAME(*) #DISPLAY.REGION(*)
0050*     #DISPLAY.STATUS(*) #DISPLAY.TCB-ADR(*) #DISPLAY.TYPE(*) #JOB-NAME
0060*     #STATUS #TYPE
0070DEFINE DATA PARAMETER
00801 ##TITLE (A078)
00901  #CVAR (C)
01001 #DISPLAY.ADR (A008/00001:00015)
01101 #DISPLAY.ASID (N04.0/00001:00015)
01201 #DISPLAY.CPU (N07.2/00001:00015)
01301 #DISPLAY.DISP (A003/00001:00015)
01401 #DISPLAY.JOB-NAME (A008/00001:00015)
01501 #DISPLAY.REGION (N05.0/00001:00015)
01601 #DISPLAY.STATUS (A008/00001:00015)
01701 #DISPLAY.TCB-ADR (A008/00001:00015)
01801 #DISPLAY.TYPE (A006/00001:00015)
01901 #JOB-NAME (A008)
02001 #STATUS (A008)
02101 #TYPE (A006)
0220END-DEFINE
0230FORMAT PS=021 LS=080 ZP=OFF SG=OFF KD=ON  IP=OFF
0240* MAP2: MAP PROFILES *****************************        410***********
0250* .TTAAAMMOO   D I D I N D I D I        ?_)¬&:+(                       *
0260* 023079        N0NNUCN             X        01 SYSPROF YL   #CVAR   1 *
0270************************************************************************
0280INPUT          (     CV=#CVAR                                         /*
0290                                                                       )
0300 002T ##TITLE  (AD=ODL ) /*.01D078 A078 .
0310/
0320/
0330 005T 'Job-Name Adresse'
0340 023T 'ASID TCB'
0350 037T 'Status'
0360 046T 'Disp Typ'
0370 058T 'CPU verbr. Region'
0380/
0390 005T #JOB-NAME  (AD=MYLT'_' CV=#CVAR ) /*.99D008 A008 .
0400 014T '________ ____ ________'
0410 037T #STATUS  (AD=MYLT CV=#CVAR ) /*.99D008 A008 .
0420 046T '____'
0430 051T #TYPE  (AD=MYLT CV=#CVAR ) /*.99D006 A006 .
0440 058T '__________ ______'
0450/
0460 005T #DISPLAY.JOB-NAME (1+000)  (AD=ODL ) /*.01D008 A008 .
0470   /* A1000150000100001000010000100001100015001000001H
0480 014T #DISPLAY.ADR (1+000)  (AD=ODL ) /*.01D008 A008 .
0490   /* A1000150000100001000010000100001100015001000001H
0500 023T #DISPLAY.ASID (1+000)  (AD=ODR ) /*.01D004 N04.0.
0510   /* A1000150000100001000010000100001100015001000001H
0520 028T #DISPLAY.TCB-ADR (1+000)  (AD=ODL ) /*.01D008 A008 .
0530   /* A1000150000100001000010000100001100015001000001H
0540 037T #DISPLAY.STATUS (1+000)  (AD=ODL ) /*.01D008 A008 .
0550   /* A1000150000100001000010000100001100015001000001H
0560 047T #DISPLAY.DISP (1+000)  (AD=ODL ) /*.01D003 A003 .
0570   /* A1000150000100001000010000100001100015001000001H
0580 051T #DISPLAY.TYPE (1+000)  (AD=ODL ) /*.01D006 A006 .
0590   /* A1000150000100001000010000100001100015001000001H
0600 058T #DISPLAY.CPU (1+000)  (AD=ODR ) /*.01D010 N07.2.
0610   /* A1000150000100001000010000100001100015001000001H
0620 070T #DISPLAY.REGION (1+000)  (AD=ODR ) /*.01D005 N05.0.
0630   /* A1000150000100001000010000100001100015001000001H
0640/
0650 005T #DISPLAY.JOB-NAME (1+001)  (AD=ODL ) /*.01D008 A008 .
0660 014T #DISPLAY.ADR (1+001)  (AD=ODL ) /*.01D008 A008 .
0670 023T #DISPLAY.ASID (1+001)  (AD=ODR ) /*.01D004 N04.0.
0680 028T #DISPLAY.TCB-ADR (1+001)  (AD=ODL ) /*.01D008 A008 .
0690 037T #DISPLAY.STATUS (1+001)  (AD=ODL ) /*.01D008 A008 .
0700 047T #DISPLAY.DISP (1+001)  (AD=ODL ) /*.01D003 A003 .
0710 051T #DISPLAY.TYPE (1+001)  (AD=ODL ) /*.01D006 A006 .
0720 058T #DISPLAY.CPU (1+001)  (AD=ODR ) /*.01D010 N07.2.
0730 070T #DISPLAY.REGION (1+001)  (AD=ODR ) /*.01D005 N05.0.
0740/
0750 005T #DISPLAY.JOB-NAME (1+002)  (AD=ODL ) /*.01D008 A008 .
0760 014T #DISPLAY.ADR (1+002)  (AD=ODL ) /*.01D008 A008 .
0770 023T #DISPLAY.ASID (1+002)  (AD=ODR ) /*.01D004 N04.0.
0780 028T #DISPLAY.TCB-ADR (1+002)  (AD=ODL ) /*.01D008 A008 .
0790 037T #DISPLAY.STATUS (1+002)  (AD=ODL ) /*.01D008 A008 .
0800 047T #DISPLAY.DISP (1+002)  (AD=ODL ) /*.01D003 A003 .
0810 051T #DISPLAY.TYPE (1+002)  (AD=ODL ) /*.01D006 A006 .
0820 058T #DISPLAY.CPU (1+002)  (AD=ODR ) /*.01D010 N07.2.
0830 070T #DISPLAY.REGION (1+002)  (AD=ODR ) /*.01D005 N05.0.
0840/
0850 005T #DISPLAY.JOB-NAME (1+003)  (AD=ODL ) /*.01D008 A008 .
0860 014T #DISPLAY.ADR (1+003)  (AD=ODL ) /*.01D008 A008 .
0870 023T #DISPLAY.ASID (1+003)  (AD=ODR ) /*.01D004 N04.0.
0880 028T #DISPLAY.TCB-ADR (1+003)  (AD=ODL ) /*.01D008 A008 .
0890 037T #DISPLAY.STATUS (1+003)  (AD=ODL ) /*.01D008 A008 .
0900 047T #DISPLAY.DISP (1+003)  (AD=ODL ) /*.01D003 A003 .
0910 051T #DISPLAY.TYPE (1+003)  (AD=ODL ) /*.01D006 A006 .
0920 058T #DISPLAY.CPU (1+003)  (AD=ODR ) /*.01D010 N07.2.
0930 070T #DISPLAY.REGION (1+003)  (AD=ODR ) /*.01D005 N05.0.
0940/
0950 005T #DISPLAY.JOB-NAME (1+004)  (AD=ODL ) /*.01D008 A008 .
0960 014T #DISPLAY.ADR (1+004)  (AD=ODL ) /*.01D008 A008 .
0970 023T #DISPLAY.ASID (1+004)  (AD=ODR ) /*.01D004 N04.0.
0980 028T #DISPLAY.TCB-ADR (1+004)  (AD=ODL ) /*.01D008 A008 .
0990 037T #DISPLAY.STATUS (1+004)  (AD=ODL ) /*.01D008 A008 .
1000 047T #DISPLAY.DISP (1+004)  (AD=ODL ) /*.01D003 A003 .
1010 051T #DISPLAY.TYPE (1+004)  (AD=ODL ) /*.01D006 A006 .
1020 058T #DISPLAY.CPU (1+004)  (AD=ODR ) /*.01D010 N07.2.
1030 070T #DISPLAY.REGION (1+004)  (AD=ODR ) /*.01D005 N05.0.
1040/
1050 005T #DISPLAY.JOB-NAME (1+005)  (AD=ODL ) /*.01D008 A008 .
1060 014T #DISPLAY.ADR (1+005)  (AD=ODL ) /*.01D008 A008 .
1070 023T #DISPLAY.ASID (1+005)  (AD=ODR ) /*.01D004 N04.0.
1080 028T #DISPLAY.TCB-ADR (1+005)  (AD=ODL ) /*.01D008 A008 .
1090 037T #DISPLAY.STATUS (1+005)  (AD=ODL ) /*.01D008 A008 .
1100 047T #DISPLAY.DISP (1+005)  (AD=ODL ) /*.01D003 A003 .
1110 051T #DISPLAY.TYPE (1+005)  (AD=ODL ) /*.01D006 A006 .
1120 058T #DISPLAY.CPU (1+005)  (AD=ODR ) /*.01D010 N07.2.
1130 070T #DISPLAY.REGION (1+005)  (AD=ODR ) /*.01D005 N05.0.
1140/
1150 005T #DISPLAY.JOB-NAME (1+006)  (AD=ODL ) /*.01D008 A008 .
1160 014T #DISPLAY.ADR (1+006)  (AD=ODL ) /*.01D008 A008 .
1170 023T #DISPLAY.ASID (1+006)  (AD=ODR ) /*.01D004 N04.0.
1180 028T #DISPLAY.TCB-ADR (1+006)  (AD=ODL ) /*.01D008 A008 .
1190 037T #DISPLAY.STATUS (1+006)  (AD=ODL ) /*.01D008 A008 .
1200 047T #DISPLAY.DISP (1+006)  (AD=ODL ) /*.01D003 A003 .
1210 051T #DISPLAY.TYPE (1+006)  (AD=ODL ) /*.01D006 A006 .
1220 058T #DISPLAY.CPU (1+006)  (AD=ODR ) /*.01D010 N07.2.
1230 070T #DISPLAY.REGION (1+006)  (AD=ODR ) /*.01D005 N05.0.
1240/
1250 005T #DISPLAY.JOB-NAME (1+007)  (AD=ODL ) /*.01D008 A008 .
1260 014T #DISPLAY.ADR (1+007)  (AD=ODL ) /*.01D008 A008 .
1270 023T #DISPLAY.ASID (1+007)  (AD=ODR ) /*.01D004 N04.0.
1280 028T #DISPLAY.TCB-ADR (1+007)  (AD=ODL ) /*.01D008 A008 .
1290 037T #DISPLAY.STATUS (1+007)  (AD=ODL ) /*.01D008 A008 .
1300 047T #DISPLAY.DISP (1+007)  (AD=ODL ) /*.01D003 A003 .
1310 051T #DISPLAY.TYPE (1+007)  (AD=ODL ) /*.01D006 A006 .
1320 058T #DISPLAY.CPU (1+007)  (AD=ODR ) /*.01D010 N07.2.
1330 070T #DISPLAY.REGION (1+007)  (AD=ODR ) /*.01D005 N05.0.
1340/
1350 005T #DISPLAY.JOB-NAME (1+008)  (AD=ODL ) /*.01D008 A008 .
1360 014T #DISPLAY.ADR (1+008)  (AD=ODL ) /*.01D008 A008 .
1370 023T #DISPLAY.ASID (1+008)  (AD=ODR ) /*.01D004 N04.0.
1380 028T #DISPLAY.TCB-ADR (1+008)  (AD=ODL ) /*.01D008 A008 .
1390 037T #DISPLAY.STATUS (1+008)  (AD=ODL ) /*.01D008 A008 .
1400 047T #DISPLAY.DISP (1+008)  (AD=ODL ) /*.01D003 A003 .
1410 051T #DISPLAY.TYPE (1+008)  (AD=ODL ) /*.01D006 A006 .
1420 058T #DISPLAY.CPU (1+008)  (AD=ODR ) /*.01D010 N07.2.
1430 070T #DISPLAY.REGION (1+008)  (AD=ODR ) /*.01D005 N05.0.
1440/
1450 005T #DISPLAY.JOB-NAME (1+009)  (AD=ODL ) /*.01D008 A008 .
1460 014T #DISPLAY.ADR (1+009)  (AD=ODL ) /*.01D008 A008 .
1470 023T #DISPLAY.ASID (1+009)  (AD=ODR ) /*.01D004 N04.0.
1480 028T #DISPLAY.TCB-ADR (1+009)  (AD=ODL ) /*.01D008 A008 .
1490 037T #DISPLAY.STATUS (1+009)  (AD=ODL ) /*.01D008 A008 .
1500 047T #DISPLAY.DISP (1+009)  (AD=ODL ) /*.01D003 A003 .
1510 051T #DISPLAY.TYPE (1+009)  (AD=ODL ) /*.01D006 A006 .
1520 058T #DISPLAY.CPU (1+009)  (AD=ODR ) /*.01D010 N07.2.
1530 070T #DISPLAY.REGION (1+009)  (AD=ODR ) /*.01D005 N05.0.
1540/
1550 005T #DISPLAY.JOB-NAME (1+010)  (AD=ODL ) /*.01D008 A008 .
1560 014T #DISPLAY.ADR (1+010)  (AD=ODL ) /*.01D008 A008 .
1570 023T #DISPLAY.ASID (1+010)  (AD=ODR ) /*.01D004 N04.0.
1580 028T #DISPLAY.TCB-ADR (1+010)  (AD=ODL ) /*.01D008 A008 .
1590 037T #DISPLAY.STATUS (1+010)  (AD=ODL ) /*.01D008 A008 .
1600 047T #DISPLAY.DISP (1+010)  (AD=ODL ) /*.01D003 A003 .
1610 051T #DISPLAY.TYPE (1+010)  (AD=ODL ) /*.01D006 A006 .
1620 058T #DISPLAY.CPU (1+010)  (AD=ODR ) /*.01D010 N07.2.
1630 070T #DISPLAY.REGION (1+010)  (AD=ODR ) /*.01D005 N05.0.
1640/
1650 005T #DISPLAY.JOB-NAME (1+011)  (AD=ODL ) /*.01D008 A008 .
1660 014T #DISPLAY.ADR (1+011)  (AD=ODL ) /*.01D008 A008 .
1670 023T #DISPLAY.ASID (1+011)  (AD=ODR ) /*.01D004 N04.0.
1680 028T #DISPLAY.TCB-ADR (1+011)  (AD=ODL ) /*.01D008 A008 .
1690 037T #DISPLAY.STATUS (1+011)  (AD=ODL ) /*.01D008 A008 .
1700 047T #DISPLAY.DISP (1+011)  (AD=ODL ) /*.01D003 A003 .
1710 051T #DISPLAY.TYPE (1+011)  (AD=ODL ) /*.01D006 A006 .
1720 058T #DISPLAY.CPU (1+011)  (AD=ODR ) /*.01D010 N07.2.
1730 070T #DISPLAY.REGION (1+011)  (AD=ODR ) /*.01D005 N05.0.
1740/
1750 005T #DISPLAY.JOB-NAME (1+012)  (AD=ODL ) /*.01D008 A008 .
1760 014T #DISPLAY.ADR (1+012)  (AD=ODL ) /*.01D008 A008 .
1770 023T #DISPLAY.ASID (1+012)  (AD=ODR ) /*.01D004 N04.0.
1780 028T #DISPLAY.TCB-ADR (1+012)  (AD=ODL ) /*.01D008 A008 .
1790 037T #DISPLAY.STATUS (1+012)  (AD=ODL ) /*.01D008 A008 .
1800 047T #DISPLAY.DISP (1+012)  (AD=ODL ) /*.01D003 A003 .
1810 051T #DISPLAY.TYPE (1+012)  (AD=ODL ) /*.01D006 A006 .
1820 058T #DISPLAY.CPU (1+012)  (AD=ODR ) /*.01D010 N07.2.
1830 070T #DISPLAY.REGION (1+012)  (AD=ODR ) /*.01D005 N05.0.
1840/
1850 005T #DISPLAY.JOB-NAME (1+013)  (AD=ODL ) /*.01D008 A008 .
1860 014T #DISPLAY.ADR (1+013)  (AD=ODL ) /*.01D008 A008 .
1870 023T #DISPLAY.ASID (1+013)  (AD=ODR ) /*.01D004 N04.0.
1880 028T #DISPLAY.TCB-ADR (1+013)  (AD=ODL ) /*.01D008 A008 .
1890 037T #DISPLAY.STATUS (1+013)  (AD=ODL ) /*.01D008 A008 .
1900 047T #DISPLAY.DISP (1+013)  (AD=ODL ) /*.01D003 A003 .
1910 051T #DISPLAY.TYPE (1+013)  (AD=ODL ) /*.01D006 A006 .
1920 058T #DISPLAY.CPU (1+013)  (AD=ODR ) /*.01D010 N07.2.
1930 070T #DISPLAY.REGION (1+013)  (AD=ODR ) /*.01D005 N05.0.
1940/
1950 005T #DISPLAY.JOB-NAME (1+014)  (AD=ODL ) /*.01D008 A008 .
1960 014T #DISPLAY.ADR (1+014)  (AD=ODL ) /*.01D008 A008 .
1970 023T #DISPLAY.ASID (1+014)  (AD=ODR ) /*.01D004 N04.0.
1980 028T #DISPLAY.TCB-ADR (1+014)  (AD=ODL ) /*.01D008 A008 .
1990 037T #DISPLAY.STATUS (1+014)  (AD=ODL ) /*.01D008 A008 .
2000 047T #DISPLAY.DISP (1+014)  (AD=ODL ) /*.01D003 A003 .
2010 051T #DISPLAY.TYPE (1+014)  (AD=ODL ) /*.01D006 A006 .
2020 058T #DISPLAY.CPU (1+014)  (AD=ODR ) /*.01D010 N07.2.
2030 070T #DISPLAY.REGION (1+014)  (AD=ODR ) /*.01D005 N05.0.
2040/
2050/
2060* MAP2: VALIDATION *****************************************************
2070* MAP2: END OF MAP *****************************************************
2080END
