0010* MAP2: PROTOTYPE
0020* INPUT USING MAP 'XXXXXXXX'
0030*     ##TITLE #ATTRIBUTE #DSNAME
0040DEFINE DATA PARAMETER
00501 ##TITLE (A078)
00601 #ATTRIBUTE (A008)
00701 #DSNAME (A044)
0080END-DEFINE
0090FORMAT PS=021 LS=080 ZP=OFF SG=OFF KD=ON  IP=OFF
0100* MAP2: MAP PROFILES *****************************        410***********
0110* .TTAAAMMOO   D 7ID I N D I D I        ?_)¬&:+(                       *
0120* 023079        N0NNUCN             X        01 SYSPROF YL           1 *
0130************************************************************************
0140INPUT          (     IP=OFF                                           /*
0150                                                                       )
0160 002T ##TITLE  (AD=ODL ) /*.01D078 A078 .
0170/
0180/
0190/
0200/
0210 002T 'Class ...........'
0220 020T 'DATASET'(NEI)
0230/
0240 002T 'Access Type .....'
0250 020T #ATTRIBUTE  (AD=MILT'_' CD=NE ) /*.99U008 A008 .
0260 029T '(Read, Update, Control, Alter)'
0270/
0280 002T 'Dsname ..........'
0290 020T #DSNAME  (AD=MILT'_' CD=NE ) /*.99U044 A044 .
0300/
0310/
0320/
0330/
0340/
0350/
0360/
0370/
0380/
0390/
0400/
0410/
0420/
0430/
0440* MAP2: VALIDATION *****************************************************
0450* MAP2: END OF MAP *****************************************************
0460END
