0010* Program   MCHKSEC
0020* View      CHECK-SECURITY
0030*
0040* Function  Check if access to a resource is allowed
0050*
0060* ----------------------------------------------------------------------
0070*
0080DEFINE DATA
0090   GLOBAL USING TUTO
0100   LOCAL USING MCHKSECL
0110   LOCAL
012001  #DSNAME                    (A44)
013001  #ATTRIBUTE                 (A8)
0140END-DEFINE
0150*
0160INPUT WITH TEXT *##MSG-NR,
0170                 ##MSG-TXT1,
0180                 ##MSG-TXT2
0190      USING MAP 'MCHKSEC&'
0200*
0210PROCESS CHECK-SECURITY
0220   USING NODE                 = ##NODE
0230     ,   ENTITY               = #DSNAME
0240     ,   CLASS                = 'DATASET'
0250     ,   ATTRIBUTE            = #ATTRIBUTE
0260  GIVING ERROR-CODE
0270         ERROR-TEXT
0280         ALLOWED
0290*
0300DECIDE FOR FIRST CONDITION
0310  WHEN ERROR-CODE > 0
0320       REINPUT ERROR-TEXT
0330  WHEN ALLOWED = 'NOSEC'
0340       REINPUT *1038
0350  WHEN ALLOWED = 'YES'
0360       REINPUT *1039
0370  WHEN ALLOWED = 'NO'
0380       REINPUT *1040
0390  WHEN ALLOWED NE ' '
0400       REINPUT *1041, ALLOWED
0410  WHEN NONE
0420       REINPUT *1015
0430END-DECIDE
0440END
