0010* MAP2: PROTOTYPE
0020* INPUT USING MAP 'XXXXXXXX'
0030*     ##TITLE #COMMAND(*)
0040DEFINE DATA PARAMETER
00501 ##TITLE (A078)
00601 #COMMAND (A083/00001:00020)
0070END-DEFINE
0080FORMAT PS=021 LS=250 ZP=OFF SG=OFF KD=ON  IP=OFF
0090* MAP2: MAP PROFILES *****************************        410***********
0100* .TTAAAMMOO   D I D I N D I D I        ?_)¬&:+(                       *
0110* 023249        N0NNUCN             X        01 SYSPROF YL           1 *
0120************************************************************************
0130INPUT          (     IP=OFF                                           /*
0140                                                                       )
0150 002T ##TITLE  (AD=ODL ) /*.01D078 A078 .
0160/
0170/
0180 002T 'TSO Commands'(I)
0190/
0200/
0210 003T '1.'
0220 006T #COMMAND (001)  (AD=MDLT'_' CD=NE AL=074  ) /*.99U074 A083 .
0230   /* A1000200000100001000010000100001100015001000001H
0240/
0250 003T '2.'
0260 006T #COMMAND (002)  (AD=MDLT'_' CD=NE AL=074  ) /*.99U074 A083 .
0270/
0280 003T '3.'
0290 006T #COMMAND (003)  (AD=MDLT'_' CD=NE AL=074  ) /*.99U074 A083 .
0300/
0310 003T '4.'
0320 006T #COMMAND (004)  (AD=MDLT'_' CD=NE AL=074  ) /*.99U074 A083 .
0330/
0340 003T '5.'
0350 006T #COMMAND (005)  (AD=MDLT'_' CD=NE AL=074  ) /*.99U074 A083 .
0360/
0370 003T '6.'
0380 006T #COMMAND (006)  (AD=MDLT'_' CD=NE AL=074  ) /*.99U074 A083 .
0390/
0400 003T '7.'
0410 006T #COMMAND (007)  (AD=MDLT'_' CD=NE AL=074  ) /*.99U074 A083 .
0420/
0430 003T '8.'
0440 006T #COMMAND (008)  (AD=MDLT'_' CD=NE AL=074  ) /*.99U074 A083 .
0450/
0460 003T '9.'
0470 006T #COMMAND (009)  (AD=MDLT'_' CD=NE AL=074  ) /*.99U074 A083 .
0480/
0490 002T '10.'
0500 006T #COMMAND (010)  (AD=MDLT'_' CD=NE AL=074  ) /*.99U074 A083 .
0510/
0520 002T '11.'
0530 006T #COMMAND (011)  (AD=MDLT'_' CD=NE AL=074  ) /*.99U074 A083 .
0540/
0550 002T '12.'
0560 006T #COMMAND (012)  (AD=MDLT'_' CD=NE AL=074  ) /*.99U074 A083 .
0570/
0580 002T '13.'
0590 006T #COMMAND (013)  (AD=MDLT'_' CD=NE AL=074  ) /*.99U074 A083 .
0600/
0610 002T '14.'
0620 006T #COMMAND (014)  (AD=MDLT'_' CD=NE AL=074  ) /*.99U074 A083 .
0630/
0640 002T '15.'
0650 006T #COMMAND (015)  (AD=MDLT'_' CD=NE AL=074  ) /*.99U074 A083 .
0660/
0670/
0680* MAP2: VALIDATION *****************************************************
0690RULEVAR D01#COMMAND
0700INCDIR COMMAND-PROCESSOR                COMMAND                         ;
0710* MAP2: END OF MAP *****************************************************
0720END
