0010* Program   MCOMMAND
0020* View      COMMAND
0030*
0040* Function  Execute TSO commands
0050*
0060* ----------------------------------------------------------------------
0070DEFINE DATA
0080*
0090GLOBAL USING TUTO
0100LOCAL
011001 COMMAND VIEW OF SYSTEM-COMMAND
0120   02 ERROR-CODE
0130   02 ERROR-TEXT
0140   02 NODE
0150   02 SYSTEM-MESSAGE-CODE
0160   02 LINE
0170   02 COMMAND                  (1:20)
018001 #COMMAND                    (A83/1:20)
0190END-DEFINE
0200*
0210WRITE TITLE ##TITLE //
0220*
0230REPEAT
0240*
0250INPUT USING MAP 'MCOMMAN&'
0260*
0270IF NOT #COMMAND (*) NE ' '
0280   REINPUT ' '
0290END-IF
0300*
0310ASSIGN COMMAND.COMMAND (*) = #COMMAND (*)
0320*
0330FIND COMMAND WITH NODE    = ##NODE
0340             AND  COMMAND = COMMAND.COMMAND (1)
0350             OR   COMMAND = COMMAND.COMMAND (2)
0360             OR   COMMAND = COMMAND.COMMAND (3)
0370             OR   COMMAND = COMMAND.COMMAND (4)
0380             OR   COMMAND = COMMAND.COMMAND (5)
0390             OR   COMMAND = COMMAND.COMMAND (6)
0400             OR   COMMAND = COMMAND.COMMAND (7)
0410             OR   COMMAND = COMMAND.COMMAND (8)
0420             OR   COMMAND = COMMAND.COMMAND (9)
0430             OR   COMMAND = COMMAND.COMMAND (10)
0440             OR   COMMAND = COMMAND.COMMAND (11)
0450             OR   COMMAND = COMMAND.COMMAND (12)
0460             OR   COMMAND = COMMAND.COMMAND (13)
0470             OR   COMMAND = COMMAND.COMMAND (14)
0480             OR   COMMAND = COMMAND.COMMAND (15)
0490   IF ERROR-CODE NE 0
0500      PRINT ERROR-TEXT
0510      ESCAPE ROUTINE
0520   END-IF
0530*
0540   PRINT LINE
0550*
0560END-FIND
0570*
0580END-REPEAT
0590*
0600END
