0010* Program   MDEVNAM
0020* View      DEVICE-NAMES
0030*
0040* Function  Display generic device names
0050*
0060* ----------------------------------------------------------------------
0070*
0080DEFINE DATA
0090   GLOBAL USING TUTO
0100   LOCAL  USING UNIT-L
0110   LOCAL  USING DEVNAM-L
0120   LOCAL  1 #COUNT (I4)
0130END-DEFINE
0140*
0150WRITE TITLE / ##TITLE (AD=OI) /
0160*
0170FIND DEVICE-NAMES WITH NODE = ##NODE
0180   IF ERROR-CODE NE 0
0190      ASSIGN ##MSG-NR   = 1000
0200      ASSIGN ##MSG-TXT1 = ERROR-TEXT
0210      STOP
0220   END-IF
0230   ADD 1 TO #COUNT
0240   AT BREAK NAME
0250      ASSIGN UNIT-ATTRIBUTES.UNIT-HEX = OLD (ADDRESS)
0260      FIND UNIT-ATTRIBUTES WITH UNIT-HEX = UNIT-ATTRIBUTES.UNIT-HEX
0270                                AND NODE = ##NODE
0280         IF ERROR-CODE NE 0
0290            ASSIGN ##MSG-NR   = 1000
0300            ASSIGN ##MSG-TXT1 = ERROR-TEXT
0310            STOP
0320         END-IF
0330         DISPLAY 'Name' OLD (NAME) 3X 'Class' CLASS 3X 'Number' #COUNT
0340      END-FIND
0350      RESET #COUNT
0360   END-BREAK
0370END-FIND
0380END
