0010* MAP2: PROTOTYPE
0020* INPUT USING MAP 'XXXXXXXX'
0030*     ##TUTO---G.##TITLE #CV(*) #CVD(*) #CVO #JOB #MEM-TEXT #NODE
0040*     #QUEUE #SEL-RNAME #SEL-USER #TEMP-TEXT MAP-TABLE.#MARK(*)
0050*     MAP-TABLE.#MESSAGE(*) MAP-TABLE.#RNAME(*) MAP-TABLE.#STATUS(*)
0060*     MAP-TABLE.#USER(*)
0070DEFINE DATA PARAMETER
00801 ##TUTO---G.##TITLE (A078)
00901  #CV (C/    1:00013)
01001  #CVD (C/    1:00013)
01101  #CVO (C)
01201 #JOB (A008)
01301 #MEM-TEXT (A008)
01401 #NODE (N05.0)
01501 #QUEUE (A008)
01601 #SEL-RNAME (A044)
01701 #SEL-USER (A008)
01801 #TEMP-TEXT (A040)
01901 MAP-TABLE.#MARK (A001/00001:00013)
02001 MAP-TABLE.#MESSAGE (A008/00001:00013)
02101 MAP-TABLE.#RNAME (A052/00001:00013)
02201 MAP-TABLE.#STATUS (A004/00001:00013)
02301 MAP-TABLE.#USER (A008/00001:00013)
0240END-DEFINE
0250FORMAT PS=021 LS=080 ZP=OFF SG=OFF KD=ON  IP=OFF
0260* MAP2: MAP PROFILES *****************************        410***********
0270* .TTAAAMMOO   D I D I N D I D I        ?_)¬&:+(                       *
0280* 023079        N0NNUCN             X        01 SYSPROF YL           1 *
0290************************************************************************
0300INPUT          (     IP=OFF                                           /*
0310                                                                       )
0320 002T ##TUTO---G.##TITLE  (AD=ODL ) /*.01D078 A078 .
0330/
0340/
0350 004T 'Node ..........'
0360 020T #NODE  (AD=MYLT CV=#CVO ) /*.99U005 N05.0.
0370/
0380 004T #TEMP-TEXT  (AD=OD ) /*.01U040 A040 .
0390/
0400/
0410 004T 'Benutzer Job'(I)
0420 022T 'Rname'(I)
0430 066T 'Qname'(I)
0440 075T 'Stat'(I)
0450/
0460 004T #SEL-USER  (AD=MYT'_' CV=#CVO ) /*.99U008 A008 .
0470 013T #JOB  (AD=MYLT'_' CV=#CVO ) /*.99D008 A008 .
0480 022T #SEL-RNAME  (AD=MYT'_' AL=043  CV=#CVO ) /*.99U043 A044 .
0490 066T #QUEUE  (AD=MYLT'_' CV=#CVO ) /*.99D008 A008 .
0500/
0510 066T #MEM-TEXT  (AD=OI ) /*.01U008 A008 .
0520/
0530 002T MAP-TABLE.#MARK (1+000)  (AD=MYLT'_' CV=#CV(1+000) ) /*.99U001 A001 .
0540   /* A1000130000100001    10000100001100013001000001H
0550 004T MAP-TABLE.#USER (1+000)  (AD=OYL CV=#CVD(1+000) ) /*.01U008 A008 .
0560   /* A1000130000100001    10000100001100013001000001H
0570 013T MAP-TABLE.#MESSAGE (1+000)  (AD=ODL ) /*.01U008 A008 .
0580   /* A1000130000100001    10000100001100013001000001H
0590 022T MAP-TABLE.#RNAME (1+000)  (AD=ODL ) /*.01U052 A052 .
0600   /* A1000130000100001    10000100001100013001000001H
0610 075T MAP-TABLE.#STATUS (1+000)  (AD=ODL ) /*.01U004 A004 .
0620   /* A1000130000100001    10000100001100013001000001H
0630/
0640 002T MAP-TABLE.#MARK (1+001)  (AD=MYLT'_' CV=#CV(1+001) ) /*.99U001 A001 .
0650 004T MAP-TABLE.#USER (1+001)  (AD=OYL CV=#CVD(1+001) ) /*.01U008 A008 .
0660 013T MAP-TABLE.#MESSAGE (1+001)  (AD=ODL ) /*.01U008 A008 .
0670 022T MAP-TABLE.#RNAME (1+001)  (AD=ODL ) /*.01U052 A052 .
0680 075T MAP-TABLE.#STATUS (1+001)  (AD=ODL ) /*.01U004 A004 .
0690/
0700 002T MAP-TABLE.#MARK (1+002)  (AD=MYLT'_' CV=#CV(1+002) ) /*.99U001 A001 .
0710 004T MAP-TABLE.#USER (1+002)  (AD=OYL CV=#CVD(1+002) ) /*.01U008 A008 .
0720 013T MAP-TABLE.#MESSAGE (1+002)  (AD=ODL ) /*.01U008 A008 .
0730 022T MAP-TABLE.#RNAME (1+002)  (AD=ODL ) /*.01U052 A052 .
0740 075T MAP-TABLE.#STATUS (1+002)  (AD=ODL ) /*.01U004 A004 .
0750/
0760 002T MAP-TABLE.#MARK (1+003)  (AD=MYLT'_' CV=#CV(1+003) ) /*.99U001 A001 .
0770 004T MAP-TABLE.#USER (1+003)  (AD=OYL CV=#CVD(1+003) ) /*.01U008 A008 .
0780 013T MAP-TABLE.#MESSAGE (1+003)  (AD=ODL ) /*.01U008 A008 .
0790 022T MAP-TABLE.#RNAME (1+003)  (AD=ODL ) /*.01U052 A052 .
0800 075T MAP-TABLE.#STATUS (1+003)  (AD=ODL ) /*.01U004 A004 .
0810/
0820 002T MAP-TABLE.#MARK (1+004)  (AD=MYLT'_' CV=#CV(1+004) ) /*.99U001 A001 .
0830 004T MAP-TABLE.#USER (1+004)  (AD=OYL CV=#CVD(1+004) ) /*.01U008 A008 .
0840 013T MAP-TABLE.#MESSAGE (1+004)  (AD=ODL ) /*.01U008 A008 .
0850 022T MAP-TABLE.#RNAME (1+004)  (AD=ODL ) /*.01U052 A052 .
0860 075T MAP-TABLE.#STATUS (1+004)  (AD=ODL ) /*.01U004 A004 .
0870/
0880 002T MAP-TABLE.#MARK (1+005)  (AD=MYLT'_' CV=#CV(1+005) ) /*.99U001 A001 .
0890 004T MAP-TABLE.#USER (1+005)  (AD=OYL CV=#CVD(1+005) ) /*.01U008 A008 .
0900 013T MAP-TABLE.#MESSAGE (1+005)  (AD=ODL ) /*.01U008 A008 .
0910 022T MAP-TABLE.#RNAME (1+005)  (AD=ODL ) /*.01U052 A052 .
0920 075T MAP-TABLE.#STATUS (1+005)  (AD=ODL ) /*.01U004 A004 .
0930/
0940 002T MAP-TABLE.#MARK (1+006)  (AD=MYLT'_' CV=#CV(1+006) ) /*.99U001 A001 .
0950 004T MAP-TABLE.#USER (1+006)  (AD=OYL CV=#CVD(1+006) ) /*.01U008 A008 .
0960 013T MAP-TABLE.#MESSAGE (1+006)  (AD=ODL ) /*.01U008 A008 .
0970 022T MAP-TABLE.#RNAME (1+006)  (AD=ODL ) /*.01U052 A052 .
0980 075T MAP-TABLE.#STATUS (1+006)  (AD=ODL ) /*.01U004 A004 .
0990/
1000 002T MAP-TABLE.#MARK (1+007)  (AD=MYLT'_' CV=#CV(1+007) ) /*.99U001 A001 .
1010 004T MAP-TABLE.#USER (1+007)  (AD=OYL CV=#CVD(1+007) ) /*.01U008 A008 .
1020 013T MAP-TABLE.#MESSAGE (1+007)  (AD=ODL ) /*.01U008 A008 .
1030 022T MAP-TABLE.#RNAME (1+007)  (AD=ODL ) /*.01U052 A052 .
1040 075T MAP-TABLE.#STATUS (1+007)  (AD=ODL ) /*.01U004 A004 .
1050/
1060 002T MAP-TABLE.#MARK (1+008)  (AD=MYLT'_' CV=#CV(1+008) ) /*.99U001 A001 .
1070 004T MAP-TABLE.#USER (1+008)  (AD=OYL CV=#CVD(1+008) ) /*.01U008 A008 .
1080 013T MAP-TABLE.#MESSAGE (1+008)  (AD=ODL ) /*.01U008 A008 .
1090 022T MAP-TABLE.#RNAME (1+008)  (AD=ODL ) /*.01U052 A052 .
1100 075T MAP-TABLE.#STATUS (1+008)  (AD=ODL ) /*.01U004 A004 .
1110/
1120 002T MAP-TABLE.#MARK (1+009)  (AD=MYLT'_' CV=#CV(1+009) ) /*.99U001 A001 .
1130 004T MAP-TABLE.#USER (1+009)  (AD=OYL CV=#CVD(1+009) ) /*.01U008 A008 .
1140 013T MAP-TABLE.#MESSAGE (1+009)  (AD=ODL ) /*.01U008 A008 .
1150 022T MAP-TABLE.#RNAME (1+009)  (AD=ODL ) /*.01U052 A052 .
1160 075T MAP-TABLE.#STATUS (1+009)  (AD=ODL ) /*.01U004 A004 .
1170/
1180 002T MAP-TABLE.#MARK (1+010)  (AD=MYLT'_' CV=#CV(1+010) ) /*.99U001 A001 .
1190 004T MAP-TABLE.#USER (1+010)  (AD=OYL CV=#CVD(1+010) ) /*.01U008 A008 .
1200 013T MAP-TABLE.#MESSAGE (1+010)  (AD=ODL ) /*.01U008 A008 .
1210 022T MAP-TABLE.#RNAME (1+010)  (AD=ODL ) /*.01U052 A052 .
1220 075T MAP-TABLE.#STATUS (1+010)  (AD=ODL ) /*.01U004 A004 .
1230/
1240 002T MAP-TABLE.#MARK (1+011)  (AD=MYLT'_' CV=#CV(1+011) ) /*.99U001 A001 .
1250 004T MAP-TABLE.#USER (1+011)  (AD=OYL CV=#CVD(1+011) ) /*.01U008 A008 .
1260 013T MAP-TABLE.#MESSAGE (1+011)  (AD=ODL ) /*.01U008 A008 .
1270 022T MAP-TABLE.#RNAME (1+011)  (AD=ODL ) /*.01U052 A052 .
1280 075T MAP-TABLE.#STATUS (1+011)  (AD=ODL ) /*.01U004 A004 .
1290/
1300 002T MAP-TABLE.#MARK (1+012)  (AD=MYLT'_' CV=#CV(1+012) ) /*.99U001 A001 .
1310 004T MAP-TABLE.#USER (1+012)  (AD=OYL CV=#CVD(1+012) ) /*.01U008 A008 .
1320 013T MAP-TABLE.#MESSAGE (1+012)  (AD=ODL ) /*.01U008 A008 .
1330 022T MAP-TABLE.#RNAME (1+012)  (AD=ODL ) /*.01U052 A052 .
1340 075T MAP-TABLE.#STATUS (1+012)  (AD=ODL ) /*.01U004 A004 .
1350* MAP2: VALIDATION *****************************************************
1360* MAP2: END OF MAP *****************************************************
1370END
