0010* MAP2: PROTOTYPE
0020* INPUT USING MAP 'XXXXXXXX'
0030*     ##TUTO---G.##TITLE #CV(*) #CVD(*) #CVO #JOB #MEM-TEXT #NODE
0040*     #QUEUE #SEL-RNAME #SEL-USER #TEMP-TEXT MAP-TABLE.#MARK(*)
0050*     MAP-TABLE.#MESSAGE(*) MAP-TABLE.#RNAME(*) MAP-TABLE.#STATUS(*)
0060*     MAP-TABLE.#USER(*)
0070DEFINE DATA PARAMETER
00801 ##TUTO---G.##TITLE (A078)
00901  #CV (C/    1:00013)
01001  #CVD (C/    1:00013)
01101  #CVO (C)
01201 #JOB (A008)
01301 #MEM-TEXT (A008)
01401 #NODE (N05.0)
01501 #QUEUE (A008)
01601 #SEL-RNAME (A044)
01701 #SEL-USER (A008)
01801 #TEMP-TEXT (A040)
01901 MAP-TABLE.#MARK (A001/00001:00013)
02001 MAP-TABLE.#MESSAGE (A008/00001:00013)
02101 MAP-TABLE.#RNAME (A052/00001:00013)
02201 MAP-TABLE.#STATUS (A004/00001:00013)
02301 MAP-TABLE.#USER (A008/00001:00013)
0240END-DEFINE
0250FORMAT PS=021 LS=080 ZP=OFF SG=OFF KD=ON  IP=OFF
0260* MAP2: MAP PROFILES *****************************        410***********
0270* .TTAAAMMOO   D I D I N D I D I        ?_)¬&:+(                       *
0280* 023079        N0NNUCN             X        01 SYSPROF YL           1 *
0290************************************************************************
0300INPUT          (     IP=OFF                                           /*
0310                                                                       )
0320 002T ##TUTO---G.##TITLE  (AD=ODL ) /*.01D078 A078 .
0330/
0340/
0350 004T 'Node ..........'
0360 020T #NODE  (AD=MYLT CV=#CVO ) /*.99U005 N05.0.
0370/
0380 004T #TEMP-TEXT  (AD=OD ) /*.01U040 A040 .
0390/
0400/
0410 004T 'User-Id'(I)
0420 013T 'Job'(I)
0430 022T 'Rname'(I)
0440 066T 'Qname'(I)
0450 075T 'Stat'(I)
0460/
0470 004T #SEL-USER  (AD=MYT'_' CV=#CVO ) /*.99U008 A008 .
0480 013T #JOB  (AD=MYLT'_' CV=#CVO ) /*.99D008 A008 .
0490 022T #SEL-RNAME  (AD=MYT'_' AL=043  CV=#CVO ) /*.99U043 A044 .
0500 066T #QUEUE  (AD=MYLT'_' CV=#CVO ) /*.99D008 A008 .
0510/
0520 066T #MEM-TEXT  (AD=OI ) /*.01U008 A008 .
0530/
0540 002T MAP-TABLE.#MARK (1+000)  (AD=MYLT'_' CV=#CV(1+000) ) /*.99U001 A001 .
0550   /* A1000130000100001    10000100001100013001000001H
0560 004T MAP-TABLE.#USER (1+000)  (AD=OYL CV=#CVD(1+000) ) /*.01U008 A008 .
0570   /* A1000130000100001    10000100001100013001000001H
0580 013T MAP-TABLE.#MESSAGE (1+000)  (AD=ODL ) /*.01U008 A008 .
0590   /* A1000130000100001    10000100001100013001000001H
0600 022T MAP-TABLE.#RNAME (1+000)  (AD=ODL ) /*.01U052 A052 .
0610   /* A1000130000100001    10000100001100013001000001H
0620 075T MAP-TABLE.#STATUS (1+000)  (AD=ODL ) /*.01U004 A004 .
0630   /* A1000130000100001    10000100001100013001000001H
0640/
0650 002T MAP-TABLE.#MARK (1+001)  (AD=MYLT'_' CV=#CV(1+001) ) /*.99U001 A001 .
0660 004T MAP-TABLE.#USER (1+001)  (AD=OYL CV=#CVD(1+001) ) /*.01U008 A008 .
0670 013T MAP-TABLE.#MESSAGE (1+001)  (AD=ODL ) /*.01U008 A008 .
0680 022T MAP-TABLE.#RNAME (1+001)  (AD=ODL ) /*.01U052 A052 .
0690 075T MAP-TABLE.#STATUS (1+001)  (AD=ODL ) /*.01U004 A004 .
0700/
0710 002T MAP-TABLE.#MARK (1+002)  (AD=MYLT'_' CV=#CV(1+002) ) /*.99U001 A001 .
0720 004T MAP-TABLE.#USER (1+002)  (AD=OYL CV=#CVD(1+002) ) /*.01U008 A008 .
0730 013T MAP-TABLE.#MESSAGE (1+002)  (AD=ODL ) /*.01U008 A008 .
0740 022T MAP-TABLE.#RNAME (1+002)  (AD=ODL ) /*.01U052 A052 .
0750 075T MAP-TABLE.#STATUS (1+002)  (AD=ODL ) /*.01U004 A004 .
0760/
0770 002T MAP-TABLE.#MARK (1+003)  (AD=MYLT'_' CV=#CV(1+003) ) /*.99U001 A001 .
0780 004T MAP-TABLE.#USER (1+003)  (AD=OYL CV=#CVD(1+003) ) /*.01U008 A008 .
0790 013T MAP-TABLE.#MESSAGE (1+003)  (AD=ODL ) /*.01U008 A008 .
0800 022T MAP-TABLE.#RNAME (1+003)  (AD=ODL ) /*.01U052 A052 .
0810 075T MAP-TABLE.#STATUS (1+003)  (AD=ODL ) /*.01U004 A004 .
0820/
0830 002T MAP-TABLE.#MARK (1+004)  (AD=MYLT'_' CV=#CV(1+004) ) /*.99U001 A001 .
0840 004T MAP-TABLE.#USER (1+004)  (AD=OYL CV=#CVD(1+004) ) /*.01U008 A008 .
0850 013T MAP-TABLE.#MESSAGE (1+004)  (AD=ODL ) /*.01U008 A008 .
0860 022T MAP-TABLE.#RNAME (1+004)  (AD=ODL ) /*.01U052 A052 .
0870 075T MAP-TABLE.#STATUS (1+004)  (AD=ODL ) /*.01U004 A004 .
0880/
0890 002T MAP-TABLE.#MARK (1+005)  (AD=MYLT'_' CV=#CV(1+005) ) /*.99U001 A001 .
0900 004T MAP-TABLE.#USER (1+005)  (AD=OYL CV=#CVD(1+005) ) /*.01U008 A008 .
0910 013T MAP-TABLE.#MESSAGE (1+005)  (AD=ODL ) /*.01U008 A008 .
0920 022T MAP-TABLE.#RNAME (1+005)  (AD=ODL ) /*.01U052 A052 .
0930 075T MAP-TABLE.#STATUS (1+005)  (AD=ODL ) /*.01U004 A004 .
0940/
0950 002T MAP-TABLE.#MARK (1+006)  (AD=MYLT'_' CV=#CV(1+006) ) /*.99U001 A001 .
0960 004T MAP-TABLE.#USER (1+006)  (AD=OYL CV=#CVD(1+006) ) /*.01U008 A008 .
0970 013T MAP-TABLE.#MESSAGE (1+006)  (AD=ODL ) /*.01U008 A008 .
0980 022T MAP-TABLE.#RNAME (1+006)  (AD=ODL ) /*.01U052 A052 .
0990 075T MAP-TABLE.#STATUS (1+006)  (AD=ODL ) /*.01U004 A004 .
1000/
1010 002T MAP-TABLE.#MARK (1+007)  (AD=MYLT'_' CV=#CV(1+007) ) /*.99U001 A001 .
1020 004T MAP-TABLE.#USER (1+007)  (AD=OYL CV=#CVD(1+007) ) /*.01U008 A008 .
1030 013T MAP-TABLE.#MESSAGE (1+007)  (AD=ODL ) /*.01U008 A008 .
1040 022T MAP-TABLE.#RNAME (1+007)  (AD=ODL ) /*.01U052 A052 .
1050 075T MAP-TABLE.#STATUS (1+007)  (AD=ODL ) /*.01U004 A004 .
1060/
1070 002T MAP-TABLE.#MARK (1+008)  (AD=MYLT'_' CV=#CV(1+008) ) /*.99U001 A001 .
1080 004T MAP-TABLE.#USER (1+008)  (AD=OYL CV=#CVD(1+008) ) /*.01U008 A008 .
1090 013T MAP-TABLE.#MESSAGE (1+008)  (AD=ODL ) /*.01U008 A008 .
1100 022T MAP-TABLE.#RNAME (1+008)  (AD=ODL ) /*.01U052 A052 .
1110 075T MAP-TABLE.#STATUS (1+008)  (AD=ODL ) /*.01U004 A004 .
1120/
1130 002T MAP-TABLE.#MARK (1+009)  (AD=MYLT'_' CV=#CV(1+009) ) /*.99U001 A001 .
1140 004T MAP-TABLE.#USER (1+009)  (AD=OYL CV=#CVD(1+009) ) /*.01U008 A008 .
1150 013T MAP-TABLE.#MESSAGE (1+009)  (AD=ODL ) /*.01U008 A008 .
1160 022T MAP-TABLE.#RNAME (1+009)  (AD=ODL ) /*.01U052 A052 .
1170 075T MAP-TABLE.#STATUS (1+009)  (AD=ODL ) /*.01U004 A004 .
1180/
1190 002T MAP-TABLE.#MARK (1+010)  (AD=MYLT'_' CV=#CV(1+010) ) /*.99U001 A001 .
1200 004T MAP-TABLE.#USER (1+010)  (AD=OYL CV=#CVD(1+010) ) /*.01U008 A008 .
1210 013T MAP-TABLE.#MESSAGE (1+010)  (AD=ODL ) /*.01U008 A008 .
1220 022T MAP-TABLE.#RNAME (1+010)  (AD=ODL ) /*.01U052 A052 .
1230 075T MAP-TABLE.#STATUS (1+010)  (AD=ODL ) /*.01U004 A004 .
1240/
1250 002T MAP-TABLE.#MARK (1+011)  (AD=MYLT'_' CV=#CV(1+011) ) /*.99U001 A001 .
1260 004T MAP-TABLE.#USER (1+011)  (AD=OYL CV=#CVD(1+011) ) /*.01U008 A008 .
1270 013T MAP-TABLE.#MESSAGE (1+011)  (AD=ODL ) /*.01U008 A008 .
1280 022T MAP-TABLE.#RNAME (1+011)  (AD=ODL ) /*.01U052 A052 .
1290 075T MAP-TABLE.#STATUS (1+011)  (AD=ODL ) /*.01U004 A004 .
1300/
1310 002T MAP-TABLE.#MARK (1+012)  (AD=MYLT'_' CV=#CV(1+012) ) /*.99U001 A001 .
1320 004T MAP-TABLE.#USER (1+012)  (AD=OYL CV=#CVD(1+012) ) /*.01U008 A008 .
1330 013T MAP-TABLE.#MESSAGE (1+012)  (AD=ODL ) /*.01U008 A008 .
1340 022T MAP-TABLE.#RNAME (1+012)  (AD=ODL ) /*.01U052 A052 .
1350 075T MAP-TABLE.#STATUS (1+012)  (AD=ODL ) /*.01U004 A004 .
1360* MAP2: VALIDATION *****************************************************
1370* MAP2: END OF MAP *****************************************************
1380END
