0010* Program   MENQDEQ
0020* View      RESOURCE-CONTROL
0030*
0040* Function  Show System Enq's
0050*
0060* ----------------------------------------------------------------------
0070* Maintenance..:
0080* sju 02-02-15   NPE321:   5 digit job-number
0090* ======================================================================
0100*
0110DEFINE DATA GLOBAL USING TUTO
0120            LOCAL
01301 MAP-TABLE (13)
0140  2 #CV   (C)
0150  2 #CVD  (C)
0160  2 #MARK (A1)
0170  2 #USER (A8)
0180  2 #RNAME (A52)
0190  2 REDEFINE #RNAME
0200    3 #FILL  (A43)
0210    3 #SEP   (A1)
0220    3 #QOUT  (A8)
0230  2 #STATUS  (A4)
0240  2 #MESSAGE (A8)
0250  2 #LNG     (N3)
0260  2 #NATPROC-ID (A4)
02701 #I       (N2)
02801 #J       (N2)
02901 #MAX     (N2)  INIT <13>
03001 RESOURCE-CONTROL  VIEW OF RESOURCE-CONTROL
0310  2 ERROR-CODE
0320  2 ERROR-TEXT
0330  2 NODE
0340  2 QNAME
0350  2 RNAME
0360  2 RNAME-LENGTH
0370  2 TCB-ADDRESS
0380  2 JOB-NAME
0390  2 STATUS
04001 NATPROC-USERS  VIEW OF NATPROC-USERS
0410  2 ERROR-CODE
0420  2 ERROR-TEXT
0430  2 NODE
0440  2 USER-ID
0450  2 TCB-ADDRESS
0460  2 FUNCTION
0470  2 NATPROC-ID
04801 #TEXT       (A58)
04901 #TEMP-TEXT      (A40)
05001 #TEMP-NATPROC-ID(A4)
05101 #TEMP-USER(A8)
05201 #SEL-USER(A8) INIT <'*'>
05301 #SEL-USER-LOW (A8)
05401 #SEL-USER-HIGH(A8)
05501 #JOB-LOW (A8)
05601 #JOB-HIGH(A8)
05701 #MEM-TEXT(A8)
05801 #QUEUE  (A8) INIT <'SPFEDIT'>
05901 #SEL-RNAME  (A44) INIT <'*'>
06001 #JOB    (A8) INIT <'XCOM148'>
06101 #NODE   (N5)               /* sju 02-02-15 was N3
06201 #CVO    (C)
06301 #MODE   (N1)
06401 #FIRST-TIME(L)
06501 #NEW-SELECT(L)
06601 #STOP      (L)
06701 #RES-FOUND (L)
06801 #UPDATE    (L)
06901 #PASSWORD  (A8)
0700END-DEFINE
0710ASSIGN #NODE = ##NODE
0720MOVE TRUE TO #FIRST-TIME
0730IF *DATA GT 0
0740  INPUT #PASSWORD
0750END-IF
0760IF #PASSWORD EQ 'ADMIN'
0770  MOVE TRUE TO #UPDATE
0780  MOVE 'Mark to Deque resource' TO #TEMP-TEXT
0790END-IF
0800MAIN.
0810REPEAT
0820  RESET MAP-TABLE (*) #I
0830    #MEM-TEXT #MODE
0840  MOVE  (AD=NP) TO #CV(*)
0850  MOVE  (AD=I) TO #CVO
0860  SET KEY PF3 NAMED 'QUIT'
0870  IF #FIRST-TIME
0880    MOVE FALSE TO #FIRST-TIME
0890    INPUT WITH TEXT #TEXT MARK *#SEL-USER USING MAP 'MENQDEQ&'
0900    RESET #TEXT
0910  END-IF
0920  IF *PF-KEY EQ 'PF3'
0930    ESCAPE BOTTOM
0940  END-IF
0950  IF #QUEUE EQ ' '
0960    MOVE '*' TO #QUEUE
0970  END-IF
0980  IF #SEL-USER EQ ' '
0990    MOVE '*' TO #SEL-USER
1000  END-IF
1010  MOVE #SEL-USER TO #SEL-USER-LOW
1020    #SEL-USER-HIGH
1030  IF #SEL-USER EQ SCAN '*'
1040    EXAMINE #SEL-USER-LOW FOR '*' REPLACE H'00'
1050    EXAMINE #SEL-USER-HIGH FOR '*' REPLACE H'FF'
1060  END-IF
1070  IF #JOB EQ ' '
1080    MOVE '*' TO #JOB
1090  END-IF
1100  MOVE #JOB TO #JOB-LOW
1110    #JOB-HIGH
1120  IF #JOB EQ SCAN '*'
1130    EXAMINE #JOB-LOW FOR '*' REPLACE H'00'
1140    EXAMINE #JOB-HIGH FOR '*' REPLACE H'FF'
1150  END-IF
1160  IF #SEL-RNAME NE SCAN '*'
1170    COMPRESS #SEL-RNAME '*' INTO #SEL-RNAME LEAVING NO
1180  END-IF
1190  IF #QUEUE EQ 'SPFEDIT'
1200    MOVE 1 TO #MODE
1210  ELSE
1220    IF  #QUEUE EQ SCAN '*'
1230      MOVE 2 TO #MODE
1240    ELSE
1250      MOVE 3 TO #MODE
1260    END-IF
1270  END-IF
1280  MOVE FALSE TO #RES-FOUND
1290  FIND RESOURCE-CONTROL WITH QNAME=#QUEUE
1300      AND FUNCTION EQ 'LIST'
1310      AND NODE     EQ #NODE
1320      AND RNAME    EQ #SEL-RNAME
1330    IF ERROR-CODE NE 0
1340      MOVE  ERROR-TEXT TO #TEXT
1350      MOVE  TRUE TO #FIRST-TIME
1360      ESCAPE BOTTOM
1370    END-IF
1380    IF #JOB-LOW LE JOB-NAME AND
1390        #JOB-HIGH GE JOB-NAME
1400      RESET  #TEMP-USER
1410      FIND NATPROC-USERS
1420          WITH TCB-ADDRESS EQ RESOURCE-CONTROL.TCB-ADDRESS
1430          AND NODE     EQ #NODE
1440        IF ERROR-CODE NE 0
1450          REINPUT WITH TEXT ERROR-TEXT
1460        END-IF
1470        MOVE USER-ID TO  #TEMP-USER
1480        MOVE NATPROC-ID TO #TEMP-NATPROC-ID
1490      END-FIND
1500      IF #SEL-USER-LOW LE #TEMP-USER AND
1510          #SEL-USER-HIGH GE #TEMP-USER
1520        MOVE TRUE TO #RES-FOUND
1530        ADD 1 TO #I
1540        MOVE RNAME-LENGTH   TO  #LNG(#I)
1550        MOVE RNAME   TO  #RNAME(#I)
1560        MOVE STATUS  TO  #STATUS(#I)
1570        MOVE #TEMP-USER  TO  #USER(#I)
1580        MOVE #TEMP-NATPROC-ID TO  #NATPROC-ID(#I)
1590        MOVE JOB-NAME    TO  #MESSAGE(#I)
1600        IF #MODE EQ 2
1610          RESET #SEP(#I)
1620          MOVE QNAME TO #QOUT(#I)
1630        END-IF
1640      END-IF
1650      IF #I EQ #MAX
1660        PERFORM TERMINAL-I-O
1670        IF #STOP
1680          ESCAPE BOTTOM (MAIN.)
1690        END-IF
1700        RESET #I
1710        IF #NEW-SELECT
1720          ESCAPE BOTTOM
1730        END-IF
1740      END-IF
1750    END-IF
1760  END-FIND
1770  IF #I NE 0
1780    PERFORM TERMINAL-I-O
1790    IF #STOP
1800      ESCAPE BOTTOM (MAIN.)
1810    END-IF
1820  END-IF
1830  IF #RES-FOUND EQ FALSE
1840    MOVE TRUE TO #FIRST-TIME
1850  END-IF
1860END-REPEAT
1870*
1880DEFINE SUBROUTINE TERMINAL-I-O
1890FOR #J EQ 1 TO #I
1900  IF #USER(#J) NE ' '
1910      AND #USER(#J) NE '****MAIN'
1920      AND #MODE NE 2
1930      AND #UPDATE
1940    MOVE  (AD=I) TO #CV(#J)
1950    MOVE  (AD=I) TO #CVD(#J)
1960  ELSE
1970    RESET #CVD(#J)
1980  END-IF
1990END-FOR
2000* MOVE  (AD=P) TO #CVO
2010IF #MODE EQ 1
2020  MOVE 'Member' TO #MEM-TEXT
2030ELSE
2040  RESET #MEM-TEXT
2050END-IF
2060REPEAT
2070  MOVE FALSE TO #NEW-SELECT
2080  INPUT MARK *#SEL-USER USING MAP 'MENQDEQ&'
2090  IF *PF-KEY EQ 'PF3'
2100    MOVE TRUE TO #STOP
2110    ESCAPE BOTTOM
2120  END-IF
2130  IF #CV(*) MODIFIED
2140    PERFORM DEQUE-RESOURCE
2150  ELSE
2160    ESCAPE BOTTOM
2170  END-IF
2180END-REPEAT
2190IF #CVO MODIFIED
2200  MOVE TRUE TO #NEW-SELECT
2210END-IF
2220RESET MAP-TABLE (*) #I
2230MOVE  (AD=NP) TO #CV(*)
2240END-SUBROUTINE
2250DEFINE DEQUE-RESOURCE
2260FOR #J EQ 1 TO #I
2270  IF #MARK (#J) NE ' '
2280    FIND(1) RESOURCE-CONTROL WITH QNAME=#QUEUE
2290        AND FUNCTION EQ 'DEQ'
2300        AND NODE     EQ #NODE
2310        AND RNAME    EQ #RNAME(#J)
2320        AND RNAME-LENGTH EQ #LNG(#J)
2330      IF ERROR-CODE NE 0
2340        FIND NATPROC-USERS WITH FUNCTION EQ 'CANCEL'
2350            AND NODE     EQ #NODE
2360            AND NATPROC-ID EQ #NATPROC-ID(#J)
2370          IF ERROR-CODE NE 0
2380            REINPUT WITH TEXT ERROR-TEXT
2390          END-IF
2400        END-FIND
2410        MOVE 'CANCELED' TO #MESSAGE (#J)
2420      ELSE
2430        MOVE 'DEQUED' TO #MESSAGE (#J)
2440      END-IF
2450    END-FIND
2460    RESET #MARK(#J)
2470    MOVE  (AD=NP) TO #CV(#J)
2480    RESET  #CVD(#J)
2490  END-IF
2500END-FOR
2510END-SUBROUTINE
2520END
