0010* PROGRAM HISTORY
0020* DATE     USER-ID  REF-NO    DESCRIPTION
0030* 16.10.02 JWO      CE987     Take default node from NTDB
0040DEFINE DATA
0050GLOBAL USING TUTO
0060LOCAL
00701 #MAX   (N5)   CONST <255>
00801 #I     (I4)
00901 #DBID  (B1)
01001 #DBTYPE(A01)
01101 #RC    (N4)
0120END-DEFINE
0130RESET ##NODE
0140*
0150* Default to 148 if NTDB says it is ESY
0160*
0170#DBID := 148
0180CALLNAT 'NAT00036' #DBID  #DBTYPE #RC
0190IF #DBTYPE NE 'P' OR #RC NE 0    /* error or no process
0200  PERFORM GET-ESY-DBID           /* look for another ESY Ntdb
0210ELSE
0220  ##NODE := #DBID
0230END-IF
0240ASSIGN ##OPSYSTEM = 'MVS'                  /* DEFAULT MVS/DOS/BS2000
0250ASSIGN *LANGUAGE  = 1                      /* default language
0260FETCH 'TUTO000P'
0270*
0280DEFINE SUBROUTINE GET-ESY-DBID
0290FOR #I = 1 #MAX
0300  RESET #DBTYPE #RC
0310  #DBID := #I
0320  CALLNAT 'NAT00036' #DBID  #DBTYPE #RC
0330  IF #DBTYPE =  'P'
0340    ##NODE := #DBID
0350    ESCAPE BOTTOM
0360  END-IF
0370END-FOR
0380IF ##NODE = 0
0390  ##NODE := 148
0400END-IF
0410END-SUBROUTINE
0420END
