0010* MAP2: PROTOTYPE
0020* INPUT USING MAP 'XXXXXXXX'
0030*     ##TITLE #CVAR #DISPLAY.MEMBER(*) #DISPLAY.RECORD(*) #DSNAME
0040*     #MEMBER #NOL #VOLSER
0050DEFINE DATA PARAMETER
00601 ##TITLE (A078)
00701  #CVAR (C)
00801 #DISPLAY.MEMBER (A009/00001:00015)
00901 #DISPLAY.RECORD (A065/00001:00015)
01001 #DSNAME (A044)
01101 #MEMBER (A008)
01201 #NOL (N02.0)
01301 #VOLSER (A008)
0140END-DEFINE
0150FORMAT PS=021 LS=080 ZP=OFF SG=OFF KD=ON  IP=OFF
0160* MAP2: MAP PROFILES *****************************        410***********
0170* .TTAAAMMOO   D I D I N D I D I        ?_)¬&:+(                       *
0180* 023079        N0NNUCN             X        01 SYSPROF YL   #CVAR   1 *
0190************************************************************************
0200INPUT          (     CV=#CVAR                                         /*
0210                                                                       )
0220 002T ##TITLE  (AD=ODL ) /*.01D078 A078 .
0230/
0240/
0250 005T 'Dsname:'
0260 013T #DSNAME  (AD=MYLT'_' CV=#CVAR ) /*.99D044 A044 .
0270 058T 'Volser:'
0280 066T #VOLSER  (AD=MYLT'_' CV=#CVAR ) /*.99D008 A008 .
0290/
0300 034T 'Member:'
0310 042T #MEMBER  (AD=MYLT'_' CV=#CVAR ) /*.99D008 A008 .
0320 051T 'Anzahl Saetze:'
0330 066T #NOL  (AD=MYLT'_' CV=#CVAR ) /*.99D002 N02.0.
0340/
0350 005T 'Member'
0360 014T 'Saetze'
0370/
0380 004T '---------'
0390 014T '-' (065)
0400/
0410 004T #DISPLAY.MEMBER (1+000)  (AD=ODL DY=>I<        ) /*.01U009 A009 .
0420   /* A1000150000100001    10000100001100015001000001H
0430 014T #DISPLAY.RECORD (1+000)  (AD=ODL ) /*.01D065 A065 .
0440   /* A1000150000100001000010000100001100015001000001H
0450/
0460 004T #DISPLAY.MEMBER (1+001)  (AD=ODL DY=>I<        ) /*.01U009 A009 .
0470 014T #DISPLAY.RECORD (1+001)  (AD=ODL ) /*.01D065 A065 .
0480/
0490 004T #DISPLAY.MEMBER (1+002)  (AD=ODL DY=>I<        ) /*.01U009 A009 .
0500 014T #DISPLAY.RECORD (1+002)  (AD=ODL ) /*.01D065 A065 .
0510/
0520 004T #DISPLAY.MEMBER (1+003)  (AD=ODL DY=>I<        ) /*.01U009 A009 .
0530 014T #DISPLAY.RECORD (1+003)  (AD=ODL ) /*.01D065 A065 .
0540/
0550 004T #DISPLAY.MEMBER (1+004)  (AD=ODL DY=>I<        ) /*.01U009 A009 .
0560 014T #DISPLAY.RECORD (1+004)  (AD=ODL ) /*.01D065 A065 .
0570/
0580 004T #DISPLAY.MEMBER (1+005)  (AD=ODL DY=>I<        ) /*.01U009 A009 .
0590 014T #DISPLAY.RECORD (1+005)  (AD=ODL ) /*.01D065 A065 .
0600/
0610 004T #DISPLAY.MEMBER (1+006)  (AD=ODL DY=>I<        ) /*.01U009 A009 .
0620 014T #DISPLAY.RECORD (1+006)  (AD=ODL ) /*.01D065 A065 .
0630/
0640 004T #DISPLAY.MEMBER (1+007)  (AD=ODL DY=>I<        ) /*.01U009 A009 .
0650 014T #DISPLAY.RECORD (1+007)  (AD=ODL ) /*.01D065 A065 .
0660/
0670 004T #DISPLAY.MEMBER (1+008)  (AD=ODL DY=>I<        ) /*.01U009 A009 .
0680 014T #DISPLAY.RECORD (1+008)  (AD=ODL ) /*.01D065 A065 .
0690/
0700 004T #DISPLAY.MEMBER (1+009)  (AD=ODL DY=>I<        ) /*.01U009 A009 .
0710 014T #DISPLAY.RECORD (1+009)  (AD=ODL ) /*.01D065 A065 .
0720/
0730 004T #DISPLAY.MEMBER (1+010)  (AD=ODL DY=>I<        ) /*.01U009 A009 .
0740 014T #DISPLAY.RECORD (1+010)  (AD=ODL ) /*.01D065 A065 .
0750/
0760 004T #DISPLAY.MEMBER (1+011)  (AD=ODL DY=>I<        ) /*.01U009 A009 .
0770 014T #DISPLAY.RECORD (1+011)  (AD=ODL ) /*.01D065 A065 .
0780/
0790 004T #DISPLAY.MEMBER (1+012)  (AD=ODL DY=>I<        ) /*.01U009 A009 .
0800 014T #DISPLAY.RECORD (1+012)  (AD=ODL ) /*.01D065 A065 .
0810/
0820 004T #DISPLAY.MEMBER (1+013)  (AD=ODL DY=>I<        ) /*.01U009 A009 .
0830 014T #DISPLAY.RECORD (1+013)  (AD=ODL ) /*.01D065 A065 .
0840/
0850 004T #DISPLAY.MEMBER (1+014)  (AD=ODL DY=>I<        ) /*.01U009 A009 .
0860 014T #DISPLAY.RECORD (1+014)  (AD=ODL ) /*.01D065 A065 .
0870* MAP2: VALIDATION *****************************************************
0880* MAP2: END OF MAP *****************************************************
0890END
