0010* MAP2: PROTOTYPE
0020* INPUT USING MAP 'XXXXXXXX'
0030*     ##TITLE #CVAR #DATA #DISPLAY.IDR-DATA(*) #DISPLAY.IDR-DATX(*)
0040*     #DISPLAY.IDR-TYPE(*) #DSNAME #MEMBER #PASSWORD #TYPE #VOLSER
0050DEFINE DATA PARAMETER
00601 ##TITLE (A078)
00701  #CVAR (C)
00801 #DATA (A040)
00901 #DISPLAY.IDR-DATA (A040/00001:00014)
01001 #DISPLAY.IDR-DATX (D/00001:00014)
01101 #DISPLAY.IDR-TYPE (A004/00001:00014)
01201 #DSNAME (A054)
01301 #MEMBER (A010)
01401 #PASSWORD (A008)
01501 #TYPE (A004)
01601 #VOLSER (A006)
0170END-DEFINE
0180FORMAT PS=021 LS=080 ZP=OFF SG=OFF KD=ON  IP=OFF
0190* MAP2: MAP PROFILES *****************************        410***********
0200* .TTAAAMMOO   D I D I N D I D I        ?_)¬&:+(                       *
0210* 023079        N0NNUCN             X        01 SYSPROF YL   #CVAR   1 *
0220************************************************************************
0230INPUT          (     CV=#CVAR                                         /*
0240                                                                       )
0250 002T ##TITLE  (AD=ODL ) /*.01D078 A078 .
0260/
0270/
0280 005T 'Dsname .....'
0290 018T #DSNAME  (AD=MILT'_' CD=NE ) /*.99D054 A054 .
0300/
0310 005T 'Volser .....'
0320 018T #VOLSER  (AD=MILT'_' CD=NE ) /*.99D006 A006 .
0330 027T 'Member ...'
0340 038T #MEMBER  (AD=MILT'_' CD=NE ) /*.99D010 A010 .
0350 051T 'Password ...'
0360 064T #PASSWORD  (AD=MILT'_' CD=NE ) /*.99D008 A008 .
0370/
0380/
0390 005T 'Typ'
0400 010T 'IDR-Datum'
0410 021T 'Daten'
0420/
0430 005T #TYPE  (AD=MYLT'_' CD=NE CV=#CVAR ) /*.99U004 A004 .
0440 010T '__________'
0450 021T #DATA  (AD=MYLT'_' CD=NE CV=#CVAR ) /*.99D040 A040 .
0460/
0470 005T #DISPLAY.IDR-TYPE (1+000)  (AD=ODL ) /*.01D004 A004 .
0480   /**A1000140000100001000010000100001100014001001000001000HV
0490 010T #DISPLAY.IDR-DATX (1+000)  (AD=ODL EM=DD.MM.YYYY ) /*.01D010 D    .
0500   /**A1000140000100001000010000100001100014001001000001001HV
0510 021T #DISPLAY.IDR-DATA (1+000)  (AD=ODL ) /*.01D040 A040 .
0520   /**A1000140000100001000010000100001100014001001000001001HV
0530/
0540 005T #DISPLAY.IDR-TYPE (1+001)  (AD=ODL ) /*.01D004 A004 .
0550 010T #DISPLAY.IDR-DATX (1+001)  (AD=ODL EM=DD.MM.YYYY ) /*.01D010 D    .
0560 021T #DISPLAY.IDR-DATA (1+001)  (AD=ODL ) /*.01D040 A040 .
0570/
0580 005T #DISPLAY.IDR-TYPE (1+002)  (AD=ODL ) /*.01D004 A004 .
0590 010T #DISPLAY.IDR-DATX (1+002)  (AD=ODL EM=DD.MM.YYYY ) /*.01D010 D    .
0600 021T #DISPLAY.IDR-DATA (1+002)  (AD=ODL ) /*.01D040 A040 .
0610/
0620 005T #DISPLAY.IDR-TYPE (1+003)  (AD=ODL ) /*.01D004 A004 .
0630 010T #DISPLAY.IDR-DATX (1+003)  (AD=ODL EM=DD.MM.YYYY ) /*.01D010 D    .
0640 021T #DISPLAY.IDR-DATA (1+003)  (AD=ODL ) /*.01D040 A040 .
0650/
0660 005T #DISPLAY.IDR-TYPE (1+004)  (AD=ODL ) /*.01D004 A004 .
0670 010T #DISPLAY.IDR-DATX (1+004)  (AD=ODL EM=DD.MM.YYYY ) /*.01D010 D    .
0680 021T #DISPLAY.IDR-DATA (1+004)  (AD=ODL ) /*.01D040 A040 .
0690/
0700 005T #DISPLAY.IDR-TYPE (1+005)  (AD=ODL ) /*.01D004 A004 .
0710 010T #DISPLAY.IDR-DATX (1+005)  (AD=ODL EM=DD.MM.YYYY ) /*.01D010 D    .
0720 021T #DISPLAY.IDR-DATA (1+005)  (AD=ODL ) /*.01D040 A040 .
0730/
0740 005T #DISPLAY.IDR-TYPE (1+006)  (AD=ODL ) /*.01D004 A004 .
0750 010T #DISPLAY.IDR-DATX (1+006)  (AD=ODL EM=DD.MM.YYYY ) /*.01D010 D    .
0760 021T #DISPLAY.IDR-DATA (1+006)  (AD=ODL ) /*.01D040 A040 .
0770/
0780 005T #DISPLAY.IDR-TYPE (1+007)  (AD=ODL ) /*.01D004 A004 .
0790 010T #DISPLAY.IDR-DATX (1+007)  (AD=ODL EM=DD.MM.YYYY ) /*.01D010 D    .
0800 021T #DISPLAY.IDR-DATA (1+007)  (AD=ODL ) /*.01D040 A040 .
0810/
0820 005T #DISPLAY.IDR-TYPE (1+008)  (AD=ODL ) /*.01D004 A004 .
0830 010T #DISPLAY.IDR-DATX (1+008)  (AD=ODL EM=DD.MM.YYYY ) /*.01D010 D    .
0840 021T #DISPLAY.IDR-DATA (1+008)  (AD=ODL ) /*.01D040 A040 .
0850/
0860 005T #DISPLAY.IDR-TYPE (1+009)  (AD=ODL ) /*.01D004 A004 .
0870 010T #DISPLAY.IDR-DATX (1+009)  (AD=ODL EM=DD.MM.YYYY ) /*.01D010 D    .
0880 021T #DISPLAY.IDR-DATA (1+009)  (AD=ODL ) /*.01D040 A040 .
0890/
0900 005T #DISPLAY.IDR-TYPE (1+010)  (AD=ODL ) /*.01D004 A004 .
0910 010T #DISPLAY.IDR-DATX (1+010)  (AD=ODL EM=DD.MM.YYYY ) /*.01D010 D    .
0920 021T #DISPLAY.IDR-DATA (1+010)  (AD=ODL ) /*.01D040 A040 .
0930/
0940 005T #DISPLAY.IDR-TYPE (1+011)  (AD=ODL ) /*.01D004 A004 .
0950 010T #DISPLAY.IDR-DATX (1+011)  (AD=ODL EM=DD.MM.YYYY ) /*.01D010 D    .
0960 021T #DISPLAY.IDR-DATA (1+011)  (AD=ODL ) /*.01D040 A040 .
0970/
0980 005T #DISPLAY.IDR-TYPE (1+012)  (AD=ODL ) /*.01D004 A004 .
0990 010T #DISPLAY.IDR-DATX (1+012)  (AD=ODL EM=DD.MM.YYYY ) /*.01D010 D    .
1000 021T #DISPLAY.IDR-DATA (1+012)  (AD=ODL ) /*.01D040 A040 .
1010/
1020 005T #DISPLAY.IDR-TYPE (1+013)  (AD=ODL ) /*.01D004 A004 .
1030 010T #DISPLAY.IDR-DATX (1+013)  (AD=ODL EM=DD.MM.YYYY ) /*.01D010 D    .
1040 021T #DISPLAY.IDR-DATA (1+013)  (AD=ODL ) /*.01D040 A040 .
1050* MAP2: VALIDATION *****************************************************
1060* MAP2: END OF MAP *****************************************************
1070END
