0010* MAP2: PROTOTYPE
0020* INPUT USING MAP 'XXXXXXXX'
0030*     ##TITLE #CVAR #DISPLAY.ENTRY-PNT(*) #DISPLAY.LEN(*)
0040*     #DISPLAY.LOAD-ADDR(*) #DISPLAY.MODULE(*) #DISPLAY.P-S-W(*)
0050*     #DISPLAY.STATE(*) #DISPLAY.TCB-ADDR(*) #DISPLAY.TYPE(*)
0060*     #DISPLAY.USE-COUNT(*) #JOB-NAME #MODULE #STATE #TYPE
0070DEFINE DATA PARAMETER
00801 ##TITLE (A078)
00901  #CVAR (C)
01001 #DISPLAY.ENTRY-PNT (A008/00001:00015)
01101 #DISPLAY.LEN (A006/00001:00015)
01201 #DISPLAY.LOAD-ADDR (A008/00001:00015)
01301 #DISPLAY.MODULE (A008/00001:00015)
01401 #DISPLAY.P-S-W (A008/00001:00015)
01501 #DISPLAY.STATE (A007/00001:00015)
01601 #DISPLAY.TCB-ADDR (A008/00001:00015)
01701 #DISPLAY.TYPE (A006/00001:00015)
01801 #DISPLAY.USE-COUNT (N03.0/00001:00015)
01901 #JOB-NAME (A008)
02001 #MODULE (A008)
02101 #STATE (A007)
02201 #TYPE (A006)
0230END-DEFINE
0240FORMAT PS=021 LS=080 ZP=OFF SG=OFF KD=ON  IP=OFF
0250* MAP2: MAP PROFILES *****************************        410***********
0260* .TTAAAMMOO   D I D I N D I D I        ?_)¬&:+(                       *
0270* 023079        N0NNUCN             X        01 SYSPROF YL   #CVAR   1 *
0280************************************************************************
0290INPUT          (     CV=#CVAR                                         /*
0300                                                                       )
0310 002T ##TITLE  (AD=ODL ) /*.01D078 A078 .
0320/
0330/
0340 005T 'fuer Job:'
0350 015T #JOB-NAME  (AD=MYLT'_' CV=#CVAR ) /*.99D008 A008 .
0360/
0370/
0380 005T 'Modul'
0390 014T 'Typ'
0400 021T 'Start-Addr'
0410 033T 'Lade-Addr Laenge use TCB-Addr PSW'
0420 072T 'Status'
0430/
0440 005T #MODULE  (AD=MYLT'_' CV=#CVAR ) /*.99D008 A008 .
0450 014T #TYPE  (AD=MYLT'_' CV=#CVAR ) /*.99D006 A006 .
0460 021T '___________ _________ ______ ___ ________ ________'
0470 072T #STATE  (AD=MYLT'_' CV=#CVAR ) /*.99D007 A007 .
0480/
0490 005T #DISPLAY.MODULE (1+000)  (AD=ODL ) /*.01D008 A008 .
0500   /* A1000150000100001000010000100001100015001000001H
0510 014T #DISPLAY.TYPE (1+000)  (AD=ODL ) /*.01D006 A006 .
0520   /* A1000150000100001000010000100001100015001000001H
0530 022T #DISPLAY.ENTRY-PNT (1+000)  (AD=ODL ) /*.01D008 A008 .
0540   /* A1000150000100001000010000100001100015001000001H
0550 033T #DISPLAY.LOAD-ADDR (1+000)  (AD=ODL ) /*.01D008 A008 .
0560   /* A1000150000100001000010000100001100015001000001H
0570 043T #DISPLAY.LEN (1+000)  (AD=ODL ) /*.01D006 A006 .
0580   /* A1000150000100001000010000100001100015001000001H
0590 050T #DISPLAY.USE-COUNT (1+000)  (AD=ODR ) /*.01D003 N03.0.
0600   /* A1000150000100001000010000100001100015001000001H
0610 054T #DISPLAY.TCB-ADDR (1+000)  (AD=ODL ) /*.01D008 A008 .
0620   /* A1000150000100001000010000100001100015001000001H
0630 063T #DISPLAY.P-S-W (1+000)  (AD=ODL ) /*.01D008 A008 .
0640   /* A1000150000100001000010000100001100015001000001H
0650 072T #DISPLAY.STATE (1+000)  (AD=ODL ) /*.01D007 A007 .
0660   /* A1000150000100001000010000100001100015001000001H
0670/
0680 005T #DISPLAY.MODULE (1+001)  (AD=ODL ) /*.01D008 A008 .
0690 014T #DISPLAY.TYPE (1+001)  (AD=ODL ) /*.01D006 A006 .
0700 022T #DISPLAY.ENTRY-PNT (1+001)  (AD=ODL ) /*.01D008 A008 .
0710 033T #DISPLAY.LOAD-ADDR (1+001)  (AD=ODL ) /*.01D008 A008 .
0720 043T #DISPLAY.LEN (1+001)  (AD=ODL ) /*.01D006 A006 .
0730 050T #DISPLAY.USE-COUNT (1+001)  (AD=ODR ) /*.01D003 N03.0.
0740 054T #DISPLAY.TCB-ADDR (1+001)  (AD=ODL ) /*.01D008 A008 .
0750 063T #DISPLAY.P-S-W (1+001)  (AD=ODL ) /*.01D008 A008 .
0760 072T #DISPLAY.STATE (1+001)  (AD=ODL ) /*.01D007 A007 .
0770/
0780 005T #DISPLAY.MODULE (1+002)  (AD=ODL ) /*.01D008 A008 .
0790 014T #DISPLAY.TYPE (1+002)  (AD=ODL ) /*.01D006 A006 .
0800 022T #DISPLAY.ENTRY-PNT (1+002)  (AD=ODL ) /*.01D008 A008 .
0810 033T #DISPLAY.LOAD-ADDR (1+002)  (AD=ODL ) /*.01D008 A008 .
0820 043T #DISPLAY.LEN (1+002)  (AD=ODL ) /*.01D006 A006 .
0830 050T #DISPLAY.USE-COUNT (1+002)  (AD=ODR ) /*.01D003 N03.0.
0840 054T #DISPLAY.TCB-ADDR (1+002)  (AD=ODL ) /*.01D008 A008 .
0850 063T #DISPLAY.P-S-W (1+002)  (AD=ODL ) /*.01D008 A008 .
0860 072T #DISPLAY.STATE (1+002)  (AD=ODL ) /*.01D007 A007 .
0870/
0880 005T #DISPLAY.MODULE (1+003)  (AD=ODL ) /*.01D008 A008 .
0890 014T #DISPLAY.TYPE (1+003)  (AD=ODL ) /*.01D006 A006 .
0900 022T #DISPLAY.ENTRY-PNT (1+003)  (AD=ODL ) /*.01D008 A008 .
0910 033T #DISPLAY.LOAD-ADDR (1+003)  (AD=ODL ) /*.01D008 A008 .
0920 043T #DISPLAY.LEN (1+003)  (AD=ODL ) /*.01D006 A006 .
0930 050T #DISPLAY.USE-COUNT (1+003)  (AD=ODR ) /*.01D003 N03.0.
0940 054T #DISPLAY.TCB-ADDR (1+003)  (AD=ODL ) /*.01D008 A008 .
0950 063T #DISPLAY.P-S-W (1+003)  (AD=ODL ) /*.01D008 A008 .
0960 072T #DISPLAY.STATE (1+003)  (AD=ODL ) /*.01D007 A007 .
0970/
0980 005T #DISPLAY.MODULE (1+004)  (AD=ODL ) /*.01D008 A008 .
0990 014T #DISPLAY.TYPE (1+004)  (AD=ODL ) /*.01D006 A006 .
1000 022T #DISPLAY.ENTRY-PNT (1+004)  (AD=ODL ) /*.01D008 A008 .
1010 033T #DISPLAY.LOAD-ADDR (1+004)  (AD=ODL ) /*.01D008 A008 .
1020 043T #DISPLAY.LEN (1+004)  (AD=ODL ) /*.01D006 A006 .
1030 050T #DISPLAY.USE-COUNT (1+004)  (AD=ODR ) /*.01D003 N03.0.
1040 054T #DISPLAY.TCB-ADDR (1+004)  (AD=ODL ) /*.01D008 A008 .
1050 063T #DISPLAY.P-S-W (1+004)  (AD=ODL ) /*.01D008 A008 .
1060 072T #DISPLAY.STATE (1+004)  (AD=ODL ) /*.01D007 A007 .
1070/
1080 005T #DISPLAY.MODULE (1+005)  (AD=ODL ) /*.01D008 A008 .
1090 014T #DISPLAY.TYPE (1+005)  (AD=ODL ) /*.01D006 A006 .
1100 022T #DISPLAY.ENTRY-PNT (1+005)  (AD=ODL ) /*.01D008 A008 .
1110 033T #DISPLAY.LOAD-ADDR (1+005)  (AD=ODL ) /*.01D008 A008 .
1120 043T #DISPLAY.LEN (1+005)  (AD=ODL ) /*.01D006 A006 .
1130 050T #DISPLAY.USE-COUNT (1+005)  (AD=ODR ) /*.01D003 N03.0.
1140 054T #DISPLAY.TCB-ADDR (1+005)  (AD=ODL ) /*.01D008 A008 .
1150 063T #DISPLAY.P-S-W (1+005)  (AD=ODL ) /*.01D008 A008 .
1160 072T #DISPLAY.STATE (1+005)  (AD=ODL ) /*.01D007 A007 .
1170/
1180 005T #DISPLAY.MODULE (1+006)  (AD=ODL ) /*.01D008 A008 .
1190 014T #DISPLAY.TYPE (1+006)  (AD=ODL ) /*.01D006 A006 .
1200 022T #DISPLAY.ENTRY-PNT (1+006)  (AD=ODL ) /*.01D008 A008 .
1210 033T #DISPLAY.LOAD-ADDR (1+006)  (AD=ODL ) /*.01D008 A008 .
1220 043T #DISPLAY.LEN (1+006)  (AD=ODL ) /*.01D006 A006 .
1230 050T #DISPLAY.USE-COUNT (1+006)  (AD=ODR ) /*.01D003 N03.0.
1240 054T #DISPLAY.TCB-ADDR (1+006)  (AD=ODL ) /*.01D008 A008 .
1250 063T #DISPLAY.P-S-W (1+006)  (AD=ODL ) /*.01D008 A008 .
1260 072T #DISPLAY.STATE (1+006)  (AD=ODL ) /*.01D007 A007 .
1270/
1280 005T #DISPLAY.MODULE (1+007)  (AD=ODL ) /*.01D008 A008 .
1290 014T #DISPLAY.TYPE (1+007)  (AD=ODL ) /*.01D006 A006 .
1300 022T #DISPLAY.ENTRY-PNT (1+007)  (AD=ODL ) /*.01D008 A008 .
1310 033T #DISPLAY.LOAD-ADDR (1+007)  (AD=ODL ) /*.01D008 A008 .
1320 043T #DISPLAY.LEN (1+007)  (AD=ODL ) /*.01D006 A006 .
1330 050T #DISPLAY.USE-COUNT (1+007)  (AD=ODR ) /*.01D003 N03.0.
1340 054T #DISPLAY.TCB-ADDR (1+007)  (AD=ODL ) /*.01D008 A008 .
1350 063T #DISPLAY.P-S-W (1+007)  (AD=ODL ) /*.01D008 A008 .
1360 072T #DISPLAY.STATE (1+007)  (AD=ODL ) /*.01D007 A007 .
1370/
1380 005T #DISPLAY.MODULE (1+008)  (AD=ODL ) /*.01D008 A008 .
1390 014T #DISPLAY.TYPE (1+008)  (AD=ODL ) /*.01D006 A006 .
1400 022T #DISPLAY.ENTRY-PNT (1+008)  (AD=ODL ) /*.01D008 A008 .
1410 033T #DISPLAY.LOAD-ADDR (1+008)  (AD=ODL ) /*.01D008 A008 .
1420 043T #DISPLAY.LEN (1+008)  (AD=ODL ) /*.01D006 A006 .
1430 050T #DISPLAY.USE-COUNT (1+008)  (AD=ODR ) /*.01D003 N03.0.
1440 054T #DISPLAY.TCB-ADDR (1+008)  (AD=ODL ) /*.01D008 A008 .
1450 063T #DISPLAY.P-S-W (1+008)  (AD=ODL ) /*.01D008 A008 .
1460 072T #DISPLAY.STATE (1+008)  (AD=ODL ) /*.01D007 A007 .
1470/
1480 005T #DISPLAY.MODULE (1+009)  (AD=ODL ) /*.01D008 A008 .
1490 014T #DISPLAY.TYPE (1+009)  (AD=ODL ) /*.01D006 A006 .
1500 022T #DISPLAY.ENTRY-PNT (1+009)  (AD=ODL ) /*.01D008 A008 .
1510 033T #DISPLAY.LOAD-ADDR (1+009)  (AD=ODL ) /*.01D008 A008 .
1520 043T #DISPLAY.LEN (1+009)  (AD=ODL ) /*.01D006 A006 .
1530 050T #DISPLAY.USE-COUNT (1+009)  (AD=ODR ) /*.01D003 N03.0.
1540 054T #DISPLAY.TCB-ADDR (1+009)  (AD=ODL ) /*.01D008 A008 .
1550 063T #DISPLAY.P-S-W (1+009)  (AD=ODL ) /*.01D008 A008 .
1560 072T #DISPLAY.STATE (1+009)  (AD=ODL ) /*.01D007 A007 .
1570/
1580 005T #DISPLAY.MODULE (1+010)  (AD=ODL ) /*.01D008 A008 .
1590 014T #DISPLAY.TYPE (1+010)  (AD=ODL ) /*.01D006 A006 .
1600 022T #DISPLAY.ENTRY-PNT (1+010)  (AD=ODL ) /*.01D008 A008 .
1610 033T #DISPLAY.LOAD-ADDR (1+010)  (AD=ODL ) /*.01D008 A008 .
1620 043T #DISPLAY.LEN (1+010)  (AD=ODL ) /*.01D006 A006 .
1630 050T #DISPLAY.USE-COUNT (1+010)  (AD=ODR ) /*.01D003 N03.0.
1640 054T #DISPLAY.TCB-ADDR (1+010)  (AD=ODL ) /*.01D008 A008 .
1650 063T #DISPLAY.P-S-W (1+010)  (AD=ODL ) /*.01D008 A008 .
1660 072T #DISPLAY.STATE (1+010)  (AD=ODL ) /*.01D007 A007 .
1670/
1680 005T #DISPLAY.MODULE (1+011)  (AD=ODL ) /*.01D008 A008 .
1690 014T #DISPLAY.TYPE (1+011)  (AD=ODL ) /*.01D006 A006 .
1700 022T #DISPLAY.ENTRY-PNT (1+011)  (AD=ODL ) /*.01D008 A008 .
1710 033T #DISPLAY.LOAD-ADDR (1+011)  (AD=ODL ) /*.01D008 A008 .
1720 043T #DISPLAY.LEN (1+011)  (AD=ODL ) /*.01D006 A006 .
1730 050T #DISPLAY.USE-COUNT (1+011)  (AD=ODR ) /*.01D003 N03.0.
1740 054T #DISPLAY.TCB-ADDR (1+011)  (AD=ODL ) /*.01D008 A008 .
1750 063T #DISPLAY.P-S-W (1+011)  (AD=ODL ) /*.01D008 A008 .
1760 072T #DISPLAY.STATE (1+011)  (AD=ODL ) /*.01D007 A007 .
1770/
1780 005T #DISPLAY.MODULE (1+012)  (AD=ODL ) /*.01D008 A008 .
1790 014T #DISPLAY.TYPE (1+012)  (AD=ODL ) /*.01D006 A006 .
1800 022T #DISPLAY.ENTRY-PNT (1+012)  (AD=ODL ) /*.01D008 A008 .
1810 033T #DISPLAY.LOAD-ADDR (1+012)  (AD=ODL ) /*.01D008 A008 .
1820 043T #DISPLAY.LEN (1+012)  (AD=ODL ) /*.01D006 A006 .
1830 050T #DISPLAY.USE-COUNT (1+012)  (AD=ODR ) /*.01D003 N03.0.
1840 054T #DISPLAY.TCB-ADDR (1+012)  (AD=ODL ) /*.01D008 A008 .
1850 063T #DISPLAY.P-S-W (1+012)  (AD=ODL ) /*.01D008 A008 .
1860 072T #DISPLAY.STATE (1+012)  (AD=ODL ) /*.01D007 A007 .
1870/
1880 005T #DISPLAY.MODULE (1+013)  (AD=ODL ) /*.01D008 A008 .
1890 014T #DISPLAY.TYPE (1+013)  (AD=ODL ) /*.01D006 A006 .
1900 022T #DISPLAY.ENTRY-PNT (1+013)  (AD=ODL ) /*.01D008 A008 .
1910 033T #DISPLAY.LOAD-ADDR (1+013)  (AD=ODL ) /*.01D008 A008 .
1920 043T #DISPLAY.LEN (1+013)  (AD=ODL ) /*.01D006 A006 .
1930 050T #DISPLAY.USE-COUNT (1+013)  (AD=ODR ) /*.01D003 N03.0.
1940 054T #DISPLAY.TCB-ADDR (1+013)  (AD=ODL ) /*.01D008 A008 .
1950 063T #DISPLAY.P-S-W (1+013)  (AD=ODL ) /*.01D008 A008 .
1960 072T #DISPLAY.STATE (1+013)  (AD=ODL ) /*.01D007 A007 .
1970/
1980 005T #DISPLAY.MODULE (1+014)  (AD=ODL ) /*.01D008 A008 .
1990 014T #DISPLAY.TYPE (1+014)  (AD=ODL ) /*.01D006 A006 .
2000 022T #DISPLAY.ENTRY-PNT (1+014)  (AD=ODL ) /*.01D008 A008 .
2010 033T #DISPLAY.LOAD-ADDR (1+014)  (AD=ODL ) /*.01D008 A008 .
2020 043T #DISPLAY.LEN (1+014)  (AD=ODL ) /*.01D006 A006 .
2030 050T #DISPLAY.USE-COUNT (1+014)  (AD=ODR ) /*.01D003 N03.0.
2040 054T #DISPLAY.TCB-ADDR (1+014)  (AD=ODL ) /*.01D008 A008 .
2050 063T #DISPLAY.P-S-W (1+014)  (AD=ODL ) /*.01D008 A008 .
2060 072T #DISPLAY.STATE (1+014)  (AD=ODL ) /*.01D007 A007 .
2070* MAP2: VALIDATION *****************************************************
2080* MAP2: END OF MAP *****************************************************
2090END
