0010* MAP2: PROTOTYPE
0020* INPUT USING MAP 'XXXXXXXX'
0030*     ##TITLE #CV(*) #CVAR #DISPLAY.CMD(*) #DISPLAY.ESD-ADR(*)
0040*     #DISPLAY.ESD-AMODE(*) #DISPLAY.ESD-ID(*) #DISPLAY.ESD-LENGTH(*)
0050*     #DISPLAY.ESD-LR-ID(*) #DISPLAY.ESD-NAME(*) #DISPLAY.ESD-RMODE(*)
0060*     #DISPLAY.ESD-TYPE(*) #DSNAME #ESD-NAME #ESD-TYPE #MEMBER
0070*     #PASSWORD #VOLSER
0080DEFINE DATA PARAMETER
00901 ##TITLE (A078)
01001  #CV (C/    1:00011)
01101  #CVAR (C)
01201 #DISPLAY.CMD (A002/00001:00011)
01301 #DISPLAY.ESD-ADR (A008/00001:00011)
01401 #DISPLAY.ESD-AMODE (A003/00001:00011)
01501 #DISPLAY.ESD-ID (N05.0/00001:00011)
01601 #DISPLAY.ESD-LENGTH (N09.0/00001:00011)
01701 #DISPLAY.ESD-LR-ID (N05.0/00001:00011)
01801 #DISPLAY.ESD-NAME (A008/00001:00011)
01901 #DISPLAY.ESD-RMODE (A003/00001:00011)
02001 #DISPLAY.ESD-TYPE (A002/00001:00011)
02101 #DSNAME (A054)
02201 #ESD-NAME (A008)
02301 #ESD-TYPE (A002)
02401 #MEMBER (A010)
02501 #PASSWORD (A008)
02601 #VOLSER (A006)
0270END-DEFINE
0280FORMAT PS=021 LS=080 ZP=OFF SG=OFF KD=ON  IP=OFF
0290* MAP2: MAP PROFILES *****************************        410***********
0300* .TTAAAMMOO   D I D I N D I D I        ?_)¬&:+(                       *
0310* 023079        N0NNUCN             X        01 SYSPROF YL   #CVAR   1 *
0320************************************************************************
0330INPUT          (     CV=#CVAR                                         /*
0340                                                                       )
0350 002T ##TITLE  (AD=ODL ) /*.01D078 A078 .
0360/
0370/
0380 005T 'Dsname .....'
0390 018T #DSNAME  (AD=MILT'_' CD=NE ) /*.99D054 A054 .
0400/
0410 005T 'Volser .....'
0420 018T #VOLSER  (AD=MILT'_' CD=NE ) /*.99D006 A006 .
0430 027T 'Member ...'
0440 038T #MEMBER  (AD=MILT'_' CD=NE ) /*.99D010 A010 .
0450 051T 'Passwort ...'
0460 064T #PASSWORD  (AD=MILT'_' CD=NE ) /*.99D008 A008 .
0470/
0480/
0490 005T 'Cmd Name'
0500 018T 'Typ'
0510 026T 'Address'
0520 035T 'Laenge'
0530 045T 'AMode RMode LRID'
0540 063T 'ID'
0550/
0560 005T '___'
0570 009T #ESD-NAME  (AD=MYLT'_' CD=NE CV=#CVAR ) /*.99U008 A008 .
0580 018T #ESD-TYPE  (AD=MYLT'_' CD=NE AL=006  CV=#CVAR ) /*.99U006 A002 .
0590 026T '________ _________ _____ _____ _____ _____'
0600/
0610 006T #DISPLAY.CMD (1+000)  (AD=MYL'_' CD=NE CV=#CV(1+000) ) /*.99U002 A002 .
0620   /* A1000110000100001    10000100001100011001000001H
0630 009T #DISPLAY.ESD-NAME (1+000)  (AD=ODL ) /*.01U008 A008 .
0640   /* A1000110000100001    10000100001100011001000001H
0650 018T #DISPLAY.ESD-TYPE (1+000)  (AD=ODL ) /*.01U002 A002 .
0660   /* A1000110000100001    10000100001100011001000001H
0670 026T #DISPLAY.ESD-ADR (1+000)  (AD=ODL ) /*.01U008 A008 .
0680   /**A1000110000100001    10000100001100011001001000001000HV
0690 035T #DISPLAY.ESD-LENGTH (1+000)  (AD=ODR ) /*.01U009 N09.0.
0700   /* A1000110000100001    10000100001100011001000001H
0710 046T #DISPLAY.ESD-AMODE (1+000)  (AD=ODL ) /*.01U003 A003 .
0720   /* A1000110000100001    10000100001100011001000001H
0730 052T #DISPLAY.ESD-RMODE (1+000)  (AD=ODL ) /*.01U003 A003 .
0740   /* A1000110000100001    10000100001100011001000001H
0750 057T #DISPLAY.ESD-LR-ID (1+000)  (AD=ODR ) /*.01U005 N05.0.
0760   /* A1000110000100001    10000100001100011001000001H
0770 063T #DISPLAY.ESD-ID (1+000)  (AD=ODR ) /*.01U005 N05.0.
0780   /* A1000110000100001    10000100001100011001000001H
0790/
0800 006T #DISPLAY.CMD (1+001)  (AD=MYL'_' CD=NE CV=#CV(1+001) ) /*.99U002 A002 .
0810 009T #DISPLAY.ESD-NAME (1+001)  (AD=ODL ) /*.01U008 A008 .
0820 018T #DISPLAY.ESD-TYPE (1+001)  (AD=ODL ) /*.01U002 A002 .
0830 026T #DISPLAY.ESD-ADR (1+001)  (AD=ODL ) /*.01U008 A008 .
0840 035T #DISPLAY.ESD-LENGTH (1+001)  (AD=ODR ) /*.01U009 N09.0.
0850 046T #DISPLAY.ESD-AMODE (1+001)  (AD=ODL ) /*.01U003 A003 .
0860 052T #DISPLAY.ESD-RMODE (1+001)  (AD=ODL ) /*.01U003 A003 .
0870 057T #DISPLAY.ESD-LR-ID (1+001)  (AD=ODR ) /*.01U005 N05.0.
0880 063T #DISPLAY.ESD-ID (1+001)  (AD=ODR ) /*.01U005 N05.0.
0890/
0900 006T #DISPLAY.CMD (1+002)  (AD=MYL'_' CD=NE CV=#CV(1+002) ) /*.99U002 A002 .
0910 009T #DISPLAY.ESD-NAME (1+002)  (AD=ODL ) /*.01U008 A008 .
0920 018T #DISPLAY.ESD-TYPE (1+002)  (AD=ODL ) /*.01U002 A002 .
0930 026T #DISPLAY.ESD-ADR (1+002)  (AD=ODL ) /*.01U008 A008 .
0940 035T #DISPLAY.ESD-LENGTH (1+002)  (AD=ODR ) /*.01U009 N09.0.
0950 046T #DISPLAY.ESD-AMODE (1+002)  (AD=ODL ) /*.01U003 A003 .
0960 052T #DISPLAY.ESD-RMODE (1+002)  (AD=ODL ) /*.01U003 A003 .
0970 057T #DISPLAY.ESD-LR-ID (1+002)  (AD=ODR ) /*.01U005 N05.0.
0980 063T #DISPLAY.ESD-ID (1+002)  (AD=ODR ) /*.01U005 N05.0.
0990/
1000 006T #DISPLAY.CMD (1+003)  (AD=MYL'_' CD=NE CV=#CV(1+003) ) /*.99U002 A002 .
1010 009T #DISPLAY.ESD-NAME (1+003)  (AD=ODL ) /*.01U008 A008 .
1020 018T #DISPLAY.ESD-TYPE (1+003)  (AD=ODL ) /*.01U002 A002 .
1030 026T #DISPLAY.ESD-ADR (1+003)  (AD=ODL ) /*.01U008 A008 .
1040 035T #DISPLAY.ESD-LENGTH (1+003)  (AD=ODR ) /*.01U009 N09.0.
1050 046T #DISPLAY.ESD-AMODE (1+003)  (AD=ODL ) /*.01U003 A003 .
1060 052T #DISPLAY.ESD-RMODE (1+003)  (AD=ODL ) /*.01U003 A003 .
1070 057T #DISPLAY.ESD-LR-ID (1+003)  (AD=ODR ) /*.01U005 N05.0.
1080 063T #DISPLAY.ESD-ID (1+003)  (AD=ODR ) /*.01U005 N05.0.
1090/
1100 006T #DISPLAY.CMD (1+004)  (AD=MYL'_' CD=NE CV=#CV(1+004) ) /*.99U002 A002 .
1110 009T #DISPLAY.ESD-NAME (1+004)  (AD=ODL ) /*.01U008 A008 .
1120 018T #DISPLAY.ESD-TYPE (1+004)  (AD=ODL ) /*.01U002 A002 .
1130 026T #DISPLAY.ESD-ADR (1+004)  (AD=ODL ) /*.01U008 A008 .
1140 035T #DISPLAY.ESD-LENGTH (1+004)  (AD=ODR ) /*.01U009 N09.0.
1150 046T #DISPLAY.ESD-AMODE (1+004)  (AD=ODL ) /*.01U003 A003 .
1160 052T #DISPLAY.ESD-RMODE (1+004)  (AD=ODL ) /*.01U003 A003 .
1170 057T #DISPLAY.ESD-LR-ID (1+004)  (AD=ODR ) /*.01U005 N05.0.
1180 063T #DISPLAY.ESD-ID (1+004)  (AD=ODR ) /*.01U005 N05.0.
1190/
1200 006T #DISPLAY.CMD (1+005)  (AD=MYL'_' CD=NE CV=#CV(1+005) ) /*.99U002 A002 .
1210 009T #DISPLAY.ESD-NAME (1+005)  (AD=ODL ) /*.01U008 A008 .
1220 018T #DISPLAY.ESD-TYPE (1+005)  (AD=ODL ) /*.01U002 A002 .
1230 026T #DISPLAY.ESD-ADR (1+005)  (AD=ODL ) /*.01U008 A008 .
1240 035T #DISPLAY.ESD-LENGTH (1+005)  (AD=ODR ) /*.01U009 N09.0.
1250 046T #DISPLAY.ESD-AMODE (1+005)  (AD=ODL ) /*.01U003 A003 .
1260 052T #DISPLAY.ESD-RMODE (1+005)  (AD=ODL ) /*.01U003 A003 .
1270 057T #DISPLAY.ESD-LR-ID (1+005)  (AD=ODR ) /*.01U005 N05.0.
1280 063T #DISPLAY.ESD-ID (1+005)  (AD=ODR ) /*.01U005 N05.0.
1290/
1300 006T #DISPLAY.CMD (1+006)  (AD=MYL'_' CD=NE CV=#CV(1+006) ) /*.99U002 A002 .
1310 009T #DISPLAY.ESD-NAME (1+006)  (AD=ODL ) /*.01U008 A008 .
1320 018T #DISPLAY.ESD-TYPE (1+006)  (AD=ODL ) /*.01U002 A002 .
1330 026T #DISPLAY.ESD-ADR (1+006)  (AD=ODL ) /*.01U008 A008 .
1340 035T #DISPLAY.ESD-LENGTH (1+006)  (AD=ODR ) /*.01U009 N09.0.
1350 046T #DISPLAY.ESD-AMODE (1+006)  (AD=ODL ) /*.01U003 A003 .
1360 052T #DISPLAY.ESD-RMODE (1+006)  (AD=ODL ) /*.01U003 A003 .
1370 057T #DISPLAY.ESD-LR-ID (1+006)  (AD=ODR ) /*.01U005 N05.0.
1380 063T #DISPLAY.ESD-ID (1+006)  (AD=ODR ) /*.01U005 N05.0.
1390/
1400 006T #DISPLAY.CMD (1+007)  (AD=MYL'_' CD=NE CV=#CV(1+007) ) /*.99U002 A002 .
1410 009T #DISPLAY.ESD-NAME (1+007)  (AD=ODL ) /*.01U008 A008 .
1420 018T #DISPLAY.ESD-TYPE (1+007)  (AD=ODL ) /*.01U002 A002 .
1430 026T #DISPLAY.ESD-ADR (1+007)  (AD=ODL ) /*.01U008 A008 .
1440 035T #DISPLAY.ESD-LENGTH (1+007)  (AD=ODR ) /*.01U009 N09.0.
1450 046T #DISPLAY.ESD-AMODE (1+007)  (AD=ODL ) /*.01U003 A003 .
1460 052T #DISPLAY.ESD-RMODE (1+007)  (AD=ODL ) /*.01U003 A003 .
1470 057T #DISPLAY.ESD-LR-ID (1+007)  (AD=ODR ) /*.01U005 N05.0.
1480 063T #DISPLAY.ESD-ID (1+007)  (AD=ODR ) /*.01U005 N05.0.
1490/
1500 006T #DISPLAY.CMD (1+008)  (AD=MYL'_' CD=NE CV=#CV(1+008) ) /*.99U002 A002 .
1510 009T #DISPLAY.ESD-NAME (1+008)  (AD=ODL ) /*.01U008 A008 .
1520 018T #DISPLAY.ESD-TYPE (1+008)  (AD=ODL ) /*.01U002 A002 .
1530 026T #DISPLAY.ESD-ADR (1+008)  (AD=ODL ) /*.01U008 A008 .
1540 035T #DISPLAY.ESD-LENGTH (1+008)  (AD=ODR ) /*.01U009 N09.0.
1550 046T #DISPLAY.ESD-AMODE (1+008)  (AD=ODL ) /*.01U003 A003 .
1560 052T #DISPLAY.ESD-RMODE (1+008)  (AD=ODL ) /*.01U003 A003 .
1570 057T #DISPLAY.ESD-LR-ID (1+008)  (AD=ODR ) /*.01U005 N05.0.
1580 063T #DISPLAY.ESD-ID (1+008)  (AD=ODR ) /*.01U005 N05.0.
1590/
1600 006T #DISPLAY.CMD (1+009)  (AD=MYL'_' CD=NE CV=#CV(1+009) ) /*.99U002 A002 .
1610 009T #DISPLAY.ESD-NAME (1+009)  (AD=ODL ) /*.01U008 A008 .
1620 018T #DISPLAY.ESD-TYPE (1+009)  (AD=ODL ) /*.01U002 A002 .
1630 026T #DISPLAY.ESD-ADR (1+009)  (AD=ODL ) /*.01U008 A008 .
1640 035T #DISPLAY.ESD-LENGTH (1+009)  (AD=ODR ) /*.01U009 N09.0.
1650 046T #DISPLAY.ESD-AMODE (1+009)  (AD=ODL ) /*.01U003 A003 .
1660 052T #DISPLAY.ESD-RMODE (1+009)  (AD=ODL ) /*.01U003 A003 .
1670 057T #DISPLAY.ESD-LR-ID (1+009)  (AD=ODR ) /*.01U005 N05.0.
1680 063T #DISPLAY.ESD-ID (1+009)  (AD=ODR ) /*.01U005 N05.0.
1690/
1700 006T #DISPLAY.CMD (1+010)  (AD=MYL'_' CD=NE CV=#CV(1+010) ) /*.99U002 A002 .
1710 009T #DISPLAY.ESD-NAME (1+010)  (AD=ODL ) /*.01U008 A008 .
1720 018T #DISPLAY.ESD-TYPE (1+010)  (AD=ODL ) /*.01U002 A002 .
1730 026T #DISPLAY.ESD-ADR (1+010)  (AD=ODL ) /*.01U008 A008 .
1740 035T #DISPLAY.ESD-LENGTH (1+010)  (AD=ODR ) /*.01U009 N09.0.
1750 046T #DISPLAY.ESD-AMODE (1+010)  (AD=ODL ) /*.01U003 A003 .
1760 052T #DISPLAY.ESD-RMODE (1+010)  (AD=ODL ) /*.01U003 A003 .
1770 057T #DISPLAY.ESD-LR-ID (1+010)  (AD=ODR ) /*.01U005 N05.0.
1780 063T #DISPLAY.ESD-ID (1+010)  (AD=ODR ) /*.01U005 N05.0.
1790/
1800/
1810 006T 'BR'(I)
1820 009T '= Browse'
1830/
1840* MAP2: VALIDATION *****************************************************
1850* MAP2: END OF MAP *****************************************************
1860END
