0010* MAP2: PROTOTYPE
0020* INPUT USING MAP 'XXXXXXXX'
0030*     ##TITLE #CVAR #DISPLAY.HEX(*) #DISPLAY.OFFSET(*)
0040*     #DISPLAY.SEGMENT(*) #DSNAME #ESD-NAME #MEMBER #VOLSER
0050DEFINE DATA PARAMETER
00601 ##TITLE (A078)
00701  #CVAR (C)
00801 #DISPLAY.HEX (A040/00001:00014)
00901 #DISPLAY.OFFSET (A008/00001:00014)
01001 #DISPLAY.SEGMENT (A020/00001:00014)
01101 #DSNAME (A054)
01201 #ESD-NAME (A008)
01301 #MEMBER (A010)
01401 #VOLSER (A006)
0150END-DEFINE
0160FORMAT PS=021 LS=080 ZP=OFF SG=OFF KD=ON  IP=OFF
0170* MAP2: MAP PROFILES *****************************        410***********
0180* .TTAAAMMOO   D I D I N D I D I        ?_)¬&:+(                       *
0190* 023079        N0NNUCN             X        01 SYSPROF YL   #CVAR   1 *
0200************************************************************************
0210INPUT          (     CV=#CVAR                                         /*
0220                                                                       )
0230 002T ##TITLE  (AD=ODL ) /*.01D078 A078 .
0240/
0250/
0260 005T 'Dsname .....'
0270 018T #DSNAME  (AD=OILT'_' ) /*.01D054 A054 .
0280/
0290 005T 'Volser .....'
0300 018T #VOLSER  (AD=OILT'_' ) /*.01D006 A006 .
0310 027T 'Member ...'
0320 038T #MEMBER  (AD=OILT'_' ) /*.01D010 A010 .
0330 051T 'Name ...'
0340 060T #ESD-NAME  (AD=OIL ) /*.01D008 A008 .
0350/
0360/
0370 005T 'Offset'
0380 014T 'Data'
0390 035T 'Hex'
0400/
0410 005T '________'
0420 014T '_' (020)
0430 035T '_' (040)
0440/
0450 005T #DISPLAY.OFFSET (1+000)  (AD=ODL CD=NE ) /*.01D008 A008 .
0460   /* A1000140000100001000010000100001100014001000001H
0470 014T #DISPLAY.SEGMENT (1+000)  (AD=ODL CD=NE ) /*.01D020 A020 .
0480   /* A1000140000100001000010000100001100014001000001H
0490 035T #DISPLAY.HEX (1+000)  (AD=ODL CD=NE ) /*.01D040 A040 .
0500   /* A1000140000100001000010000100001100014001000001H
0510/
0520 005T #DISPLAY.OFFSET (1+001)  (AD=ODL CD=NE ) /*.01D008 A008 .
0530 014T #DISPLAY.SEGMENT (1+001)  (AD=ODL CD=NE ) /*.01D020 A020 .
0540 035T #DISPLAY.HEX (1+001)  (AD=ODL CD=NE ) /*.01D040 A040 .
0550/
0560 005T #DISPLAY.OFFSET (1+002)  (AD=ODL CD=NE ) /*.01D008 A008 .
0570 014T #DISPLAY.SEGMENT (1+002)  (AD=ODL CD=NE ) /*.01D020 A020 .
0580 035T #DISPLAY.HEX (1+002)  (AD=ODL CD=NE ) /*.01D040 A040 .
0590/
0600 005T #DISPLAY.OFFSET (1+003)  (AD=ODL CD=NE ) /*.01D008 A008 .
0610 014T #DISPLAY.SEGMENT (1+003)  (AD=ODL CD=NE ) /*.01D020 A020 .
0620 035T #DISPLAY.HEX (1+003)  (AD=ODL CD=NE ) /*.01D040 A040 .
0630/
0640 005T #DISPLAY.OFFSET (1+004)  (AD=ODL CD=NE ) /*.01D008 A008 .
0650 014T #DISPLAY.SEGMENT (1+004)  (AD=ODL CD=NE ) /*.01D020 A020 .
0660 035T #DISPLAY.HEX (1+004)  (AD=ODL CD=NE ) /*.01D040 A040 .
0670/
0680 005T #DISPLAY.OFFSET (1+005)  (AD=ODL CD=NE ) /*.01D008 A008 .
0690 014T #DISPLAY.SEGMENT (1+005)  (AD=ODL CD=NE ) /*.01D020 A020 .
0700 035T #DISPLAY.HEX (1+005)  (AD=ODL CD=NE ) /*.01D040 A040 .
0710/
0720 005T #DISPLAY.OFFSET (1+006)  (AD=ODL CD=NE ) /*.01D008 A008 .
0730 014T #DISPLAY.SEGMENT (1+006)  (AD=ODL CD=NE ) /*.01D020 A020 .
0740 035T #DISPLAY.HEX (1+006)  (AD=ODL CD=NE ) /*.01D040 A040 .
0750/
0760 005T #DISPLAY.OFFSET (1+007)  (AD=ODL CD=NE ) /*.01D008 A008 .
0770 014T #DISPLAY.SEGMENT (1+007)  (AD=ODL CD=NE ) /*.01D020 A020 .
0780 035T #DISPLAY.HEX (1+007)  (AD=ODL CD=NE ) /*.01D040 A040 .
0790/
0800 005T #DISPLAY.OFFSET (1+008)  (AD=ODL CD=NE ) /*.01D008 A008 .
0810 014T #DISPLAY.SEGMENT (1+008)  (AD=ODL CD=NE ) /*.01D020 A020 .
0820 035T #DISPLAY.HEX (1+008)  (AD=ODL CD=NE ) /*.01D040 A040 .
0830/
0840 005T #DISPLAY.OFFSET (1+009)  (AD=ODL CD=NE ) /*.01D008 A008 .
0850 014T #DISPLAY.SEGMENT (1+009)  (AD=ODL CD=NE ) /*.01D020 A020 .
0860 035T #DISPLAY.HEX (1+009)  (AD=ODL CD=NE ) /*.01D040 A040 .
0870/
0880 005T #DISPLAY.OFFSET (1+010)  (AD=ODL CD=NE ) /*.01D008 A008 .
0890 014T #DISPLAY.SEGMENT (1+010)  (AD=ODL CD=NE ) /*.01D020 A020 .
0900 035T #DISPLAY.HEX (1+010)  (AD=ODL CD=NE ) /*.01D040 A040 .
0910/
0920 005T #DISPLAY.OFFSET (1+011)  (AD=ODL CD=NE ) /*.01D008 A008 .
0930 014T #DISPLAY.SEGMENT (1+011)  (AD=ODL CD=NE ) /*.01D020 A020 .
0940 035T #DISPLAY.HEX (1+011)  (AD=ODL CD=NE ) /*.01D040 A040 .
0950/
0960 005T #DISPLAY.OFFSET (1+012)  (AD=ODL CD=NE ) /*.01D008 A008 .
0970 014T #DISPLAY.SEGMENT (1+012)  (AD=ODL CD=NE ) /*.01D020 A020 .
0980 035T #DISPLAY.HEX (1+012)  (AD=ODL CD=NE ) /*.01D040 A040 .
0990/
1000 005T #DISPLAY.OFFSET (1+013)  (AD=ODL CD=NE ) /*.01D008 A008 .
1010 014T #DISPLAY.SEGMENT (1+013)  (AD=ODL CD=NE ) /*.01D020 A020 .
1020 035T #DISPLAY.HEX (1+013)  (AD=ODL CD=NE ) /*.01D040 A040 .
1030* MAP2: VALIDATION *****************************************************
1040* MAP2: END OF MAP *****************************************************
1050END
