0010* MAP2: PROTOTYPE
0020* INPUT USING MAP 'XXXXXXXX'
0030*     ##TITLE #CVAR #DISPLAY.ENTRY-PNT(*) #DISPLAY.LEN(*)
0040*     #DISPLAY.LOAD-ADDR(*) #DISPLAY.MODULE(*) #DISPLAY.P-S-W(*)
0050*     #DISPLAY.STATE(*) #DISPLAY.TCB-ADDR(*) #DISPLAY.TYPE(*)
0060*     #DISPLAY.USE-COUNT(*) #JOB-NAME #MODULE #STATE #TYPE
0070DEFINE DATA PARAMETER
00801 ##TITLE (A078)
00901  #CVAR (C)
01001 #DISPLAY.ENTRY-PNT (A008/00001:00015)
01101 #DISPLAY.LEN (A006/00001:00015)
01201 #DISPLAY.LOAD-ADDR (A008/00001:00015)
01301 #DISPLAY.MODULE (A008/00001:00015)
01401 #DISPLAY.P-S-W (A008/00001:00015)
01501 #DISPLAY.STATE (A007/00001:00015)
01601 #DISPLAY.TCB-ADDR (A008/00001:00015)
01701 #DISPLAY.TYPE (A006/00001:00015)
01801 #DISPLAY.USE-COUNT (N03.0/00001:00015)
01901 #JOB-NAME (A008)
02001 #MODULE (A008)
02101 #STATE (A007)
02201 #TYPE (A006)
0230END-DEFINE
0240FORMAT PS=021 LS=080 ZP=OFF SG=OFF KD=ON  IP=OFF
0250* MAP2: MAP PROFILES *****************************        410***********
0260* .TTAAAMMOO   D I D I N D I D I        ?_)¬&:+(                       *
0270* 023079        N0NNUCN             X        01 SYSPROF YL   #CVAR   1 *
0280************************************************************************
0290INPUT          (     CV=#CVAR                                         /*
0300                                                                       )
0310 002T ##TITLE  (AD=ODL ) /*.01D078 A078 .
0320/
0330/
0340 005T 'for Job:'
0350 014T #JOB-NAME  (AD=MYLT'_' CV=#CVAR ) /*.99D008 A008 .
0360/
0370/
0380 005T 'Module'
0390 014T 'Type'
0400 021T 'Entry-point Load-Addr Length use TCB-Addr PSW'
0410 072T 'State'
0420/
0430 005T #MODULE  (AD=MYLT'_' CV=#CVAR ) /*.99D008 A008 .
0440 014T #TYPE  (AD=MYLT'_' CV=#CVAR ) /*.99D006 A006 .
0450 021T '___________ _________ ______ ___ ________ ________'
0460 072T #STATE  (AD=MYLT'_' CV=#CVAR ) /*.99D007 A007 .
0470/
0480 005T #DISPLAY.MODULE (1+000)  (AD=ODL ) /*.01D008 A008 .
0490   /* A1000150000100001000010000100001100015001000001H
0500 014T #DISPLAY.TYPE (1+000)  (AD=ODL ) /*.01D006 A006 .
0510   /* A1000150000100001000010000100001100015001000001H
0520 022T #DISPLAY.ENTRY-PNT (1+000)  (AD=ODL ) /*.01D008 A008 .
0530   /* A1000150000100001000010000100001100015001000001H
0540 033T #DISPLAY.LOAD-ADDR (1+000)  (AD=ODL ) /*.01D008 A008 .
0550   /* A1000150000100001000010000100001100015001000001H
0560 043T #DISPLAY.LEN (1+000)  (AD=ODL ) /*.01D006 A006 .
0570   /* A1000150000100001000010000100001100015001000001H
0580 050T #DISPLAY.USE-COUNT (1+000)  (AD=ODR ) /*.01D003 N03.0.
0590   /* A1000150000100001000010000100001100015001000001H
0600 054T #DISPLAY.TCB-ADDR (1+000)  (AD=ODL ) /*.01D008 A008 .
0610   /* A1000150000100001000010000100001100015001000001H
0620 063T #DISPLAY.P-S-W (1+000)  (AD=ODL ) /*.01D008 A008 .
0630   /* A1000150000100001000010000100001100015001000001H
0640 072T #DISPLAY.STATE (1+000)  (AD=ODL ) /*.01D007 A007 .
0650   /* A1000150000100001000010000100001100015001000001H
0660/
0670 005T #DISPLAY.MODULE (1+001)  (AD=ODL ) /*.01D008 A008 .
0680 014T #DISPLAY.TYPE (1+001)  (AD=ODL ) /*.01D006 A006 .
0690 022T #DISPLAY.ENTRY-PNT (1+001)  (AD=ODL ) /*.01D008 A008 .
0700 033T #DISPLAY.LOAD-ADDR (1+001)  (AD=ODL ) /*.01D008 A008 .
0710 043T #DISPLAY.LEN (1+001)  (AD=ODL ) /*.01D006 A006 .
0720 050T #DISPLAY.USE-COUNT (1+001)  (AD=ODR ) /*.01D003 N03.0.
0730 054T #DISPLAY.TCB-ADDR (1+001)  (AD=ODL ) /*.01D008 A008 .
0740 063T #DISPLAY.P-S-W (1+001)  (AD=ODL ) /*.01D008 A008 .
0750 072T #DISPLAY.STATE (1+001)  (AD=ODL ) /*.01D007 A007 .
0760/
0770 005T #DISPLAY.MODULE (1+002)  (AD=ODL ) /*.01D008 A008 .
0780 014T #DISPLAY.TYPE (1+002)  (AD=ODL ) /*.01D006 A006 .
0790 022T #DISPLAY.ENTRY-PNT (1+002)  (AD=ODL ) /*.01D008 A008 .
0800 033T #DISPLAY.LOAD-ADDR (1+002)  (AD=ODL ) /*.01D008 A008 .
0810 043T #DISPLAY.LEN (1+002)  (AD=ODL ) /*.01D006 A006 .
0820 050T #DISPLAY.USE-COUNT (1+002)  (AD=ODR ) /*.01D003 N03.0.
0830 054T #DISPLAY.TCB-ADDR (1+002)  (AD=ODL ) /*.01D008 A008 .
0840 063T #DISPLAY.P-S-W (1+002)  (AD=ODL ) /*.01D008 A008 .
0850 072T #DISPLAY.STATE (1+002)  (AD=ODL ) /*.01D007 A007 .
0860/
0870 005T #DISPLAY.MODULE (1+003)  (AD=ODL ) /*.01D008 A008 .
0880 014T #DISPLAY.TYPE (1+003)  (AD=ODL ) /*.01D006 A006 .
0890 022T #DISPLAY.ENTRY-PNT (1+003)  (AD=ODL ) /*.01D008 A008 .
0900 033T #DISPLAY.LOAD-ADDR (1+003)  (AD=ODL ) /*.01D008 A008 .
0910 043T #DISPLAY.LEN (1+003)  (AD=ODL ) /*.01D006 A006 .
0920 050T #DISPLAY.USE-COUNT (1+003)  (AD=ODR ) /*.01D003 N03.0.
0930 054T #DISPLAY.TCB-ADDR (1+003)  (AD=ODL ) /*.01D008 A008 .
0940 063T #DISPLAY.P-S-W (1+003)  (AD=ODL ) /*.01D008 A008 .
0950 072T #DISPLAY.STATE (1+003)  (AD=ODL ) /*.01D007 A007 .
0960/
0970 005T #DISPLAY.MODULE (1+004)  (AD=ODL ) /*.01D008 A008 .
0980 014T #DISPLAY.TYPE (1+004)  (AD=ODL ) /*.01D006 A006 .
0990 022T #DISPLAY.ENTRY-PNT (1+004)  (AD=ODL ) /*.01D008 A008 .
1000 033T #DISPLAY.LOAD-ADDR (1+004)  (AD=ODL ) /*.01D008 A008 .
1010 043T #DISPLAY.LEN (1+004)  (AD=ODL ) /*.01D006 A006 .
1020 050T #DISPLAY.USE-COUNT (1+004)  (AD=ODR ) /*.01D003 N03.0.
1030 054T #DISPLAY.TCB-ADDR (1+004)  (AD=ODL ) /*.01D008 A008 .
1040 063T #DISPLAY.P-S-W (1+004)  (AD=ODL ) /*.01D008 A008 .
1050 072T #DISPLAY.STATE (1+004)  (AD=ODL ) /*.01D007 A007 .
1060/
1070 005T #DISPLAY.MODULE (1+005)  (AD=ODL ) /*.01D008 A008 .
1080 014T #DISPLAY.TYPE (1+005)  (AD=ODL ) /*.01D006 A006 .
1090 022T #DISPLAY.ENTRY-PNT (1+005)  (AD=ODL ) /*.01D008 A008 .
1100 033T #DISPLAY.LOAD-ADDR (1+005)  (AD=ODL ) /*.01D008 A008 .
1110 043T #DISPLAY.LEN (1+005)  (AD=ODL ) /*.01D006 A006 .
1120 050T #DISPLAY.USE-COUNT (1+005)  (AD=ODR ) /*.01D003 N03.0.
1130 054T #DISPLAY.TCB-ADDR (1+005)  (AD=ODL ) /*.01D008 A008 .
1140 063T #DISPLAY.P-S-W (1+005)  (AD=ODL ) /*.01D008 A008 .
1150 072T #DISPLAY.STATE (1+005)  (AD=ODL ) /*.01D007 A007 .
1160/
1170 005T #DISPLAY.MODULE (1+006)  (AD=ODL ) /*.01D008 A008 .
1180 014T #DISPLAY.TYPE (1+006)  (AD=ODL ) /*.01D006 A006 .
1190 022T #DISPLAY.ENTRY-PNT (1+006)  (AD=ODL ) /*.01D008 A008 .
1200 033T #DISPLAY.LOAD-ADDR (1+006)  (AD=ODL ) /*.01D008 A008 .
1210 043T #DISPLAY.LEN (1+006)  (AD=ODL ) /*.01D006 A006 .
1220 050T #DISPLAY.USE-COUNT (1+006)  (AD=ODR ) /*.01D003 N03.0.
1230 054T #DISPLAY.TCB-ADDR (1+006)  (AD=ODL ) /*.01D008 A008 .
1240 063T #DISPLAY.P-S-W (1+006)  (AD=ODL ) /*.01D008 A008 .
1250 072T #DISPLAY.STATE (1+006)  (AD=ODL ) /*.01D007 A007 .
1260/
1270 005T #DISPLAY.MODULE (1+007)  (AD=ODL ) /*.01D008 A008 .
1280 014T #DISPLAY.TYPE (1+007)  (AD=ODL ) /*.01D006 A006 .
1290 022T #DISPLAY.ENTRY-PNT (1+007)  (AD=ODL ) /*.01D008 A008 .
1300 033T #DISPLAY.LOAD-ADDR (1+007)  (AD=ODL ) /*.01D008 A008 .
1310 043T #DISPLAY.LEN (1+007)  (AD=ODL ) /*.01D006 A006 .
1320 050T #DISPLAY.USE-COUNT (1+007)  (AD=ODR ) /*.01D003 N03.0.
1330 054T #DISPLAY.TCB-ADDR (1+007)  (AD=ODL ) /*.01D008 A008 .
1340 063T #DISPLAY.P-S-W (1+007)  (AD=ODL ) /*.01D008 A008 .
1350 072T #DISPLAY.STATE (1+007)  (AD=ODL ) /*.01D007 A007 .
1360/
1370 005T #DISPLAY.MODULE (1+008)  (AD=ODL ) /*.01D008 A008 .
1380 014T #DISPLAY.TYPE (1+008)  (AD=ODL ) /*.01D006 A006 .
1390 022T #DISPLAY.ENTRY-PNT (1+008)  (AD=ODL ) /*.01D008 A008 .
1400 033T #DISPLAY.LOAD-ADDR (1+008)  (AD=ODL ) /*.01D008 A008 .
1410 043T #DISPLAY.LEN (1+008)  (AD=ODL ) /*.01D006 A006 .
1420 050T #DISPLAY.USE-COUNT (1+008)  (AD=ODR ) /*.01D003 N03.0.
1430 054T #DISPLAY.TCB-ADDR (1+008)  (AD=ODL ) /*.01D008 A008 .
1440 063T #DISPLAY.P-S-W (1+008)  (AD=ODL ) /*.01D008 A008 .
1450 072T #DISPLAY.STATE (1+008)  (AD=ODL ) /*.01D007 A007 .
1460/
1470 005T #DISPLAY.MODULE (1+009)  (AD=ODL ) /*.01D008 A008 .
1480 014T #DISPLAY.TYPE (1+009)  (AD=ODL ) /*.01D006 A006 .
1490 022T #DISPLAY.ENTRY-PNT (1+009)  (AD=ODL ) /*.01D008 A008 .
1500 033T #DISPLAY.LOAD-ADDR (1+009)  (AD=ODL ) /*.01D008 A008 .
1510 043T #DISPLAY.LEN (1+009)  (AD=ODL ) /*.01D006 A006 .
1520 050T #DISPLAY.USE-COUNT (1+009)  (AD=ODR ) /*.01D003 N03.0.
1530 054T #DISPLAY.TCB-ADDR (1+009)  (AD=ODL ) /*.01D008 A008 .
1540 063T #DISPLAY.P-S-W (1+009)  (AD=ODL ) /*.01D008 A008 .
1550 072T #DISPLAY.STATE (1+009)  (AD=ODL ) /*.01D007 A007 .
1560/
1570 005T #DISPLAY.MODULE (1+010)  (AD=ODL ) /*.01D008 A008 .
1580 014T #DISPLAY.TYPE (1+010)  (AD=ODL ) /*.01D006 A006 .
1590 022T #DISPLAY.ENTRY-PNT (1+010)  (AD=ODL ) /*.01D008 A008 .
1600 033T #DISPLAY.LOAD-ADDR (1+010)  (AD=ODL ) /*.01D008 A008 .
1610 043T #DISPLAY.LEN (1+010)  (AD=ODL ) /*.01D006 A006 .
1620 050T #DISPLAY.USE-COUNT (1+010)  (AD=ODR ) /*.01D003 N03.0.
1630 054T #DISPLAY.TCB-ADDR (1+010)  (AD=ODL ) /*.01D008 A008 .
1640 063T #DISPLAY.P-S-W (1+010)  (AD=ODL ) /*.01D008 A008 .
1650 072T #DISPLAY.STATE (1+010)  (AD=ODL ) /*.01D007 A007 .
1660/
1670 005T #DISPLAY.MODULE (1+011)  (AD=ODL ) /*.01D008 A008 .
1680 014T #DISPLAY.TYPE (1+011)  (AD=ODL ) /*.01D006 A006 .
1690 022T #DISPLAY.ENTRY-PNT (1+011)  (AD=ODL ) /*.01D008 A008 .
1700 033T #DISPLAY.LOAD-ADDR (1+011)  (AD=ODL ) /*.01D008 A008 .
1710 043T #DISPLAY.LEN (1+011)  (AD=ODL ) /*.01D006 A006 .
1720 050T #DISPLAY.USE-COUNT (1+011)  (AD=ODR ) /*.01D003 N03.0.
1730 054T #DISPLAY.TCB-ADDR (1+011)  (AD=ODL ) /*.01D008 A008 .
1740 063T #DISPLAY.P-S-W (1+011)  (AD=ODL ) /*.01D008 A008 .
1750 072T #DISPLAY.STATE (1+011)  (AD=ODL ) /*.01D007 A007 .
1760/
1770 005T #DISPLAY.MODULE (1+012)  (AD=ODL ) /*.01D008 A008 .
1780 014T #DISPLAY.TYPE (1+012)  (AD=ODL ) /*.01D006 A006 .
1790 022T #DISPLAY.ENTRY-PNT (1+012)  (AD=ODL ) /*.01D008 A008 .
1800 033T #DISPLAY.LOAD-ADDR (1+012)  (AD=ODL ) /*.01D008 A008 .
1810 043T #DISPLAY.LEN (1+012)  (AD=ODL ) /*.01D006 A006 .
1820 050T #DISPLAY.USE-COUNT (1+012)  (AD=ODR ) /*.01D003 N03.0.
1830 054T #DISPLAY.TCB-ADDR (1+012)  (AD=ODL ) /*.01D008 A008 .
1840 063T #DISPLAY.P-S-W (1+012)  (AD=ODL ) /*.01D008 A008 .
1850 072T #DISPLAY.STATE (1+012)  (AD=ODL ) /*.01D007 A007 .
1860/
1870 005T #DISPLAY.MODULE (1+013)  (AD=ODL ) /*.01D008 A008 .
1880 014T #DISPLAY.TYPE (1+013)  (AD=ODL ) /*.01D006 A006 .
1890 022T #DISPLAY.ENTRY-PNT (1+013)  (AD=ODL ) /*.01D008 A008 .
1900 033T #DISPLAY.LOAD-ADDR (1+013)  (AD=ODL ) /*.01D008 A008 .
1910 043T #DISPLAY.LEN (1+013)  (AD=ODL ) /*.01D006 A006 .
1920 050T #DISPLAY.USE-COUNT (1+013)  (AD=ODR ) /*.01D003 N03.0.
1930 054T #DISPLAY.TCB-ADDR (1+013)  (AD=ODL ) /*.01D008 A008 .
1940 063T #DISPLAY.P-S-W (1+013)  (AD=ODL ) /*.01D008 A008 .
1950 072T #DISPLAY.STATE (1+013)  (AD=ODL ) /*.01D007 A007 .
1960/
1970 005T #DISPLAY.MODULE (1+014)  (AD=ODL ) /*.01D008 A008 .
1980 014T #DISPLAY.TYPE (1+014)  (AD=ODL ) /*.01D006 A006 .
1990 022T #DISPLAY.ENTRY-PNT (1+014)  (AD=ODL ) /*.01D008 A008 .
2000 033T #DISPLAY.LOAD-ADDR (1+014)  (AD=ODL ) /*.01D008 A008 .
2010 043T #DISPLAY.LEN (1+014)  (AD=ODL ) /*.01D006 A006 .
2020 050T #DISPLAY.USE-COUNT (1+014)  (AD=ODR ) /*.01D003 N03.0.
2030 054T #DISPLAY.TCB-ADDR (1+014)  (AD=ODL ) /*.01D008 A008 .
2040 063T #DISPLAY.P-S-W (1+014)  (AD=ODL ) /*.01D008 A008 .
2050 072T #DISPLAY.STATE (1+014)  (AD=ODL ) /*.01D007 A007 .
2060* MAP2: VALIDATION *****************************************************
2070* MAP2: END OF MAP *****************************************************
2080END
