0010* MAP2: PROTOTYPE
0020* INPUT USING MAP 'XXXXXXXX'
0030*     ##TITLE #CVAR #DATA #DISPLAY.IDR-DATA(*) #DISPLAY.IDR-DATX(*)
0040*     #DISPLAY.IDR-TYPE(*) #DSNAME #MEMBER #PASSWORD #TYPE #VOLSER
0050DEFINE DATA PARAMETER
00601 ##TITLE (A078)
00701  #CVAR (C)
00801 #DATA (A040)
00901 #DISPLAY.IDR-DATA (A040/00001:00014)
01001 #DISPLAY.IDR-DATX (D/00001:00014)
01101 #DISPLAY.IDR-TYPE (A004/00001:00014)
01201 #DSNAME (A054)
01301 #MEMBER (A010)
01401 #PASSWORD (A008)
01501 #TYPE (A004)
01601 #VOLSER (A006)
0170END-DEFINE
0180FORMAT PS=021 LS=080 ZP=OFF SG=OFF KD=ON  IP=OFF
0190* MAP2: MAP PROFILES *****************************        410***********
0200* .TTAAAMMOO   D I D I N D I D I        ?_)¬&:+(                       *
0210* 023079        N0NNUCN             X        01 SYSPROF YL   #CVAR   1 *
0220************************************************************************
0230INPUT          (     CV=#CVAR                                         /*
0240                                                                       )
0250 002T ##TITLE  (AD=ODL ) /*.01D078 A078 .
0260/
0270/
0280 005T 'Dsname .....'
0290 018T #DSNAME  (AD=MILT'_' CD=NE ) /*.99D054 A054 .
0300/
0310 005T 'Volser .....'
0320 018T #VOLSER  (AD=MILT'_' CD=NE ) /*.99D006 A006 .
0330 027T 'Member ...'
0340 038T #MEMBER  (AD=MILT'_' CD=NE ) /*.99D010 A010 .
0350 051T 'Password ...'
0360 064T #PASSWORD  (AD=MILT'_' CD=NE ) /*.99D008 A008 .
0370/
0380/
0390 005T 'Type IDR-Date'
0400 021T 'Data'
0410/
0420 005T #TYPE  (AD=MYLT'_' CD=NE CV=#CVAR ) /*.99U004 A004 .
0430 010T '__________'
0440 021T #DATA  (AD=MYLT'_' CD=NE CV=#CVAR ) /*.99D040 A040 .
0450/
0460 005T #DISPLAY.IDR-TYPE (1+000)  (AD=ODL ) /*.01D004 A004 .
0470   /**A1000140000100001000010000100001100014001001000001000HV
0480 010T #DISPLAY.IDR-DATX (1+000)  (AD=ODL EM=YYYY-MM-DD ) /*.01D010 D    .
0490   /**A1000140000100001000010000100001100014001001000001001HV
0500 021T #DISPLAY.IDR-DATA (1+000)  (AD=ODL ) /*.01D040 A040 .
0510   /**A1000140000100001000010000100001100014001001000001001HV
0520/
0530 005T #DISPLAY.IDR-TYPE (1+001)  (AD=ODL ) /*.01D004 A004 .
0540 010T #DISPLAY.IDR-DATX (1+001)  (AD=ODL EM=YYYY-MM-DD ) /*.01D010 D    .
0550 021T #DISPLAY.IDR-DATA (1+001)  (AD=ODL ) /*.01D040 A040 .
0560/
0570 005T #DISPLAY.IDR-TYPE (1+002)  (AD=ODL ) /*.01D004 A004 .
0580 010T #DISPLAY.IDR-DATX (1+002)  (AD=ODL EM=YYYY-MM-DD ) /*.01D010 D    .
0590 021T #DISPLAY.IDR-DATA (1+002)  (AD=ODL ) /*.01D040 A040 .
0600/
0610 005T #DISPLAY.IDR-TYPE (1+003)  (AD=ODL ) /*.01D004 A004 .
0620 010T #DISPLAY.IDR-DATX (1+003)  (AD=ODL EM=YYYY-MM-DD ) /*.01D010 D    .
0630 021T #DISPLAY.IDR-DATA (1+003)  (AD=ODL ) /*.01D040 A040 .
0640/
0650 005T #DISPLAY.IDR-TYPE (1+004)  (AD=ODL ) /*.01D004 A004 .
0660 010T #DISPLAY.IDR-DATX (1+004)  (AD=ODL EM=YYYY-MM-DD ) /*.01D010 D    .
0670 021T #DISPLAY.IDR-DATA (1+004)  (AD=ODL ) /*.01D040 A040 .
0680/
0690 005T #DISPLAY.IDR-TYPE (1+005)  (AD=ODL ) /*.01D004 A004 .
0700 010T #DISPLAY.IDR-DATX (1+005)  (AD=ODL EM=YYYY-MM-DD ) /*.01D010 D    .
0710 021T #DISPLAY.IDR-DATA (1+005)  (AD=ODL ) /*.01D040 A040 .
0720/
0730 005T #DISPLAY.IDR-TYPE (1+006)  (AD=ODL ) /*.01D004 A004 .
0740 010T #DISPLAY.IDR-DATX (1+006)  (AD=ODL EM=YYYY-MM-DD ) /*.01D010 D    .
0750 021T #DISPLAY.IDR-DATA (1+006)  (AD=ODL ) /*.01D040 A040 .
0760/
0770 005T #DISPLAY.IDR-TYPE (1+007)  (AD=ODL ) /*.01D004 A004 .
0780 010T #DISPLAY.IDR-DATX (1+007)  (AD=ODL EM=YYYY-MM-DD ) /*.01D010 D    .
0790 021T #DISPLAY.IDR-DATA (1+007)  (AD=ODL ) /*.01D040 A040 .
0800/
0810 005T #DISPLAY.IDR-TYPE (1+008)  (AD=ODL ) /*.01D004 A004 .
0820 010T #DISPLAY.IDR-DATX (1+008)  (AD=ODL EM=YYYY-MM-DD ) /*.01D010 D    .
0830 021T #DISPLAY.IDR-DATA (1+008)  (AD=ODL ) /*.01D040 A040 .
0840/
0850 005T #DISPLAY.IDR-TYPE (1+009)  (AD=ODL ) /*.01D004 A004 .
0860 010T #DISPLAY.IDR-DATX (1+009)  (AD=ODL EM=YYYY-MM-DD ) /*.01D010 D    .
0870 021T #DISPLAY.IDR-DATA (1+009)  (AD=ODL ) /*.01D040 A040 .
0880/
0890 005T #DISPLAY.IDR-TYPE (1+010)  (AD=ODL ) /*.01D004 A004 .
0900 010T #DISPLAY.IDR-DATX (1+010)  (AD=ODL EM=YYYY-MM-DD ) /*.01D010 D    .
0910 021T #DISPLAY.IDR-DATA (1+010)  (AD=ODL ) /*.01D040 A040 .
0920/
0930 005T #DISPLAY.IDR-TYPE (1+011)  (AD=ODL ) /*.01D004 A004 .
0940 010T #DISPLAY.IDR-DATX (1+011)  (AD=ODL EM=YYYY-MM-DD ) /*.01D010 D    .
0950 021T #DISPLAY.IDR-DATA (1+011)  (AD=ODL ) /*.01D040 A040 .
0960/
0970 005T #DISPLAY.IDR-TYPE (1+012)  (AD=ODL ) /*.01D004 A004 .
0980 010T #DISPLAY.IDR-DATX (1+012)  (AD=ODL EM=YYYY-MM-DD ) /*.01D010 D    .
0990 021T #DISPLAY.IDR-DATA (1+012)  (AD=ODL ) /*.01D040 A040 .
1000/
1010 005T #DISPLAY.IDR-TYPE (1+013)  (AD=ODL ) /*.01D004 A004 .
1020 010T #DISPLAY.IDR-DATX (1+013)  (AD=ODL EM=YYYY-MM-DD ) /*.01D010 D    .
1030 021T #DISPLAY.IDR-DATA (1+013)  (AD=ODL ) /*.01D040 A040 .
1040* MAP2: VALIDATION *****************************************************
1050* MAP2: END OF MAP *****************************************************
1060END
