0010* MAP2: PROTOTYPE
0020* INPUT USING MAP 'XXXXXXXX'
0030*     ##TITLE #ADDRESS #AREA(*) #AREA-ADR(*) #AREA-HEX(*,*) #CV-ADDR
0040*     #CV-JOB #CV-OFF #JOBNAME #OFFSET
0050DEFINE DATA PARAMETER
00601 ##TITLE (A078)
00701 #ADDRESS (B004)
00801 #AREA (A018/00001:00016)
00901 #AREA-ADR (B004/00001:00016)
01001 #AREA-HEX (B004/00001:00016,00001:00004)
01101  #CV-ADDR (C)
01201  #CV-JOB (C)
01301  #CV-OFF (C)
01401 #JOBNAME (A008)
01501 #OFFSET (B004)
0160END-DEFINE
0170FORMAT PS=021 LS=080 ZP=OFF SG=OFF KD=ON  IP=OFF
0180* MAP2: MAP PROFILES *****************************        410***********
0190* .TTAA MMOO   D I D I   D I D I        ?_) &:+(                       *
0200* 023079        N0NNUCN             X        01 SYSPROF YL           1 *
0210************************************************************************
0220INPUT          (     IP=OFF                                           /*
0230                                                                       )
0240 002T ##TITLE  (AD=OD ) /*.01U078 A078 .
0250/
0260/
0270 002T 'Jobname...'
0280 013T #JOBNAME  (AD=MYT CV=#CV-JOB ) /*.99U008 A008 .
0290 024T 'Addresse..'
0300 035T #ADDRESS  (AD=MYT CV=#CV-ADDR ) /*.99U008 B004 .
0310 046T 'Offset....'
0320 057T #OFFSET  (AD=MYT CV=#CV-OFF ) /*.99U008 B004 .
0330/
0340/
0350 002T #AREA-ADR (1)  (AD=OD ) /*.01U008 B004 .
0360   /**A1000160000100001000010000100001100016001001000001000HV
0370 013T #AREA-HEX (1,1)  (AD=OD ) /*.01U008 B004 .
0380   /**A2000160000400001000010000100001120016004001000003000HV
0390 024T #AREA-HEX (1,2)  (AD=OD ) /*.01U008 B004 .
0400 035T #AREA-HEX (1,3)  (AD=OD ) /*.01U008 B004 .
0410 046T #AREA-HEX (1,4)  (AD=OD ) /*.01U008 B004 .
0420 057T #AREA (1)  (AD=OD ) /*.01U018 A018 .
0430   /**A1000160000100001000010000100001100016001001000001000HV
0440/
0450 002T #AREA-ADR (2)  (AD=OD ) /*.01U008 B004 .
0460 013T #AREA-HEX (2,1)  (AD=OD ) /*.01U008 B004 .
0470 024T #AREA-HEX (2,2)  (AD=OD ) /*.01U008 B004 .
0480 035T #AREA-HEX (2,3)  (AD=OD ) /*.01U008 B004 .
0490 046T #AREA-HEX (2,4)  (AD=OD ) /*.01U008 B004 .
0500 057T #AREA (2)  (AD=OD ) /*.01U018 A018 .
0510/
0520 002T #AREA-ADR (3)  (AD=OD ) /*.01U008 B004 .
0530 013T #AREA-HEX (3,1)  (AD=OD ) /*.01U008 B004 .
0540 024T #AREA-HEX (3,2)  (AD=OD ) /*.01U008 B004 .
0550 035T #AREA-HEX (3,3)  (AD=OD ) /*.01U008 B004 .
0560 046T #AREA-HEX (3,4)  (AD=OD ) /*.01U008 B004 .
0570 057T #AREA (3)  (AD=OD ) /*.01U018 A018 .
0580/
0590 002T #AREA-ADR (4)  (AD=OD ) /*.01U008 B004 .
0600 013T #AREA-HEX (4,1)  (AD=OD ) /*.01U008 B004 .
0610 024T #AREA-HEX (4,2)  (AD=OD ) /*.01U008 B004 .
0620 035T #AREA-HEX (4,3)  (AD=OD ) /*.01U008 B004 .
0630 046T #AREA-HEX (4,4)  (AD=OD ) /*.01U008 B004 .
0640 057T #AREA (4)  (AD=OD ) /*.01U018 A018 .
0650/
0660 002T #AREA-ADR (5)  (AD=OD ) /*.01U008 B004 .
0670 013T #AREA-HEX (5,1)  (AD=OD ) /*.01U008 B004 .
0680 024T #AREA-HEX (5,2)  (AD=OD ) /*.01U008 B004 .
0690 035T #AREA-HEX (5,3)  (AD=OD ) /*.01U008 B004 .
0700 046T #AREA-HEX (5,4)  (AD=OD ) /*.01U008 B004 .
0710 057T #AREA (5)  (AD=OD ) /*.01U018 A018 .
0720/
0730 002T #AREA-ADR (6)  (AD=OD ) /*.01U008 B004 .
0740 013T #AREA-HEX (6,1)  (AD=OD ) /*.01U008 B004 .
0750 024T #AREA-HEX (6,2)  (AD=OD ) /*.01U008 B004 .
0760 035T #AREA-HEX (6,3)  (AD=OD ) /*.01U008 B004 .
0770 046T #AREA-HEX (6,4)  (AD=OD ) /*.01U008 B004 .
0780 057T #AREA (6)  (AD=OD ) /*.01U018 A018 .
0790/
0800 002T #AREA-ADR (7)  (AD=OD ) /*.01U008 B004 .
0810 013T #AREA-HEX (7,1)  (AD=OD ) /*.01U008 B004 .
0820 024T #AREA-HEX (7,2)  (AD=OD ) /*.01U008 B004 .
0830 035T #AREA-HEX (7,3)  (AD=OD ) /*.01U008 B004 .
0840 046T #AREA-HEX (7,4)  (AD=OD ) /*.01U008 B004 .
0850 057T #AREA (7)  (AD=OD ) /*.01U018 A018 .
0860/
0870 002T #AREA-ADR (8)  (AD=OD ) /*.01U008 B004 .
0880 013T #AREA-HEX (8,1)  (AD=OD ) /*.01U008 B004 .
0890 024T #AREA-HEX (8,2)  (AD=OD ) /*.01U008 B004 .
0900 035T #AREA-HEX (8,3)  (AD=OD ) /*.01U008 B004 .
0910 046T #AREA-HEX (8,4)  (AD=OD ) /*.01U008 B004 .
0920 057T #AREA (8)  (AD=OD ) /*.01U018 A018 .
0930/
0940 002T #AREA-ADR (9)  (AD=OD ) /*.01U008 B004 .
0950 013T #AREA-HEX (9,1)  (AD=OD ) /*.01U008 B004 .
0960 024T #AREA-HEX (9,2)  (AD=OD ) /*.01U008 B004 .
0970 035T #AREA-HEX (9,3)  (AD=OD ) /*.01U008 B004 .
0980 046T #AREA-HEX (9,4)  (AD=OD ) /*.01U008 B004 .
0990 057T #AREA (9)  (AD=OD ) /*.01U018 A018 .
1000/
1010 002T #AREA-ADR (10)  (AD=OD ) /*.01U008 B004 .
1020 013T #AREA-HEX (10,1)  (AD=OD ) /*.01U008 B004 .
1030 024T #AREA-HEX (10,2)  (AD=OD ) /*.01U008 B004 .
1040 035T #AREA-HEX (10,3)  (AD=OD ) /*.01U008 B004 .
1050 046T #AREA-HEX (10,4)  (AD=OD ) /*.01U008 B004 .
1060 057T #AREA (10)  (AD=OD ) /*.01U018 A018 .
1070/
1080 002T #AREA-ADR (11)  (AD=OD ) /*.01U008 B004 .
1090 013T #AREA-HEX (11,1)  (AD=OD ) /*.01U008 B004 .
1100 024T #AREA-HEX (11,2)  (AD=OD ) /*.01U008 B004 .
1110 035T #AREA-HEX (11,3)  (AD=OD ) /*.01U008 B004 .
1120 046T #AREA-HEX (11,4)  (AD=OD ) /*.01U008 B004 .
1130 057T #AREA (11)  (AD=OD ) /*.01U018 A018 .
1140/
1150 002T #AREA-ADR (12)  (AD=OD ) /*.01U008 B004 .
1160 013T #AREA-HEX (12,1)  (AD=OD ) /*.01U008 B004 .
1170 024T #AREA-HEX (12,2)  (AD=OD ) /*.01U008 B004 .
1180 035T #AREA-HEX (12,3)  (AD=OD ) /*.01U008 B004 .
1190 046T #AREA-HEX (12,4)  (AD=OD ) /*.01U008 B004 .
1200 057T #AREA (12)  (AD=OD ) /*.01U018 A018 .
1210/
1220 002T #AREA-ADR (13)  (AD=OD ) /*.01U008 B004 .
1230 013T #AREA-HEX (13,1)  (AD=OD ) /*.01U008 B004 .
1240 024T #AREA-HEX (13,2)  (AD=OD ) /*.01U008 B004 .
1250 035T #AREA-HEX (13,3)  (AD=OD ) /*.01U008 B004 .
1260 046T #AREA-HEX (13,4)  (AD=OD ) /*.01U008 B004 .
1270 057T #AREA (13)  (AD=OD ) /*.01U018 A018 .
1280/
1290 002T #AREA-ADR (14)  (AD=OD ) /*.01U008 B004 .
1300 013T #AREA-HEX (14,1)  (AD=OD ) /*.01U008 B004 .
1310 024T #AREA-HEX (14,2)  (AD=OD ) /*.01U008 B004 .
1320 035T #AREA-HEX (14,3)  (AD=OD ) /*.01U008 B004 .
1330 046T #AREA-HEX (14,4)  (AD=OD ) /*.01U008 B004 .
1340 057T #AREA (14)  (AD=OD ) /*.01U018 A018 .
1350/
1360 002T #AREA-ADR (15)  (AD=OD ) /*.01U008 B004 .
1370 013T #AREA-HEX (15,1)  (AD=OD ) /*.01U008 B004 .
1380 024T #AREA-HEX (15,2)  (AD=OD ) /*.01U008 B004 .
1390 035T #AREA-HEX (15,3)  (AD=OD ) /*.01U008 B004 .
1400 046T #AREA-HEX (15,4)  (AD=OD ) /*.01U008 B004 .
1410 057T #AREA (15)  (AD=OD ) /*.01U018 A018 .
1420/
1430 002T #AREA-ADR (16)  (AD=OD ) /*.01U008 B004 .
1440 013T #AREA-HEX (16,1)  (AD=OD ) /*.01U008 B004 .
1450 024T #AREA-HEX (16,2)  (AD=OD ) /*.01U008 B004 .
1460 035T #AREA-HEX (16,3)  (AD=OD ) /*.01U008 B004 .
1470 046T #AREA-HEX (16,4)  (AD=OD ) /*.01U008 B004 .
1480 057T #AREA (16)  (AD=OD ) /*.01U018 A018 .
1490/
1500* MAP2: VALIDATION *****************************************************
1510* MAP2: END OF MAP *****************************************************
1520END
