0010* MAP2: PROTOTYPE
0020* INPUT USING MAP 'XXXXXXXX'
0030*     ##TITLE #ADDRESS #AREA(*) #AREA-ADR(*) #AREA-HEX(*,*) #CV-ADDR
0040*     #CV-JOB #CV-OFF #JOBNAME #OFFSET
0050DEFINE DATA PARAMETER
00601 ##TITLE (A078)
00701 #ADDRESS (B008)
00801 #AREA (A018/00001:00016)
00901 #AREA-ADR (B008/00001:00016)
01001 #AREA-HEX (B004/00001:00016,00001:00004)
01101  #CV-ADDR (C)
01201  #CV-JOB (C)
01301  #CV-OFF (C)
01401 #JOBNAME (A008)
01501 #OFFSET (B004)
0160END-DEFINE
0170FORMAT PS=021 LS=080 ZP=OFF SG=OFF KD=ON  IP=OFF
0180* MAP2: MAP PROFILES *****************************        410***********
0190* .TTAAAMMOO   D I D I N D I D I        ?_)¬&:+(                       *
0200* 023079        N0 NUCN             X        01 SYSPROF YL           1 *
0210************************************************************************
0220INPUT          (     IP=OFF                                           /*
0230                                                                       )
0240 002T ##TITLE  (AD=OD ) /*.01U078 A078 .
0250/
0260/
0270 002T 'Jobname..'
0280 012T #JOBNAME  (AD=MYT CV=#CV-JOB ) /*.99U008 A008 .
0290 022T 'Address..'
0300 032T #ADDRESS  (AD=MYT CV=#CV-ADDR ) /*.99U016 B008 8          .
0310 050T 'Offset...'
0320 060T #OFFSET  (AD=MYT CV=#CV-OFF ) /*.99U008 B004 .
0330/
0340/
0350 002T #AREA-ADR (1)  (AD=OD ) /*.01U016 B008 8          .
0360   /**A1000160000100001000010000100001100016001001000001000HV
0370 020T #AREA-HEX (001,001)  (AD=OD ) /*.01U008 B004 .
0380   /**A2000160000400001000010000100001120016004001000003000HV
0390 030T #AREA-HEX (001,002)  (AD=OD ) /*.01U008 B004 .
0400 040T #AREA-HEX (001,003)  (AD=OD ) /*.01U008 B004 .
0410 050T #AREA-HEX (001,004)  (AD=OD ) /*.01U008 B004 .
0420 060T #AREA (001)  (AD=OD ) /*.01U018 A018 .
0430   /**A1000160000100001000010000100001100016001001000001000HV
0440/
0450 002T #AREA-ADR (2)  (AD=OD ) /*.01U016 B008 8          .
0460 020T #AREA-HEX (002,001)  (AD=OD ) /*.01U008 B004 .
0470 030T #AREA-HEX (002,002)  (AD=OD ) /*.01U008 B004 .
0480 040T #AREA-HEX (002,003)  (AD=OD ) /*.01U008 B004 .
0490 050T #AREA-HEX (002,004)  (AD=OD ) /*.01U008 B004 .
0500 060T #AREA (002)  (AD=OD ) /*.01U018 A018 .
0510/
0520 002T #AREA-ADR (3)  (AD=OD ) /*.01U016 B008 8          .
0530 020T #AREA-HEX (003,001)  (AD=OD ) /*.01U008 B004 .
0540 030T #AREA-HEX (003,002)  (AD=OD ) /*.01U008 B004 .
0550 040T #AREA-HEX (003,003)  (AD=OD ) /*.01U008 B004 .
0560 050T #AREA-HEX (003,004)  (AD=OD ) /*.01U008 B004 .
0570 060T #AREA (003)  (AD=OD ) /*.01U018 A018 .
0580/
0590 002T #AREA-ADR (4)  (AD=OD ) /*.01U016 B008 8          .
0600 020T #AREA-HEX (004,001)  (AD=OD ) /*.01U008 B004 .
0610 030T #AREA-HEX (004,002)  (AD=OD ) /*.01U008 B004 .
0620 040T #AREA-HEX (004,003)  (AD=OD ) /*.01U008 B004 .
0630 050T #AREA-HEX (004,004)  (AD=OD ) /*.01U008 B004 .
0640 060T #AREA (004)  (AD=OD ) /*.01U018 A018 .
0650/
0660 002T #AREA-ADR (5)  (AD=OD ) /*.01U016 B008 8          .
0670 020T #AREA-HEX (005,001)  (AD=OD ) /*.01U008 B004 .
0680 030T #AREA-HEX (005,002)  (AD=OD ) /*.01U008 B004 .
0690 040T #AREA-HEX (005,003)  (AD=OD ) /*.01U008 B004 .
0700 050T #AREA-HEX (005,004)  (AD=OD ) /*.01U008 B004 .
0710 060T #AREA (005)  (AD=OD ) /*.01U018 A018 .
0720/
0730 002T #AREA-ADR (6)  (AD=OD ) /*.01U016 B008 8          .
0740 020T #AREA-HEX (006,001)  (AD=OD ) /*.01U008 B004 .
0750 030T #AREA-HEX (006,002)  (AD=OD ) /*.01U008 B004 .
0760 040T #AREA-HEX (006,003)  (AD=OD ) /*.01U008 B004 .
0770 050T #AREA-HEX (006,004)  (AD=OD ) /*.01U008 B004 .
0780 060T #AREA (006)  (AD=OD ) /*.01U018 A018 .
0790/
0800 002T #AREA-ADR (7)  (AD=OD ) /*.01U016 B008 8          .
0810 020T #AREA-HEX (007,001)  (AD=OD ) /*.01U008 B004 .
0820 030T #AREA-HEX (007,002)  (AD=OD ) /*.01U008 B004 .
0830 040T #AREA-HEX (007,003)  (AD=OD ) /*.01U008 B004 .
0840 050T #AREA-HEX (007,004)  (AD=OD ) /*.01U008 B004 .
0850 060T #AREA (007)  (AD=OD ) /*.01U018 A018 .
0860/
0870 002T #AREA-ADR (8)  (AD=OD ) /*.01U016 B008 8          .
0880 020T #AREA-HEX (008,001)  (AD=OD ) /*.01U008 B004 .
0890 030T #AREA-HEX (008,002)  (AD=OD ) /*.01U008 B004 .
0900 040T #AREA-HEX (008,003)  (AD=OD ) /*.01U008 B004 .
0910 050T #AREA-HEX (008,004)  (AD=OD ) /*.01U008 B004 .
0920 060T #AREA (008)  (AD=OD ) /*.01U018 A018 .
0930/
0940 002T #AREA-ADR (9)  (AD=OD ) /*.01U016 B008 8          .
0950 020T #AREA-HEX (009,001)  (AD=OD ) /*.01U008 B004 .
0960 030T #AREA-HEX (009,002)  (AD=OD ) /*.01U008 B004 .
0970 040T #AREA-HEX (009,003)  (AD=OD ) /*.01U008 B004 .
0980 050T #AREA-HEX (009,004)  (AD=OD ) /*.01U008 B004 .
0990 060T #AREA (009)  (AD=OD ) /*.01U018 A018 .
1000/
1010 002T #AREA-ADR (10)  (AD=OD ) /*.01U016 B008 8          .
1020 020T #AREA-HEX (010,001)  (AD=OD ) /*.01U008 B004 .
1030 030T #AREA-HEX (010,002)  (AD=OD ) /*.01U008 B004 .
1040 040T #AREA-HEX (010,003)  (AD=OD ) /*.01U008 B004 .
1050 050T #AREA-HEX (010,004)  (AD=OD ) /*.01U008 B004 .
1060 060T #AREA (010)  (AD=OD ) /*.01U018 A018 .
1070/
1080 002T #AREA-ADR (11)  (AD=OD ) /*.01U016 B008 8          .
1090 020T #AREA-HEX (011,001)  (AD=OD ) /*.01U008 B004 .
1100 030T #AREA-HEX (011,002)  (AD=OD ) /*.01U008 B004 .
1110 040T #AREA-HEX (011,003)  (AD=OD ) /*.01U008 B004 .
1120 050T #AREA-HEX (011,004)  (AD=OD ) /*.01U008 B004 .
1130 060T #AREA (011)  (AD=OD ) /*.01U018 A018 .
1140/
1150 002T #AREA-ADR (12)  (AD=OD ) /*.01U016 B008 8          .
1160 020T #AREA-HEX (012,001)  (AD=OD ) /*.01U008 B004 .
1170 030T #AREA-HEX (012,002)  (AD=OD ) /*.01U008 B004 .
1180 040T #AREA-HEX (012,003)  (AD=OD ) /*.01U008 B004 .
1190 050T #AREA-HEX (012,004)  (AD=OD ) /*.01U008 B004 .
1200 060T #AREA (012)  (AD=OD ) /*.01U018 A018 .
1210/
1220 002T #AREA-ADR (13)  (AD=OD ) /*.01U016 B008 8          .
1230 020T #AREA-HEX (013,001)  (AD=OD ) /*.01U008 B004 .
1240 030T #AREA-HEX (013,002)  (AD=OD ) /*.01U008 B004 .
1250 040T #AREA-HEX (013,003)  (AD=OD ) /*.01U008 B004 .
1260 050T #AREA-HEX (013,004)  (AD=OD ) /*.01U008 B004 .
1270 060T #AREA (013)  (AD=OD ) /*.01U018 A018 .
1280/
1290 002T #AREA-ADR (14)  (AD=OD ) /*.01U016 B008 8          .
1300 020T #AREA-HEX (014,001)  (AD=OD ) /*.01U008 B004 .
1310 030T #AREA-HEX (014,002)  (AD=OD ) /*.01U008 B004 .
1320 040T #AREA-HEX (014,003)  (AD=OD ) /*.01U008 B004 .
1330 050T #AREA-HEX (014,004)  (AD=OD ) /*.01U008 B004 .
1340 060T #AREA (014)  (AD=OD ) /*.01U018 A018 .
1350/
1360 002T #AREA-ADR (15)  (AD=OD ) /*.01U016 B008 8          .
1370 020T #AREA-HEX (015,001)  (AD=OD ) /*.01U008 B004 .
1380 030T #AREA-HEX (015,002)  (AD=OD ) /*.01U008 B004 .
1390 040T #AREA-HEX (015,003)  (AD=OD ) /*.01U008 B004 .
1400 050T #AREA-HEX (015,004)  (AD=OD ) /*.01U008 B004 .
1410 060T #AREA (015)  (AD=OD ) /*.01U018 A018 .
1420/
1430 002T #AREA-ADR (16)  (AD=OD ) /*.01U016 B008 8          .
1440 020T #AREA-HEX (016,001)  (AD=OD ) /*.01U008 B004 .
1450 030T #AREA-HEX (016,002)  (AD=OD ) /*.01U008 B004 .
1460 040T #AREA-HEX (016,003)  (AD=OD ) /*.01U008 B004 .
1470 050T #AREA-HEX (016,004)  (AD=OD ) /*.01U008 B004 .
1480 060T #AREA (016)  (AD=OD ) /*.01U018 A018 .
1490/
1500* MAP2: VALIDATION *****************************************************
1510* MAP2: END OF MAP *****************************************************
1520END
