0010* MAP2: PROTOTYPE
0020* INPUT USING MAP 'XXXXXXXX'
0030*     ##TITLE #ADDRESS #AREA(*) #AREA-ADR(*) #AREA-HEX(*,*) #CV-ADDR
0040*     #CV-JOB #CV-OFF #JOBNAME #OFFSET
0050DEFINE DATA PARAMETER
00601 ##TITLE (A078)
00701 #ADDRESS (B004)
00801 #AREA (A018/00001:00016)
00901 #AREA-ADR (B004/00001:00016)
01001 #AREA-HEX (B004/00001:00016,00001:00004)
01101  #CV-ADDR (C)
01201  #CV-JOB (C)
01301  #CV-OFF (C)
01401 #JOBNAME (A008)
01501 #OFFSET (B004)
0160END-DEFINE
0170FORMAT PS=021 LS=080 ZP=OFF SG=OFF KD=ON  IP=OFF
0180* MAP2: MAP PROFILES *****************************        410***********
0190* .TTAAAMMOO   D I D I N D I D I        ?_)¬&:+(                       *
0200* 023079        N0 NUCN             X        01 SYSPROF YL           1 *
0210************************************************************************
0220INPUT          (     IP=OFF                                           /*
0230                                                                       )
0240 002T ##TITLE  (AD=OD ) /*.01U078 A078 .
0250/
0260/
0270 002T 'Jobname...'
0280 013T #JOBNAME  (AD=MYT CV=#CV-JOB ) /*.99U008 A008 .
0290 024T 'Address...'
0300 035T #ADDRESS  (AD=MYT CV=#CV-ADDR ) /*.99U008 B004 .
0310 046T 'Offset....'
0320 057T #OFFSET  (AD=MYT CV=#CV-OFF ) /*.99U008 B004 .
0330/
0340/
0350 002T #AREA-ADR (001)  (AD=OD ) /*.01U008 B004 .
0360   /**A1000160000100001000010000100001100016001001000001000HV
0370 013T #AREA-HEX (001,001)  (AD=OD ) /*.01U008 B004 .
0380   /**A2000160000400001000010000100001120016004001000003000HV
0390 024T #AREA-HEX (001,002)  (AD=OD ) /*.01U008 B004 .
0400 035T #AREA-HEX (001,003)  (AD=OD ) /*.01U008 B004 .
0410 046T #AREA-HEX (001,004)  (AD=OD ) /*.01U008 B004 .
0420 057T #AREA (001)  (AD=OD ) /*.01U018 A018 .
0430   /**A1000160000100001000010000100001100016001001000001000HV
0440/
0450 002T #AREA-ADR (002)  (AD=OD ) /*.01U008 B004 .
0460 013T #AREA-HEX (002,001)  (AD=OD ) /*.01U008 B004 .
0470 024T #AREA-HEX (002,002)  (AD=OD ) /*.01U008 B004 .
0480 035T #AREA-HEX (002,003)  (AD=OD ) /*.01U008 B004 .
0490 046T #AREA-HEX (002,004)  (AD=OD ) /*.01U008 B004 .
0500 057T #AREA (002)  (AD=OD ) /*.01U018 A018 .
0510/
0520 002T #AREA-ADR (003)  (AD=OD ) /*.01U008 B004 .
0530 013T #AREA-HEX (003,001)  (AD=OD ) /*.01U008 B004 .
0540 024T #AREA-HEX (003,002)  (AD=OD ) /*.01U008 B004 .
0550 035T #AREA-HEX (003,003)  (AD=OD ) /*.01U008 B004 .
0560 046T #AREA-HEX (003,004)  (AD=OD ) /*.01U008 B004 .
0570 057T #AREA (003)  (AD=OD ) /*.01U018 A018 .
0580/
0590 002T #AREA-ADR (004)  (AD=OD ) /*.01U008 B004 .
0600 013T #AREA-HEX (004,001)  (AD=OD ) /*.01U008 B004 .
0610 024T #AREA-HEX (004,002)  (AD=OD ) /*.01U008 B004 .
0620 035T #AREA-HEX (004,003)  (AD=OD ) /*.01U008 B004 .
0630 046T #AREA-HEX (004,004)  (AD=OD ) /*.01U008 B004 .
0640 057T #AREA (004)  (AD=OD ) /*.01U018 A018 .
0650/
0660 002T #AREA-ADR (005)  (AD=OD ) /*.01U008 B004 .
0670 013T #AREA-HEX (005,001)  (AD=OD ) /*.01U008 B004 .
0680 024T #AREA-HEX (005,002)  (AD=OD ) /*.01U008 B004 .
0690 035T #AREA-HEX (005,003)  (AD=OD ) /*.01U008 B004 .
0700 046T #AREA-HEX (005,004)  (AD=OD ) /*.01U008 B004 .
0710 057T #AREA (005)  (AD=OD ) /*.01U018 A018 .
0720/
0730 002T #AREA-ADR (006)  (AD=OD ) /*.01U008 B004 .
0740 013T #AREA-HEX (006,001)  (AD=OD ) /*.01U008 B004 .
0750 024T #AREA-HEX (006,002)  (AD=OD ) /*.01U008 B004 .
0760 035T #AREA-HEX (006,003)  (AD=OD ) /*.01U008 B004 .
0770 046T #AREA-HEX (006,004)  (AD=OD ) /*.01U008 B004 .
0780 057T #AREA (006)  (AD=OD ) /*.01U018 A018 .
0790/
0800 002T #AREA-ADR (007)  (AD=OD ) /*.01U008 B004 .
0810 013T #AREA-HEX (007,001)  (AD=OD ) /*.01U008 B004 .
0820 024T #AREA-HEX (007,002)  (AD=OD ) /*.01U008 B004 .
0830 035T #AREA-HEX (007,003)  (AD=OD ) /*.01U008 B004 .
0840 046T #AREA-HEX (007,004)  (AD=OD ) /*.01U008 B004 .
0850 057T #AREA (007)  (AD=OD ) /*.01U018 A018 .
0860/
0870 002T #AREA-ADR (008)  (AD=OD ) /*.01U008 B004 .
0880 013T #AREA-HEX (008,001)  (AD=OD ) /*.01U008 B004 .
0890 024T #AREA-HEX (008,002)  (AD=OD ) /*.01U008 B004 .
0900 035T #AREA-HEX (008,003)  (AD=OD ) /*.01U008 B004 .
0910 046T #AREA-HEX (008,004)  (AD=OD ) /*.01U008 B004 .
0920 057T #AREA (008)  (AD=OD ) /*.01U018 A018 .
0930/
0940 002T #AREA-ADR (009)  (AD=OD ) /*.01U008 B004 .
0950 013T #AREA-HEX (009,001)  (AD=OD ) /*.01U008 B004 .
0960 024T #AREA-HEX (009,002)  (AD=OD ) /*.01U008 B004 .
0970 035T #AREA-HEX (009,003)  (AD=OD ) /*.01U008 B004 .
0980 046T #AREA-HEX (009,004)  (AD=OD ) /*.01U008 B004 .
0990 057T #AREA (009)  (AD=OD ) /*.01U018 A018 .
1000/
1010 002T #AREA-ADR (010)  (AD=OD ) /*.01U008 B004 .
1020 013T #AREA-HEX (010,001)  (AD=OD ) /*.01U008 B004 .
1030 024T #AREA-HEX (010,002)  (AD=OD ) /*.01U008 B004 .
1040 035T #AREA-HEX (010,003)  (AD=OD ) /*.01U008 B004 .
1050 046T #AREA-HEX (010,004)  (AD=OD ) /*.01U008 B004 .
1060 057T #AREA (010)  (AD=OD ) /*.01U018 A018 .
1070/
1080 002T #AREA-ADR (011)  (AD=OD ) /*.01U008 B004 .
1090 013T #AREA-HEX (011,001)  (AD=OD ) /*.01U008 B004 .
1100 024T #AREA-HEX (011,002)  (AD=OD ) /*.01U008 B004 .
1110 035T #AREA-HEX (011,003)  (AD=OD ) /*.01U008 B004 .
1120 046T #AREA-HEX (011,004)  (AD=OD ) /*.01U008 B004 .
1130 057T #AREA (011)  (AD=OD ) /*.01U018 A018 .
1140/
1150 002T #AREA-ADR (012)  (AD=OD ) /*.01U008 B004 .
1160 013T #AREA-HEX (012,001)  (AD=OD ) /*.01U008 B004 .
1170 024T #AREA-HEX (012,002)  (AD=OD ) /*.01U008 B004 .
1180 035T #AREA-HEX (012,003)  (AD=OD ) /*.01U008 B004 .
1190 046T #AREA-HEX (012,004)  (AD=OD ) /*.01U008 B004 .
1200 057T #AREA (012)  (AD=OD ) /*.01U018 A018 .
1210/
1220 002T #AREA-ADR (013)  (AD=OD ) /*.01U008 B004 .
1230 013T #AREA-HEX (013,001)  (AD=OD ) /*.01U008 B004 .
1240 024T #AREA-HEX (013,002)  (AD=OD ) /*.01U008 B004 .
1250 035T #AREA-HEX (013,003)  (AD=OD ) /*.01U008 B004 .
1260 046T #AREA-HEX (013,004)  (AD=OD ) /*.01U008 B004 .
1270 057T #AREA (013)  (AD=OD ) /*.01U018 A018 .
1280/
1290 002T #AREA-ADR (014)  (AD=OD ) /*.01U008 B004 .
1300 013T #AREA-HEX (014,001)  (AD=OD ) /*.01U008 B004 .
1310 024T #AREA-HEX (014,002)  (AD=OD ) /*.01U008 B004 .
1320 035T #AREA-HEX (014,003)  (AD=OD ) /*.01U008 B004 .
1330 046T #AREA-HEX (014,004)  (AD=OD ) /*.01U008 B004 .
1340 057T #AREA (014)  (AD=OD ) /*.01U018 A018 .
1350/
1360 002T #AREA-ADR (015)  (AD=OD ) /*.01U008 B004 .
1370 013T #AREA-HEX (015,001)  (AD=OD ) /*.01U008 B004 .
1380 024T #AREA-HEX (015,002)  (AD=OD ) /*.01U008 B004 .
1390 035T #AREA-HEX (015,003)  (AD=OD ) /*.01U008 B004 .
1400 046T #AREA-HEX (015,004)  (AD=OD ) /*.01U008 B004 .
1410 057T #AREA (015)  (AD=OD ) /*.01U018 A018 .
1420/
1430 002T #AREA-ADR (016)  (AD=OD ) /*.01U008 B004 .
1440 013T #AREA-HEX (016,001)  (AD=OD ) /*.01U008 B004 .
1450 024T #AREA-HEX (016,002)  (AD=OD ) /*.01U008 B004 .
1460 035T #AREA-HEX (016,003)  (AD=OD ) /*.01U008 B004 .
1470 046T #AREA-HEX (016,004)  (AD=OD ) /*.01U008 B004 .
1480 057T #AREA (016)  (AD=OD ) /*.01U018 A018 .
1490/
1500* MAP2: VALIDATION *****************************************************
1510* MAP2: END OF MAP *****************************************************
1520END
