0010* Program   MNPLOG
0020* View      NATPROC-LOGON
0030*
0040* Function  Logon/Logoff to NATURAL PROCESS
0050*
0060* ----------------------------------------------------------------------
0070* Maintenance..:
0080* STL 2006-07-13   NPE341:   Allow mixed-case passwords for z/OS 1.7
0090* ----------------------------------------------------------------------
0100*
0110DEFINE DATA
0120   GLOBAL USING TUTO
0130   LOCAL USING NPLOGONL
0140END-DEFINE
0150*
0160ASSIGN NATPROC-LOGON.LOGON-ID = *INIT-USER
0170ASSIGN NATPROC-LOGON.FUNCTION = 'LOGON'
0180*
0190ASSIGN ##MSG-NR = 1010
0200CALLNAT 'NAT00029'   /* Save current environment
0210SET CONTROL 'L'      /* Set lower case acceptable
0220INPUT (AD=MI'_') TEXT *##MSG-NR, ##MSG-TXT1, ##MSG-TXT2
0230                 MARK *NATPROC-LOGON.PASSWORD
0240    / ##TITLE (AD=OI IP=OFF)
0250   // '  Function ..:' NATPROC-LOGON.FUNCTION
0260    / '  User-ID ...:' NATPROC-LOGON.LOGON-ID
0270    / '  Password ..:' NATPROC-LOGON.PASSWORD (AD=N)
0280    / '  Node ......:' ##NODE (SG=OFF)
0290*
0300DECIDE FOR FIRST CONDITION
0310   WHEN NATPROC-LOGON.LOGON-ID = ' '
0320      REINPUT *1025
0330   WHEN NATPROC-LOGON.PASSWORD = ' ' AND NATPROC-LOGON.FUNCTION= 'LOGON'
0340      REINPUT *1026 MARK *NATPROC-LOGON.PASSWORD
0350   WHEN NONE
0360      IGNORE
0370END-DECIDE
0380*
0390PROCESS NATPROC-LOGON USING LOGON-ID = NATPROC-LOGON.LOGON-ID
0400                        ,   PASSWORD = NATPROC-LOGON.PASSWORD
0410                        ,   FUNCTION = NATPROC-LOGON.FUNCTION
0420                        ,   NODE     = ##NODE
0430                     GIVING ERROR-CODE
0440                            ERROR-TEXT
0450REINPUT ERROR-TEXT
0460CALLNAT 'NAT00030'   /* Restore environment
0470*
0480END
