0010* Program   MNPUSER
0020* View      NATPROC-USERS
0030*
0040* Function  Display Users of NATURAL PROCESS
0050*
0060* ----------------------------------------------------------------------
0070*
0080DEFINE DATA
0090   GLOBAL USING TUTO
0100   LOCAL USING NP-USERL
0110   LOCAL 1 #FULL-SCAN (A3)
0120END-DEFINE
0130*
0140INPUT (AD=MIT'_' ZP=OFF)
0150   //  ##TITLE (AD=OI IP=OFF)
0160   //  '  Display internal tasks....:' #FULL-SCAN '(YES/NO)'
0170*
0180IF #FULL-SCAN NE 'YES' AND
0190   #FULL-SCAN NE 'NO'  AND
0200   #FULL-SCAN NE '  '
0210   REINPUT WITH TEXT 'Please enter YES or NO'
0220END-IF
0230*
0240WRITE TITLE / ##TITLE (AD=I) /
0250*
0260FIND NATPROC-USERS WITH NODE = ##NODE
0270                   AND FULL-SCAN = #FULL-SCAN
0280*
0290   IF ERROR-CODE NE 0
0300      ASSIGN ##MSG-NR = 1000
0310      ASSIGN ##MSG-TXT1 = ERROR-TEXT
0320      STOP
0330   END-IF
0340*
0350   DISPLAY USER-ID
0360           ADABAS-ID
0370           'ESY-ID' NATPROC-ID (EM=X(4))
0380           CPU
0390           LAST-ACTIVITY
0400           IO-COUNT
0410           TASK-ID
0420           'INT' INTERNAL-TASK
0430*          CORE-USED
0440*          CORE-FREE
0450END-FIND
0460*
0470END
