0010* Program   MSMSG
0020* View      SEND-MESSAGE
0030*
0040* Function  Send a message to a COM-PLETE/TSO user or CONSOLE
0050*
0060* ----------------------------------------------------------------------
0070*
0080DEFINE DATA
0090   GLOBAL USING TUTO
0100   LOCAL USING MSG-L
0110   LOCAL 01 #CONS    (A1)
0120         01 #USER    (A8)
0130         01 #NOLOGSW (A1)
0140END-DEFINE
0150*
0160INPUT (AD=MI'_' IP=OFF)
0170    / ##TITLE (AD=OI IP=OFF)
0180  /// SEND-MESSAGE.MESSAGE
0190  /// 'Destination' (I)
0200   // '    Operator console ......:' #CONS '(y/n)'
0210    / '  Or' (I)
0220    / '    User-ID ...............:' #USER
0230   // '    Send to console if'
0240    / '    user not logged on ? ..:' #NOLOGSW '(y/n)'
0250*
0260IF SEND-MESSAGE.MESSAGE = ' '
0270   REINPUT *1013 MARK *SEND-MESSAGE.MESSAGE
0280END-IF
0290*
0300IF #CONS = 'Y'
0310   ASSIGN SEND-MESSAGE.DESTINATION = '*CONSOLE'
0320ELSE
0330   IF #USER = ' '
0340      REINPUT *1014 MARK *#CONS
0350   ELSE
0360      ASSIGN SEND-MESSAGE.DESTINATION = #USER
0370   END-IF
0380END-IF
0390*
0400IF #NOLOGSW = 'Y'
0410   ASSIGN SEND-MESSAGE.NOLOG = 'CONSOLE'
0420ELSE
0430   RESET SEND-MESSAGE.NOLOG
0440END-IF
0450*
0460PROCESS SEND-MESSAGE USING MESSAGE     = SEND-MESSAGE.MESSAGE
0470                       ,   DESTINATION = SEND-MESSAGE.DESTINATION
0480                       ,   NOLOG       = SEND-MESSAGE.NOLOG
0490                       ,   NODE        = ##NODE
0500                    GIVING ERROR-CODE
0510                           ERROR-TEXT
0520   COMPRESS ERROR-TEXT STATUS TO MESSAGE
0530   REINPUT MESSAGE
0540*
0550END
