0010* MAP2: PROTOTYPE
0020* INPUT USING MAP 'XXXXXXXX'
0030*     ##TITLE #CV-TIME-1(*) #CV-TIME-2(*) #CVAR #DISPLAY.#DATE-1(*)
0040*     #DISPLAY.#DATE-2(*) #DISPLAY.#TIME-1(*) #DISPLAY.#TIME-2(*)
0050*     #DISPLAY.HOLD(*) #DISPLAY.JOB-CLASS(*) #DISPLAY.JOB-NAME(*)
0060*     #DISPLAY.JOB-NUMBER(*) #DISPLAY.PRIORITY(*) #DISPLAY.QUEUE(*)
0070*     #DISPLAY.STATUS(*) #DISPLAY.TYPE(*) #DYN-HEADER #JOB-NAME #QUEUE
0080*     #STATUS #TYPE
0090DEFINE DATA PARAMETER
01001 ##TITLE (A078)
01101  #CV-TIME-1 (C/00001:00015)
01201  #CV-TIME-2 (C/00001:00015)
01301  #CVAR (C)
01401 #DISPLAY.#DATE-1 (D/00001:00015)
01501 #DISPLAY.#DATE-2 (D/00001:00015)
01601 #DISPLAY.#TIME-1 (T/00001:00015)
01701 #DISPLAY.#TIME-2 (T/00001:00015)
01801 #DISPLAY.HOLD (A001/00001:00015)
01901 #DISPLAY.JOB-CLASS (A001/00001:00015)
02001 #DISPLAY.JOB-NAME (A008/    1:00015)
02101 #DISPLAY.JOB-NUMBER (N07.0/00001:00015)
02201 #DISPLAY.PRIORITY (N03.0/00001:00015)
02301 #DISPLAY.QUEUE (A003/00001:00015)
02401 #DISPLAY.STATUS (A009/00001:00015)
02501 #DISPLAY.TYPE (A003/00001:00015)
02601 #DYN-HEADER (A033)
02701 #JOB-NAME (A008)
02801 #QUEUE (A003)
02901 #STATUS (A009)
03001 #TYPE (A003)
0310END-DEFINE
0320FORMAT PS=021 LS=080 ZP=OFF SG=OFF KD=ON  IP=OFF
0330* MAP2: MAP PROFILES *****************************        410***********
0340* .TTAAAMMOO   D I D I N D I D I        ?_)¬&:+(                       *
0350* 023079        N0NNUCN             X        01 SYSPROF YL   #CVAR   1 *
0360************************************************************************
0370INPUT          (     CV=#CVAR                                         /*
0380                                                                       )
0390 002T ##TITLE  (AD=ODL ) /*.01D078 A078 .
0400/
0410/
0420 002T 'Job-Name Job-#'
0430 019T 'Status'
0440 029T 'Q'
0450 033T 'Typ Cl Prio H'
0460 047T #DYN-HEADER  (AD=ODL ) /*.01D033 A033 .
0470/
0480 002T #JOB-NAME  (AD=MYLT'_' CD=NE CV=#CVAR ) /*.99D008 A008 .
0490 011T '_______'
0500 019T #STATUS  (AD=MYLT'_' CD=NE CV=#CVAR ) /*.99U009 A009 .
0510 029T #QUEUE  (AD=MYLT'_' CV=#CVAR ) /*.99D003 A003 .
0520 033T #TYPE  (AD=MYLT'_' CV=#CVAR ) /*.99D003 A003 .
0530 037T '__ ____ _'
0540 047T '_' (016)
0550 064T '_' (016)
0560/
0570 002T #DISPLAY.JOB-NAME (1+000)  (AD=ODL ) /*.01D008 A008 .
0580   /**A1000150000100001    10000100001100015001001000001000HV
0590 011T #DISPLAY.JOB-NUMBER (001)  (AD=ODL EM=ZZZZZZZ ) /*.01U007 N07.0.
0600   /**A1000150000100001000010000100001100015001001000001000HV
0610 019T #DISPLAY.STATUS (1+000)  (AD=ODL ) /*.01D009 A009 .
0620   /**A1000150000100001000010000100001100015001001000001001HV
0630 029T #DISPLAY.QUEUE (1+000)  (AD=ODL ) /*.01D003 A003 .
0640   /**A1000150000100001000010000100001100015001001000001005HV
0650 033T #DISPLAY.TYPE (1+000)  (AD=ODL ) /*.02D003 A003 .
0660   /**A1000150000100001000010000100001100015001001000001005HV
0670 038T #DISPLAY.JOB-CLASS (1+000)  (AD=ODL ) /*.01D001 A001 .
0680   /**A1000150000100001000010000100001100015001001000001007HV
0690 041T #DISPLAY.PRIORITY (1+000)  (AD=ODR EM=ZZ9 ) /*.01D003 N03.0.
0700   /**A1000150000100001000010000100001100015001001000001005HV
0710 045T #DISPLAY.HOLD (001)  (AD=ODL ) /*.01U001 A001 .
0720   /**A1000150000100001000010000100001100015001001000001000HV
0730 047T #DISPLAY.#DATE-1 (1+000)  (AD=ODL EM=YYYY-MM-DD ) /*.01D010 D    .
0740   /**A1000150000100001000010000100001100015001001000001001HV
0750 058T #DISPLAY.#TIME-1 (1+000)  (AD=OYL EM=HH:II CV=#CV-TIME-1(1+000) ) /*.01D005 T    .
0760   /**A1000150000100001000010000100001100015001001000001003HV
0770 064T #DISPLAY.#DATE-2 (1+000)  (AD=ODL EM=YYYY-MM-DD ) /*.01D010 D    .
0780   /**A1000150000100001000010000100001100015001001000001001HV
0790 075T #DISPLAY.#TIME-2 (1+000)  (AD=OYL EM=HH:II CV=#CV-TIME-2(1+000) ) /*.01D005 T    .
0800   /**A1000150000100001000010000100001100015001001000001003HV
0810/
0820 002T #DISPLAY.JOB-NAME (1+001)  (AD=ODL ) /*.01D008 A008 .
0830 011T #DISPLAY.JOB-NUMBER (002)  (AD=ODL EM=ZZZZZZZ ) /*.01U007 N07.0.
0840 019T #DISPLAY.STATUS (1+001)  (AD=ODL ) /*.01D009 A009 .
0850 029T #DISPLAY.QUEUE (1+001)  (AD=ODL ) /*.01D003 A003 .
0860 033T #DISPLAY.TYPE (1+001)  (AD=ODL ) /*.02D003 A003 .
0870 038T #DISPLAY.JOB-CLASS (1+001)  (AD=ODL ) /*.01D001 A001 .
0880 041T #DISPLAY.PRIORITY (1+001)  (AD=ODR EM=ZZ9 ) /*.01D003 N03.0.
0890 045T #DISPLAY.HOLD (002)  (AD=ODL ) /*.01U001 A001 .
0900 047T #DISPLAY.#DATE-1 (1+001)  (AD=ODL EM=YYYY-MM-DD ) /*.01D010 D    .
0910 058T #DISPLAY.#TIME-1 (1+001)  (AD=OYL EM=HH:II CV=#CV-TIME-1(1+001) ) /*.01D005 T    .
0920 064T #DISPLAY.#DATE-2 (1+001)  (AD=ODL EM=YYYY-MM-DD ) /*.01D010 D    .
0930 075T #DISPLAY.#TIME-2 (1+001)  (AD=OYL EM=HH:II CV=#CV-TIME-2(1+001) ) /*.01D005 T    .
0940/
0950 002T #DISPLAY.JOB-NAME (1+002)  (AD=ODL ) /*.01D008 A008 .
0960 011T #DISPLAY.JOB-NUMBER (003)  (AD=ODL EM=ZZZZZZZ ) /*.01U007 N07.0.
0970 019T #DISPLAY.STATUS (1+002)  (AD=ODL ) /*.01D009 A009 .
0980 029T #DISPLAY.QUEUE (1+002)  (AD=ODL ) /*.01D003 A003 .
0990 033T #DISPLAY.TYPE (1+002)  (AD=ODL ) /*.02D003 A003 .
1000 038T #DISPLAY.JOB-CLASS (1+002)  (AD=ODL ) /*.01D001 A001 .
1010 041T #DISPLAY.PRIORITY (1+002)  (AD=ODR EM=ZZ9 ) /*.01D003 N03.0.
1020 045T #DISPLAY.HOLD (003)  (AD=ODL ) /*.01U001 A001 .
1030 047T #DISPLAY.#DATE-1 (1+002)  (AD=ODL EM=YYYY-MM-DD ) /*.01D010 D    .
1040 058T #DISPLAY.#TIME-1 (1+002)  (AD=OYL EM=HH:II CV=#CV-TIME-1(1+002) ) /*.01D005 T    .
1050 064T #DISPLAY.#DATE-2 (1+002)  (AD=ODL EM=YYYY-MM-DD ) /*.01D010 D    .
1060 075T #DISPLAY.#TIME-2 (1+002)  (AD=OYL EM=HH:II CV=#CV-TIME-2(1+002) ) /*.01D005 T    .
1070/
1080 002T #DISPLAY.JOB-NAME (1+003)  (AD=ODL ) /*.01D008 A008 .
1090 011T #DISPLAY.JOB-NUMBER (004)  (AD=ODL EM=ZZZZZZZ ) /*.01U007 N07.0.
1100 019T #DISPLAY.STATUS (1+003)  (AD=ODL ) /*.01D009 A009 .
1110 029T #DISPLAY.QUEUE (1+003)  (AD=ODL ) /*.01D003 A003 .
1120 033T #DISPLAY.TYPE (1+003)  (AD=ODL ) /*.02D003 A003 .
1130 038T #DISPLAY.JOB-CLASS (1+003)  (AD=ODL ) /*.01D001 A001 .
1140 041T #DISPLAY.PRIORITY (1+003)  (AD=ODR EM=ZZ9 ) /*.01D003 N03.0.
1150 045T #DISPLAY.HOLD (004)  (AD=ODL ) /*.01U001 A001 .
1160 047T #DISPLAY.#DATE-1 (1+003)  (AD=ODL EM=YYYY-MM-DD ) /*.01D010 D    .
1170 058T #DISPLAY.#TIME-1 (1+003)  (AD=OYL EM=HH:II CV=#CV-TIME-1(1+003) ) /*.01D005 T    .
1180 064T #DISPLAY.#DATE-2 (1+003)  (AD=ODL EM=YYYY-MM-DD ) /*.01D010 D    .
1190 075T #DISPLAY.#TIME-2 (1+003)  (AD=OYL EM=HH:II CV=#CV-TIME-2(1+003) ) /*.01D005 T    .
1200/
1210 002T #DISPLAY.JOB-NAME (1+004)  (AD=ODL ) /*.01D008 A008 .
1220 011T #DISPLAY.JOB-NUMBER (005)  (AD=ODL EM=ZZZZZZZ ) /*.01U007 N07.0.
1230 019T #DISPLAY.STATUS (1+004)  (AD=ODL ) /*.01D009 A009 .
1240 029T #DISPLAY.QUEUE (1+004)  (AD=ODL ) /*.01D003 A003 .
1250 033T #DISPLAY.TYPE (1+004)  (AD=ODL ) /*.02D003 A003 .
1260 038T #DISPLAY.JOB-CLASS (1+004)  (AD=ODL ) /*.01D001 A001 .
1270 041T #DISPLAY.PRIORITY (1+004)  (AD=ODR EM=ZZ9 ) /*.01D003 N03.0.
1280 045T #DISPLAY.HOLD (005)  (AD=ODL ) /*.01U001 A001 .
1290 047T #DISPLAY.#DATE-1 (1+004)  (AD=ODL EM=YYYY-MM-DD ) /*.01D010 D    .
1300 058T #DISPLAY.#TIME-1 (1+004)  (AD=OYL EM=HH:II CV=#CV-TIME-1(1+004) ) /*.01D005 T    .
1310 064T #DISPLAY.#DATE-2 (1+004)  (AD=ODL EM=YYYY-MM-DD ) /*.01D010 D    .
1320 075T #DISPLAY.#TIME-2 (1+004)  (AD=OYL EM=HH:II CV=#CV-TIME-2(1+004) ) /*.01D005 T    .
1330/
1340 002T #DISPLAY.JOB-NAME (1+005)  (AD=ODL ) /*.01D008 A008 .
1350 011T #DISPLAY.JOB-NUMBER (006)  (AD=ODL EM=ZZZZZZZ ) /*.01U007 N07.0.
1360 019T #DISPLAY.STATUS (1+005)  (AD=ODL ) /*.01D009 A009 .
1370 029T #DISPLAY.QUEUE (1+005)  (AD=ODL ) /*.01D003 A003 .
1380 033T #DISPLAY.TYPE (1+005)  (AD=ODL ) /*.02D003 A003 .
1390 038T #DISPLAY.JOB-CLASS (1+005)  (AD=ODL ) /*.01D001 A001 .
1400 041T #DISPLAY.PRIORITY (1+005)  (AD=ODR EM=ZZ9 ) /*.01D003 N03.0.
1410 045T #DISPLAY.HOLD (006)  (AD=ODL ) /*.01U001 A001 .
1420 047T #DISPLAY.#DATE-1 (1+005)  (AD=ODL EM=YYYY-MM-DD ) /*.01D010 D    .
1430 058T #DISPLAY.#TIME-1 (1+005)  (AD=OYL EM=HH:II CV=#CV-TIME-1(1+005) ) /*.01D005 T    .
1440 064T #DISPLAY.#DATE-2 (1+005)  (AD=ODL EM=YYYY-MM-DD ) /*.01D010 D    .
1450 075T #DISPLAY.#TIME-2 (1+005)  (AD=OYL EM=HH:II CV=#CV-TIME-2(1+005) ) /*.01D005 T    .
1460/
1470 002T #DISPLAY.JOB-NAME (1+006)  (AD=ODL ) /*.01D008 A008 .
1480 011T #DISPLAY.JOB-NUMBER (007)  (AD=ODL EM=ZZZZZZZ ) /*.01U007 N07.0.
1490 019T #DISPLAY.STATUS (1+006)  (AD=ODL ) /*.01D009 A009 .
1500 029T #DISPLAY.QUEUE (1+006)  (AD=ODL ) /*.01D003 A003 .
1510 033T #DISPLAY.TYPE (1+006)  (AD=ODL ) /*.02D003 A003 .
1520 038T #DISPLAY.JOB-CLASS (1+006)  (AD=ODL ) /*.01D001 A001 .
1530 041T #DISPLAY.PRIORITY (1+006)  (AD=ODR EM=ZZ9 ) /*.01D003 N03.0.
1540 045T #DISPLAY.HOLD (007)  (AD=ODL ) /*.01U001 A001 .
1550 047T #DISPLAY.#DATE-1 (1+006)  (AD=ODL EM=YYYY-MM-DD ) /*.01D010 D    .
1560 058T #DISPLAY.#TIME-1 (1+006)  (AD=OYL EM=HH:II CV=#CV-TIME-1(1+006) ) /*.01D005 T    .
1570 064T #DISPLAY.#DATE-2 (1+006)  (AD=ODL EM=YYYY-MM-DD ) /*.01D010 D    .
1580 075T #DISPLAY.#TIME-2 (1+006)  (AD=OYL EM=HH:II CV=#CV-TIME-2(1+006) ) /*.01D005 T    .
1590/
1600 002T #DISPLAY.JOB-NAME (1+007)  (AD=ODL ) /*.01D008 A008 .
1610 011T #DISPLAY.JOB-NUMBER (008)  (AD=ODL EM=ZZZZZZZ ) /*.01U007 N07.0.
1620 019T #DISPLAY.STATUS (1+007)  (AD=ODL ) /*.01D009 A009 .
1630 029T #DISPLAY.QUEUE (1+007)  (AD=ODL ) /*.01D003 A003 .
1640 033T #DISPLAY.TYPE (1+007)  (AD=ODL ) /*.02D003 A003 .
1650 038T #DISPLAY.JOB-CLASS (1+007)  (AD=ODL ) /*.01D001 A001 .
1660 041T #DISPLAY.PRIORITY (1+007)  (AD=ODR EM=ZZ9 ) /*.01D003 N03.0.
1670 045T #DISPLAY.HOLD (008)  (AD=ODL ) /*.01U001 A001 .
1680 047T #DISPLAY.#DATE-1 (1+007)  (AD=ODL EM=YYYY-MM-DD ) /*.01D010 D    .
1690 058T #DISPLAY.#TIME-1 (1+007)  (AD=OYL EM=HH:II CV=#CV-TIME-1(1+007) ) /*.01D005 T    .
1700 064T #DISPLAY.#DATE-2 (1+007)  (AD=ODL EM=YYYY-MM-DD ) /*.01D010 D    .
1710 075T #DISPLAY.#TIME-2 (1+007)  (AD=OYL EM=HH:II CV=#CV-TIME-2(1+007) ) /*.01D005 T    .
1720/
1730 002T #DISPLAY.JOB-NAME (1+008)  (AD=ODL ) /*.01D008 A008 .
1740 011T #DISPLAY.JOB-NUMBER (009)  (AD=ODL EM=ZZZZZZZ ) /*.01U007 N07.0.
1750 019T #DISPLAY.STATUS (1+008)  (AD=ODL ) /*.01D009 A009 .
1760 029T #DISPLAY.QUEUE (1+008)  (AD=ODL ) /*.01D003 A003 .
1770 033T #DISPLAY.TYPE (1+008)  (AD=ODL ) /*.02D003 A003 .
1780 038T #DISPLAY.JOB-CLASS (1+008)  (AD=ODL ) /*.01D001 A001 .
1790 041T #DISPLAY.PRIORITY (1+008)  (AD=ODR EM=ZZ9 ) /*.01D003 N03.0.
1800 045T #DISPLAY.HOLD (009)  (AD=ODL ) /*.01U001 A001 .
1810 047T #DISPLAY.#DATE-1 (1+008)  (AD=ODL EM=YYYY-MM-DD ) /*.01D010 D    .
1820 058T #DISPLAY.#TIME-1 (1+008)  (AD=OYL EM=HH:II CV=#CV-TIME-1(1+008) ) /*.01D005 T    .
1830 064T #DISPLAY.#DATE-2 (1+008)  (AD=ODL EM=YYYY-MM-DD ) /*.01D010 D    .
1840 075T #DISPLAY.#TIME-2 (1+008)  (AD=OYL EM=HH:II CV=#CV-TIME-2(1+008) ) /*.01D005 T    .
1850/
1860 002T #DISPLAY.JOB-NAME (1+009)  (AD=ODL ) /*.01D008 A008 .
1870 011T #DISPLAY.JOB-NUMBER (010)  (AD=ODL EM=ZZZZZZZ ) /*.01U007 N07.0.
1880 019T #DISPLAY.STATUS (1+009)  (AD=ODL ) /*.01D009 A009 .
1890 029T #DISPLAY.QUEUE (1+009)  (AD=ODL ) /*.01D003 A003 .
1900 033T #DISPLAY.TYPE (1+009)  (AD=ODL ) /*.02D003 A003 .
1910 038T #DISPLAY.JOB-CLASS (1+009)  (AD=ODL ) /*.01D001 A001 .
1920 041T #DISPLAY.PRIORITY (1+009)  (AD=ODR EM=ZZ9 ) /*.01D003 N03.0.
1930 045T #DISPLAY.HOLD (010)  (AD=ODL ) /*.01U001 A001 .
1940 047T #DISPLAY.#DATE-1 (1+009)  (AD=ODL EM=YYYY-MM-DD ) /*.01D010 D    .
1950 058T #DISPLAY.#TIME-1 (1+009)  (AD=OYL EM=HH:II CV=#CV-TIME-1(1+009) ) /*.01D005 T    .
1960 064T #DISPLAY.#DATE-2 (1+009)  (AD=ODL EM=YYYY-MM-DD ) /*.01D010 D    .
1970 075T #DISPLAY.#TIME-2 (1+009)  (AD=OYL EM=HH:II CV=#CV-TIME-2(1+009) ) /*.01D005 T    .
1980/
1990 002T #DISPLAY.JOB-NAME (1+010)  (AD=ODL ) /*.01D008 A008 .
2000 011T #DISPLAY.JOB-NUMBER (011)  (AD=ODL EM=ZZZZZZZ ) /*.01U007 N07.0.
2010 019T #DISPLAY.STATUS (1+010)  (AD=ODL ) /*.01D009 A009 .
2020 029T #DISPLAY.QUEUE (1+010)  (AD=ODL ) /*.01D003 A003 .
2030 033T #DISPLAY.TYPE (1+010)  (AD=ODL ) /*.02D003 A003 .
2040 038T #DISPLAY.JOB-CLASS (1+010)  (AD=ODL ) /*.01D001 A001 .
2050 041T #DISPLAY.PRIORITY (1+010)  (AD=ODR EM=ZZ9 ) /*.01D003 N03.0.
2060 045T #DISPLAY.HOLD (011)  (AD=ODL ) /*.01U001 A001 .
2070 047T #DISPLAY.#DATE-1 (1+010)  (AD=ODL EM=YYYY-MM-DD ) /*.01D010 D    .
2080 058T #DISPLAY.#TIME-1 (1+010)  (AD=OYL EM=HH:II CV=#CV-TIME-1(1+010) ) /*.01D005 T    .
2090 064T #DISPLAY.#DATE-2 (1+010)  (AD=ODL EM=YYYY-MM-DD ) /*.01D010 D    .
2100 075T #DISPLAY.#TIME-2 (1+010)  (AD=OYL EM=HH:II CV=#CV-TIME-2(1+010) ) /*.01D005 T    .
2110/
2120 002T #DISPLAY.JOB-NAME (1+011)  (AD=ODL ) /*.01D008 A008 .
2130 011T #DISPLAY.JOB-NUMBER (012)  (AD=ODL EM=ZZZZZZZ ) /*.01U007 N07.0.
2140 019T #DISPLAY.STATUS (1+011)  (AD=ODL ) /*.01D009 A009 .
2150 029T #DISPLAY.QUEUE (1+011)  (AD=ODL ) /*.01D003 A003 .
2160 033T #DISPLAY.TYPE (1+011)  (AD=ODL ) /*.02D003 A003 .
2170 038T #DISPLAY.JOB-CLASS (1+011)  (AD=ODL ) /*.01D001 A001 .
2180 041T #DISPLAY.PRIORITY (1+011)  (AD=ODR EM=ZZ9 ) /*.01D003 N03.0.
2190 045T #DISPLAY.HOLD (012)  (AD=ODL ) /*.01U001 A001 .
2200 047T #DISPLAY.#DATE-1 (1+011)  (AD=ODL EM=YYYY-MM-DD ) /*.01D010 D    .
2210 058T #DISPLAY.#TIME-1 (1+011)  (AD=OYL EM=HH:II CV=#CV-TIME-1(1+011) ) /*.01D005 T    .
2220 064T #DISPLAY.#DATE-2 (1+011)  (AD=ODL EM=YYYY-MM-DD ) /*.01D010 D    .
2230 075T #DISPLAY.#TIME-2 (1+011)  (AD=OYL EM=HH:II CV=#CV-TIME-2(1+011) ) /*.01D005 T    .
2240/
2250 002T #DISPLAY.JOB-NAME (1+012)  (AD=ODL ) /*.01D008 A008 .
2260 011T #DISPLAY.JOB-NUMBER (013)  (AD=ODL EM=ZZZZZZZ ) /*.01U007 N07.0.
2270 019T #DISPLAY.STATUS (1+012)  (AD=ODL ) /*.01D009 A009 .
2280 029T #DISPLAY.QUEUE (1+012)  (AD=ODL ) /*.01D003 A003 .
2290 033T #DISPLAY.TYPE (1+012)  (AD=ODL ) /*.02D003 A003 .
2300 038T #DISPLAY.JOB-CLASS (1+012)  (AD=ODL ) /*.01D001 A001 .
2310 041T #DISPLAY.PRIORITY (1+012)  (AD=ODR EM=ZZ9 ) /*.01D003 N03.0.
2320 045T #DISPLAY.HOLD (013)  (AD=ODL ) /*.01U001 A001 .
2330 047T #DISPLAY.#DATE-1 (1+012)  (AD=ODL EM=YYYY-MM-DD ) /*.01D010 D    .
2340 058T #DISPLAY.#TIME-1 (1+012)  (AD=OYL EM=HH:II CV=#CV-TIME-1(1+012) ) /*.01D005 T    .
2350 064T #DISPLAY.#DATE-2 (1+012)  (AD=ODL EM=YYYY-MM-DD ) /*.01D010 D    .
2360 075T #DISPLAY.#TIME-2 (1+012)  (AD=OYL EM=HH:II CV=#CV-TIME-2(1+012) ) /*.01D005 T    .
2370/
2380 002T #DISPLAY.JOB-NAME (1+013)  (AD=ODL ) /*.01D008 A008 .
2390 011T #DISPLAY.JOB-NUMBER (014)  (AD=ODL EM=ZZZZZZZ ) /*.01U007 N07.0.
2400 019T #DISPLAY.STATUS (1+013)  (AD=ODL ) /*.01D009 A009 .
2410 029T #DISPLAY.QUEUE (1+013)  (AD=ODL ) /*.01D003 A003 .
2420 033T #DISPLAY.TYPE (1+013)  (AD=ODL ) /*.02D003 A003 .
2430 038T #DISPLAY.JOB-CLASS (1+013)  (AD=ODL ) /*.01D001 A001 .
2440 041T #DISPLAY.PRIORITY (1+013)  (AD=ODR EM=ZZ9 ) /*.01D003 N03.0.
2450 045T #DISPLAY.HOLD (014)  (AD=ODL ) /*.01U001 A001 .
2460 047T #DISPLAY.#DATE-1 (1+013)  (AD=ODL EM=YYYY-MM-DD ) /*.01D010 D    .
2470 058T #DISPLAY.#TIME-1 (1+013)  (AD=OYL EM=HH:II CV=#CV-TIME-1(1+013) ) /*.01D005 T    .
2480 064T #DISPLAY.#DATE-2 (1+013)  (AD=ODL EM=YYYY-MM-DD ) /*.01D010 D    .
2490 075T #DISPLAY.#TIME-2 (1+013)  (AD=OYL EM=HH:II CV=#CV-TIME-2(1+013) ) /*.01D005 T    .
2500/
2510 002T #DISPLAY.JOB-NAME (1+014)  (AD=ODL ) /*.01D008 A008 .
2520 011T #DISPLAY.JOB-NUMBER (015)  (AD=ODL EM=ZZZZZZZ ) /*.01U007 N07.0.
2530 019T #DISPLAY.STATUS (1+014)  (AD=ODL ) /*.01D009 A009 .
2540 029T #DISPLAY.QUEUE (1+014)  (AD=ODL ) /*.01D003 A003 .
2550 033T #DISPLAY.TYPE (1+014)  (AD=ODL ) /*.02D003 A003 .
2560 038T #DISPLAY.JOB-CLASS (1+014)  (AD=ODL ) /*.01D001 A001 .
2570 041T #DISPLAY.PRIORITY (1+014)  (AD=ODR EM=ZZ9 ) /*.01D003 N03.0.
2580 045T #DISPLAY.HOLD (015)  (AD=ODL ) /*.01U001 A001 .
2590 047T #DISPLAY.#DATE-1 (1+014)  (AD=ODL EM=YYYY-MM-DD ) /*.01D010 D    .
2600 058T #DISPLAY.#TIME-1 (1+014)  (AD=OYL EM=HH:II CV=#CV-TIME-1(1+014) ) /*.01D005 T    .
2610 064T #DISPLAY.#DATE-2 (1+014)  (AD=ODL EM=YYYY-MM-DD ) /*.01D010 D    .
2620 075T #DISPLAY.#TIME-2 (1+014)  (AD=OYL EM=HH:II CV=#CV-TIME-2(1+014) ) /*.01D005 T    .
2630/
2640/
2650* MAP2: VALIDATION *****************************************************
2660* MAP2: END OF MAP *****************************************************
2670END
