0010* MAP2: PROTOTYPE
0020* INPUT USING MAP 'XXXXXXXX'
0030*     ##TITLE SYSTEM-INFO.#CPU-ID SYSTEM-INFO.#MODEL SYSTEM-INFO.APF
0040*     SYSTEM-INFO.AUTO-LOGON SYSTEM-INFO.CPU-UTILIZATION
0050*     SYSTEM-INFO.ESY-VERSION SYSTEM-INFO.GMT-DIFFERENCE
0060*     SYSTEM-INFO.LAST-IPL-DATX SYSTEM-INFO.LAST-IPL-TIMX
0070*     SYSTEM-INFO.LOCAL-DATX SYSTEM-INFO.LOCAL-TIMX SYSTEM-INFO.NODE-ID
0080*     SYSTEM-INFO.PRODUCT-NAME SYSTEM-INFO.PRODUCT-VERSION
0090*     SYSTEM-INFO.SECURITY SYSTEM-INFO.SMF-RECORD
0100*     SYSTEM-INFO.SPOOL-RELEASE SYSTEM-INFO.SPOOL-TYPE
0110*     SYSTEM-INFO.SYSTEM-ID SYSTEM-INFO.SYSTEM-RELEASE
0120*     SYSTEM-INFO.SYSTEM-TYPE
0130DEFINE DATA PARAMETER
01401 ##TITLE (A078)
01501 SYSTEM-INFO.#CPU-ID (A008)
01601 SYSTEM-INFO.#MODEL (A004)
01701 SYSTEM-INFO.APF (A003)
01801 SYSTEM-INFO.AUTO-LOGON (A003)
01901 SYSTEM-INFO.CPU-UTILIZATION (N03.0)
02001 SYSTEM-INFO.ESY-VERSION (A008)
02101 SYSTEM-INFO.GMT-DIFFERENCE (N03.0)
02201 SYSTEM-INFO.LAST-IPL-DATX (D)
02301 SYSTEM-INFO.LAST-IPL-TIMX (T)
02401 SYSTEM-INFO.LOCAL-DATX (D)
02501 SYSTEM-INFO.LOCAL-TIMX (T)
02601 SYSTEM-INFO.NODE-ID (A050)
02701 SYSTEM-INFO.PRODUCT-NAME (A016)
02801 SYSTEM-INFO.PRODUCT-VERSION (A008)
02901 SYSTEM-INFO.SECURITY (A004)
03001 SYSTEM-INFO.SMF-RECORD (N03.0)
03101 SYSTEM-INFO.SPOOL-RELEASE (A008)
03201 SYSTEM-INFO.SPOOL-TYPE (A008)
03301 SYSTEM-INFO.SYSTEM-ID (A016)
03401 SYSTEM-INFO.SYSTEM-RELEASE (A008)
03501 SYSTEM-INFO.SYSTEM-TYPE (A008)
0360END-DEFINE
0370FORMAT PS=021 LS=080 ZP=OFF SG=OFF KD=ON  IP=OFF
0380* MAP2: MAP PROFILES *****************************        410***********
0390* .TTAAAMMOO   D I D I N D I D I        ?_)¬&:+(                       *
0400* 023079        N0NNUCN             X        01 SYSPROF YL           1 *
0410************************************************************************
0420INPUT          (     IP=OFF                                           /*
0430                                                                       )
0440 002T ##TITLE  (AD=ODL ) /*.01D078 A078 .
0450/
0460/
0470 004T 'System'
0480/
0490 007T 'ID .............'
0500 024T SYSTEM-INFO.SYSTEM-ID  (AD=OIL CD=NE ) /*.01U016 A016 .
0510 049T 'Lokales Datum ......'
0520 070T SYSTEM-INFO.LOCAL-DATX  (AD=OIL EM=DD.MM.YYYY ) /*.01D010 D    .
0530/
0540 007T 'Typ ............'
0550 024T SYSTEM-INFO.SYSTEM-TYPE  (AD=OIL CD=NE ) /*.01D008 A008 .
0560 049T 'Lokale Zeit ........'
0570 070T SYSTEM-INFO.LOCAL-TIMX  (AD=OIL ) /*.01D008 T    .
0580/
0590 007T 'Release ........'
0600 024T SYSTEM-INFO.SYSTEM-RELEASE  (AD=OIL CD=NE ) /*.01D008 A008 .
0610 049T 'Differenz zu GMT ...'
0620 070T SYSTEM-INFO.GMT-DIFFERENCE  (AD=OIL EM=SZZ9 ) /*.01D004 N03.0.
0630/
0640 007T 'Produkt Name ...'
0650 024T SYSTEM-INFO.PRODUCT-NAME  (AD=OI ) /*.01U016 A016 .
0660 049T 'Datum letztes IPL ..'
0670 070T SYSTEM-INFO.LAST-IPL-DATX  (AD=OIL EM=DD.MM.YYYY ) /*.01D010 D    .
0680/
0690 007T 'Produkt Version'
0700 024T SYSTEM-INFO.PRODUCT-VERSION  (AD=OI ) /*.01U008 A008 .
0710 049T 'Uhrzeit letztes IPL'
0720 070T SYSTEM-INFO.LAST-IPL-TIMX  (AD=OIL ) /*.01D008 T    .
0730/
0740 007T 'CPU ID/Modell ..'
0750 024T SYSTEM-INFO.#CPU-ID  (AD=OIL CD=NE ) /*.01D008 A008 .
0760 035T SYSTEM-INFO.#MODEL  (AD=OIL CD=NE ) /*.01D004 A004 .
0770 049T 'CPU Auslastung .....'
0780 070T SYSTEM-INFO.CPU-UTILIZATION  (AD=OIR ) /*.01U003 N03.0           .
0790 074T '%'(I)
0800/
0810/
0820 004T 'Spool'
0830/
0840 007T 'Typ ............'
0850 024T SYSTEM-INFO.SPOOL-TYPE  (AD=OIL CD=NE ) /*.01D008 A008 .
0860 049T 'Release ............'
0870 070T SYSTEM-INFO.SPOOL-RELEASE  (AD=OIL CD=NE ) /*.01D008 A008 .
0880/
0890/
0900 004T 'ENTIRE SYSTEM SERVER'
0910/
0920 007T 'Identifikation..'
0930 024T SYSTEM-INFO.NODE-ID  (AD=OIL CD=NE ) /*.01D050 A050 .
0940/
0950 007T 'Version ........'
0960 024T SYSTEM-INFO.ESY-VERSION  (AD=OIL CD=NE ) /*.01U008 A008 .
0970/
0980 007T 'Sicherheit .....'
0990 024T SYSTEM-INFO.SECURITY  (AD=OIL CD=NE ) /*.01D004 A004 .
1000/
1010 007T 'Auto Logon .....'
1020 024T SYSTEM-INFO.AUTO-LOGON  (AD=OIL CD=NE ) /*.01D003 A003 .
1030/
1040 007T 'APF ............'
1050 024T SYSTEM-INFO.APF  (AD=OIL CD=NE ) /*.01D003 A003 .
1060/
1070 007T 'SMF ............'
1080 024T SYSTEM-INFO.SMF-RECORD  (AD=OIL CD=NE ) /*.01D003 N03.0.
1090/
1100* MAP2: VALIDATION *****************************************************
1110RULEVAR D01SYSTEM-INFO.SYSTEM-ID
1120* CDIR SYSTEM-INFO                      SYSTEM-ID                       ;
1130RULEVAR D01SYSTEM-INFO.LOCAL-DATX
1140* CDIR SYSTEM-INFO                      LOCAL-DATX                      ;
1150RULEVAR D01SYSTEM-INFO.SYSTEM-TYPE
1160* CDIR SYSTEM-INFO                      SYSTEM-TYPE                     ;
1170RULEVAR D01SYSTEM-INFO.LOCAL-TIMX
1180* CDIR SYSTEM-INFO                      LOCAL-TIMX                      ;
1190RULEVAR D01SYSTEM-INFO.SYSTEM-RELEASE
1200* CDIR SYSTEM-INFO                      SYSTEM-RELEASE                  ;
1210RULEVAR D01SYSTEM-INFO.GMT-DIFFERENCE
1220* CDIR SYSTEM-INFO                      GMT-DIFFERENCE                  ;
1230RULEVAR D01SYSTEM-INFO.LAST-IPL-DATX
1240* CDIR SYSTEM-INFO                      LAST-IPL-DATX                   ;
1250RULEVAR D01SYSTEM-INFO.LAST-IPL-TIMX
1260* CDIR SYSTEM-INFO                      LAST-IPL-TIMX                   ;
1270RULEVAR D01SYSTEM-INFO.#CPU-ID
1280* CDIR SYSTEM-INFO                      #CPU-ID                         ;
1290RULEVAR D01SYSTEM-INFO.#MODEL
1300* CDIR SYSTEM-INFO                      #MODEL                          ;
1310RULEVAR D01SYSTEM-INFO.SPOOL-TYPE
1320* CDIR SYSTEM-INFO                      SPOOL-TYPE                      ;
1330RULEVAR D01SYSTEM-INFO.SPOOL-RELEASE
1340* CDIR SYSTEM-INFO                      SPOOL-RELEASE                   ;
1350RULEVAR D01SYSTEM-INFO.NODE-ID
1360* CDIR SYSTEM-INFO                      NODE-ID                         ;
1370RULEVAR D01SYSTEM-INFO.ESY-VERSION
1380* CDIR SYSTEM-INFO                      NPR-VERSION                     ;
1390RULEVAR D01SYSTEM-INFO.SECURITY
1400* CDIR SYSTEM-INFO                      SECURITY                        ;
1410RULEVAR D01SYSTEM-INFO.AUTO-LOGON
1420* CDIR SYSTEM-INFO                      AUTO-LOGON                      ;
1430RULEVAR D01SYSTEM-INFO.APF
1440* CDIR SYSTEM-INFO                      APF                             ;
1450RULEVAR D01SYSTEM-INFO.SMF-RECORD
1460* CDIR SYSTEM-INFO                      SMF-RECORD                      ;
1470* MAP2: END OF MAP *****************************************************
1480END
