0010* Read a file using record segments
0020*
0030DEFINE DATA
0040   LOCAL 1 READ-FILE VIEW OF READ-FILE
0050            2 ERROR-CODE
0060            2 ERROR-TEXT
0070            2 DSNAME
0080            2 MEMBER
0090            2 RECORD
0100            2 RECORD-NUMBER
0110            2 RECORD-LENGTH
0120            2 SEGMENT-NUMBER
0130            2 SEGMENT-LENGTH
0140END-DEFINE
0150*
0160INPUT / 'Read a file using record segments' (I)
0170     // 'Data Set:' (I) READ-FILE.DSNAME
0180      / 'Member  :' (I) READ-FILE.MEMBER
0190*
0200FIND (12) READ-FILE  WITH DSNAME = READ-FILE.DSNAME
0210                      AND MEMBER = READ-FILE.MEMBER
0220                      AND SEGMENT-LENGTH = 20
0230*
0240   IF ERROR-CODE > 0
0250      REINPUT ERROR-TEXT
0260   END-IF
0270*
0280   IF SEGMENT-NUMBER = 1
0290      WRITE / 'RECORD'          (I) RECORD-NUMBER
0300              'RECORD-LENGTH =' (I) RECORD-LENGTH /
0310   END-IF
0320*
0330   WRITE NOTITLE SEGMENT-NUMBER RECORD (AL=20)
0340*
0350END-FIND
0360*
0370END
