0010* Display information regarding tape I/O devices
0020*
0030DEFINE DATA
0040   LOCAL USING UNIT-L
0050END-DEFINE
0060*
0070WRITE TITLE 'Tape I/O Devices' (I) /
0080*
0090FIND UNIT-ATTRIBUTES WITH CLASS = 'TAPE'
0100*
0110   DISPLAY  UNIT SERIES DENSITY 'STATUS' MOUNT-STATUS
0120            DEVICE-STATUS ACTIVITY VOLSER
0130END-FIND
0140END
