0010DEFINE DATA
0020   GLOBAL USING TUTO
0030   LOCAL
00401 #SAVE-OPSYS    (A8)
0050END-DEFINE
0060*
0070IF *OPSYS = 'BS2000'
0080  SET CONTROL 'KS'
0090END-IF
0100SET CONTROL 'YB'
0110ASSIGN ##INIT = TRUE
0120* ***** ASSIGN *ERROR-TA = 'TUTOERR'
0130IF NOT (##NODE = 1 THRU 65535)   /* sju 02-02-15 was 1 THRU 255
0140   RESET INITIAL ##NODE
0150END-IF
0160ASSIGN #SAVE-OPSYS = ##OPSYSTEM
0170RESET INITIAL ##TUTO
0180RESET INITIAL ##MSG
0190ASSIGN ##OPSYSTEM = #SAVE-OPSYS
0200*
0210FETCH 'TUTO001P'
0220*
0230END
