0010* MAP2: PROTOTYPE
0020* INPUT USING MAP 'XXXXXXXX'
0030*     ##ACT-LI ##TUTO---G.##DESC(*) ##TUTO---G.##MARK(*)
0040*     ##TUTO---G.##OPSYSTEM ##TUTO---G.##PGM(*) ##TUTO---G.##VIEW(*)
0050*     ##VERSION
0060DEFINE DATA PARAMETER
00701  ##ACT-LI (N07.0)
00801 ##TUTO---G.##DESC (A049/00001:00100)
00901 ##TUTO---G.##MARK (A001/00001:00100)
01001 ##TUTO---G.##OPSYSTEM (A008)
01101 ##TUTO---G.##PGM (A008/00001:00100)
01201 ##TUTO---G.##VIEW (A016/00001:00100)
01301 ##VERSION (A005)
0140END-DEFINE
0150FORMAT PS=021 LS=080 ZP=OFF SG=OFF KD=ON  IP=OFF
0160* MAP2: MAP PROFILES *****************************        410***********
0170* .TOTAOM      D D I I I I              &?@>:                          *
0180* 023079        N0NNUCN____         X        01 SYSPROF YL             *
0190************************************************************************
0200INPUT          (     IP=OFF                                           /*
0210                                                                       )
0220 002T *TIMX  (AD=OVL'_' CD=YE ) /*.00S010 T    .
0230 017T 'ENTIRE SYSTEM SERVER Tutorial -'(I)
0240 049T ##VERSION  (AD=OIL CD=NE ) /*.01U005 A005 .
0250 055T '-'(I)
0260 057T ##TUTO---G.##OPSYSTEM  (AD=OIL CD=NE ) /*.01U008 A008 .
0270 072T *DATX  (AD=OVL'_' CD=YE ) /*.00S008 D    .
0280/
0290 002T '-' (078)
0300/
0310 008T 'View         Program          Program Description'
0320/
0330 002T '-'
0340 004T '-' (016)
0350 021T '--------'
0360 030T '-' (050)
0370/
0380 002T ##TUTO---G.##MARK (##ACT-LI+000)  (AD=MILT'_' ) /*.99U001 A001 .
0390   /* A1001000000100001000010000100001100015001000001H
0400 004T ##TUTO---G.##VIEW (##ACT-LI+000)  (AD=ODL ) /*.01U016 A016 .
0410   /* A1001000000100001000010000100001100015001000001H
0420 021T ##TUTO---G.##PGM (##ACT-LI+000)  (AD=OIL ) /*.01U008 A008 .
0430   /* A1001000000100001000010000100001100015001000001H
0440 030T ##TUTO---G.##DESC (##ACT-LI+000)  (AD=ODL ) /*.01U049 A049 .
0450   /**A1001000000100001000010000100001100015001001000001000HV
0460/
0470 002T ##TUTO---G.##MARK (##ACT-LI+001)  (AD=MILT'_' ) /*.99U001 A001 .
0480 004T ##TUTO---G.##VIEW (##ACT-LI+001)  (AD=ODL ) /*.01U016 A016 .
0490 021T ##TUTO---G.##PGM (##ACT-LI+001)  (AD=OIL ) /*.01U008 A008 .
0500 030T ##TUTO---G.##DESC (##ACT-LI+001)  (AD=ODL ) /*.01U049 A049 .
0510/
0520 002T ##TUTO---G.##MARK (##ACT-LI+002)  (AD=MILT'_' ) /*.99U001 A001 .
0530 004T ##TUTO---G.##VIEW (##ACT-LI+002)  (AD=ODL ) /*.01U016 A016 .
0540 021T ##TUTO---G.##PGM (##ACT-LI+002)  (AD=OIL ) /*.01U008 A008 .
0550 030T ##TUTO---G.##DESC (##ACT-LI+002)  (AD=ODL ) /*.01U049 A049 .
0560/
0570 002T ##TUTO---G.##MARK (##ACT-LI+003)  (AD=MILT'_' ) /*.99U001 A001 .
0580 004T ##TUTO---G.##VIEW (##ACT-LI+003)  (AD=ODL ) /*.01U016 A016 .
0590 021T ##TUTO---G.##PGM (##ACT-LI+003)  (AD=OIL ) /*.01U008 A008 .
0600 030T ##TUTO---G.##DESC (##ACT-LI+003)  (AD=ODL ) /*.01U049 A049 .
0610/
0620 002T ##TUTO---G.##MARK (##ACT-LI+004)  (AD=MILT'_' ) /*.99U001 A001 .
0630 004T ##TUTO---G.##VIEW (##ACT-LI+004)  (AD=ODL ) /*.01U016 A016 .
0640 021T ##TUTO---G.##PGM (##ACT-LI+004)  (AD=OIL ) /*.01U008 A008 .
0650 030T ##TUTO---G.##DESC (##ACT-LI+004)  (AD=ODL ) /*.01U049 A049 .
0660/
0670 002T ##TUTO---G.##MARK (##ACT-LI+005)  (AD=MILT'_' ) /*.99U001 A001 .
0680 004T ##TUTO---G.##VIEW (##ACT-LI+005)  (AD=ODL ) /*.01U016 A016 .
0690 021T ##TUTO---G.##PGM (##ACT-LI+005)  (AD=OIL ) /*.01U008 A008 .
0700 030T ##TUTO---G.##DESC (##ACT-LI+005)  (AD=ODL ) /*.01U049 A049 .
0710/
0720 002T ##TUTO---G.##MARK (##ACT-LI+006)  (AD=MILT'_' ) /*.99U001 A001 .
0730 004T ##TUTO---G.##VIEW (##ACT-LI+006)  (AD=ODL ) /*.01U016 A016 .
0740 021T ##TUTO---G.##PGM (##ACT-LI+006)  (AD=OIL ) /*.01U008 A008 .
0750 030T ##TUTO---G.##DESC (##ACT-LI+006)  (AD=ODL ) /*.01U049 A049 .
0760/
0770 002T ##TUTO---G.##MARK (##ACT-LI+007)  (AD=MILT'_' ) /*.99U001 A001 .
0780 004T ##TUTO---G.##VIEW (##ACT-LI+007)  (AD=ODL ) /*.01U016 A016 .
0790 021T ##TUTO---G.##PGM (##ACT-LI+007)  (AD=OIL ) /*.01U008 A008 .
0800 030T ##TUTO---G.##DESC (##ACT-LI+007)  (AD=ODL ) /*.01U049 A049 .
0810/
0820 002T ##TUTO---G.##MARK (##ACT-LI+008)  (AD=MILT'_' ) /*.99U001 A001 .
0830 004T ##TUTO---G.##VIEW (##ACT-LI+008)  (AD=ODL ) /*.01U016 A016 .
0840 021T ##TUTO---G.##PGM (##ACT-LI+008)  (AD=OIL ) /*.01U008 A008 .
0850 030T ##TUTO---G.##DESC (##ACT-LI+008)  (AD=ODL ) /*.01U049 A049 .
0860/
0870 002T ##TUTO---G.##MARK (##ACT-LI+009)  (AD=MILT'_' ) /*.99U001 A001 .
0880 004T ##TUTO---G.##VIEW (##ACT-LI+009)  (AD=ODL ) /*.01U016 A016 .
0890 021T ##TUTO---G.##PGM (##ACT-LI+009)  (AD=OIL ) /*.01U008 A008 .
0900 030T ##TUTO---G.##DESC (##ACT-LI+009)  (AD=ODL ) /*.01U049 A049 .
0910/
0920 002T ##TUTO---G.##MARK (##ACT-LI+010)  (AD=MILT'_' ) /*.99U001 A001 .
0930 004T ##TUTO---G.##VIEW (##ACT-LI+010)  (AD=ODL ) /*.01U016 A016 .
0940 021T ##TUTO---G.##PGM (##ACT-LI+010)  (AD=OIL ) /*.01U008 A008 .
0950 030T ##TUTO---G.##DESC (##ACT-LI+010)  (AD=ODL ) /*.01U049 A049 .
0960/
0970 002T ##TUTO---G.##MARK (##ACT-LI+011)  (AD=MILT'_' ) /*.99U001 A001 .
0980 004T ##TUTO---G.##VIEW (##ACT-LI+011)  (AD=ODL ) /*.01U016 A016 .
0990 021T ##TUTO---G.##PGM (##ACT-LI+011)  (AD=OIL ) /*.01U008 A008 .
1000 030T ##TUTO---G.##DESC (##ACT-LI+011)  (AD=ODL ) /*.01U049 A049 .
1010/
1020 002T ##TUTO---G.##MARK (##ACT-LI+012)  (AD=MILT'_' ) /*.99U001 A001 .
1030 004T ##TUTO---G.##VIEW (##ACT-LI+012)  (AD=ODL ) /*.01U016 A016 .
1040 021T ##TUTO---G.##PGM (##ACT-LI+012)  (AD=OIL ) /*.01U008 A008 .
1050 030T ##TUTO---G.##DESC (##ACT-LI+012)  (AD=ODL ) /*.01U049 A049 .
1060/
1070 002T ##TUTO---G.##MARK (##ACT-LI+013)  (AD=MILT'_' ) /*.99U001 A001 .
1080 004T ##TUTO---G.##VIEW (##ACT-LI+013)  (AD=ODL ) /*.01U016 A016 .
1090 021T ##TUTO---G.##PGM (##ACT-LI+013)  (AD=OIL ) /*.01U008 A008 .
1100 030T ##TUTO---G.##DESC (##ACT-LI+013)  (AD=ODL ) /*.01U049 A049 .
1110/
1120 002T ##TUTO---G.##MARK (##ACT-LI+014)  (AD=MILT'_' ) /*.99U001 A001 .
1130 004T ##TUTO---G.##VIEW (##ACT-LI+014)  (AD=ODL ) /*.01U016 A016 .
1140 021T ##TUTO---G.##PGM (##ACT-LI+014)  (AD=OIL ) /*.01U008 A008 .
1150 030T ##TUTO---G.##DESC (##ACT-LI+014)  (AD=ODL ) /*.01U049 A049 .
1160/
1170/
1180 002T 'E'(I)
1190 004T '= Edit'
1200 016T 'L'(I)
1210 018T '= List'
1220 030T 'X'(I)
1230 032T '= Execute'
1240 047T 'V'(I)
1250 049T '= List Userview'
1260 070T 'H'(I)
1270 072T '= Help'
1280* MAP2: VALIDATION *****************************************************
1290* MAP2: END OF MAP *****************************************************
1300END
