0010* MAP2: PROTOTYPE
0020* INPUT USING MAP 'XXXXXXXX'
0030*     ##ACT-LI ##TUTO.##DESC(*) ##TUTO.##MARK(*) ##TUTO.##OPSYSTEM
0040*     ##TUTO.##PGM(*) ##TUTO.##VIEW(*) ##VERSION
0050DEFINE DATA PARAMETER
00601  ##ACT-LI (N07.0)
00701 ##TUTO.##DESC (A049/00001:00100)
00801 ##TUTO.##MARK (A001/00001:00100)
00901 ##TUTO.##OPSYSTEM (A008)
01001 ##TUTO.##PGM (A008/00001:00100)
01101 ##TUTO.##VIEW (A016/00001:00100)
01201 ##VERSION (A005)
0130END-DEFINE
0140FORMAT PS=021 LS=080 ZP=OFF SG=OFF KD=ON  IP=OFF
0150* MAP2: MAP PROFILES *****************************        410***********
0160* .TOTAOM      D D I I I I              &?@>:                          *
0170* 023079        N0 NUCN____         X        01 SYSPROF YL             *
0180************************************************************************
0190INPUT          (     IP=OFF                                           /*
0200                                                                       )
0210 002T *TIMX  (AD=OVL'_' CD=YE ) /*.00S010 T    .
0220 016T 'ENTIRE SYSTEM SERVER Beispiele -'(I)
0230 049T ##VERSION  (AD=OIL CD=NE ) /*.01U005 A005 .
0240 055T '-'(I)
0250 057T ##TUTO.##OPSYSTEM  (AD=OIL ) /*.01D008 A008 .
0260 072T *DATX  (AD=OVL'_' CD=YE ) /*.00S008 D    .
0270/
0280 002T '-' (078)
0290/
0300 008T 'View'
0310 021T 'Programm'
0320 038T 'Programm-Beschreibung'
0330/
0340 002T '-'
0350 004T '-' (016)
0360 021T '--------'
0370 030T '-' (050)
0380/
0390 002T ##TUTO.##MARK (##ACT-LI+000)  (AD=MILT'_' ) /*.99U001 A001 .
0400   /* A1001000000100001000010000100001100015001000001H
0410 004T ##TUTO.##VIEW (##ACT-LI+000)  (AD=ODL ) /*.01U016 A016 .
0420   /* A1001000000100001000010000100001100015001000001H
0430 021T ##TUTO.##PGM (##ACT-LI+000)  (AD=OIL ) /*.01U008 A008 .
0440   /* A1001000000100001000010000100001100015001000001H
0450 030T ##TUTO.##DESC (##ACT-LI+000)  (AD=ODL ) /*.01U049 A049 .
0460   /**A1001000000100001000010000100001100015001001000001000HV
0470/
0480 002T ##TUTO.##MARK (##ACT-LI+001)  (AD=MILT'_' ) /*.99U001 A001 .
0490 004T ##TUTO.##VIEW (##ACT-LI+001)  (AD=ODL ) /*.01U016 A016 .
0500 021T ##TUTO.##PGM (##ACT-LI+001)  (AD=OIL ) /*.01U008 A008 .
0510 030T ##TUTO.##DESC (##ACT-LI+001)  (AD=ODL ) /*.01U049 A049 .
0520/
0530 002T ##TUTO.##MARK (##ACT-LI+002)  (AD=MILT'_' ) /*.99U001 A001 .
0540 004T ##TUTO.##VIEW (##ACT-LI+002)  (AD=ODL ) /*.01U016 A016 .
0550 021T ##TUTO.##PGM (##ACT-LI+002)  (AD=OIL ) /*.01U008 A008 .
0560 030T ##TUTO.##DESC (##ACT-LI+002)  (AD=ODL ) /*.01U049 A049 .
0570/
0580 002T ##TUTO.##MARK (##ACT-LI+003)  (AD=MILT'_' ) /*.99U001 A001 .
0590 004T ##TUTO.##VIEW (##ACT-LI+003)  (AD=ODL ) /*.01U016 A016 .
0600 021T ##TUTO.##PGM (##ACT-LI+003)  (AD=OIL ) /*.01U008 A008 .
0610 030T ##TUTO.##DESC (##ACT-LI+003)  (AD=ODL ) /*.01U049 A049 .
0620/
0630 002T ##TUTO.##MARK (##ACT-LI+004)  (AD=MILT'_' ) /*.99U001 A001 .
0640 004T ##TUTO.##VIEW (##ACT-LI+004)  (AD=ODL ) /*.01U016 A016 .
0650 021T ##TUTO.##PGM (##ACT-LI+004)  (AD=OIL ) /*.01U008 A008 .
0660 030T ##TUTO.##DESC (##ACT-LI+004)  (AD=ODL ) /*.01U049 A049 .
0670/
0680 002T ##TUTO.##MARK (##ACT-LI+005)  (AD=MILT'_' ) /*.99U001 A001 .
0690 004T ##TUTO.##VIEW (##ACT-LI+005)  (AD=ODL ) /*.01U016 A016 .
0700 021T ##TUTO.##PGM (##ACT-LI+005)  (AD=OIL ) /*.01U008 A008 .
0710 030T ##TUTO.##DESC (##ACT-LI+005)  (AD=ODL ) /*.01U049 A049 .
0720/
0730 002T ##TUTO.##MARK (##ACT-LI+006)  (AD=MILT'_' ) /*.99U001 A001 .
0740 004T ##TUTO.##VIEW (##ACT-LI+006)  (AD=ODL ) /*.01U016 A016 .
0750 021T ##TUTO.##PGM (##ACT-LI+006)  (AD=OIL ) /*.01U008 A008 .
0760 030T ##TUTO.##DESC (##ACT-LI+006)  (AD=ODL ) /*.01U049 A049 .
0770/
0780 002T ##TUTO.##MARK (##ACT-LI+007)  (AD=MILT'_' ) /*.99U001 A001 .
0790 004T ##TUTO.##VIEW (##ACT-LI+007)  (AD=ODL ) /*.01U016 A016 .
0800 021T ##TUTO.##PGM (##ACT-LI+007)  (AD=OIL ) /*.01U008 A008 .
0810 030T ##TUTO.##DESC (##ACT-LI+007)  (AD=ODL ) /*.01U049 A049 .
0820/
0830 002T ##TUTO.##MARK (##ACT-LI+008)  (AD=MILT'_' ) /*.99U001 A001 .
0840 004T ##TUTO.##VIEW (##ACT-LI+008)  (AD=ODL ) /*.01U016 A016 .
0850 021T ##TUTO.##PGM (##ACT-LI+008)  (AD=OIL ) /*.01U008 A008 .
0860 030T ##TUTO.##DESC (##ACT-LI+008)  (AD=ODL ) /*.01U049 A049 .
0870/
0880 002T ##TUTO.##MARK (##ACT-LI+009)  (AD=MILT'_' ) /*.99U001 A001 .
0890 004T ##TUTO.##VIEW (##ACT-LI+009)  (AD=ODL ) /*.01U016 A016 .
0900 021T ##TUTO.##PGM (##ACT-LI+009)  (AD=OIL ) /*.01U008 A008 .
0910 030T ##TUTO.##DESC (##ACT-LI+009)  (AD=ODL ) /*.01U049 A049 .
0920/
0930 002T ##TUTO.##MARK (##ACT-LI+010)  (AD=MILT'_' ) /*.99U001 A001 .
0940 004T ##TUTO.##VIEW (##ACT-LI+010)  (AD=ODL ) /*.01U016 A016 .
0950 021T ##TUTO.##PGM (##ACT-LI+010)  (AD=OIL ) /*.01U008 A008 .
0960 030T ##TUTO.##DESC (##ACT-LI+010)  (AD=ODL ) /*.01U049 A049 .
0970/
0980 002T ##TUTO.##MARK (##ACT-LI+011)  (AD=MILT'_' ) /*.99U001 A001 .
0990 004T ##TUTO.##VIEW (##ACT-LI+011)  (AD=ODL ) /*.01U016 A016 .
1000 021T ##TUTO.##PGM (##ACT-LI+011)  (AD=OIL ) /*.01U008 A008 .
1010 030T ##TUTO.##DESC (##ACT-LI+011)  (AD=ODL ) /*.01U049 A049 .
1020/
1030 002T ##TUTO.##MARK (##ACT-LI+012)  (AD=MILT'_' ) /*.99U001 A001 .
1040 004T ##TUTO.##VIEW (##ACT-LI+012)  (AD=ODL ) /*.01U016 A016 .
1050 021T ##TUTO.##PGM (##ACT-LI+012)  (AD=OIL ) /*.01U008 A008 .
1060 030T ##TUTO.##DESC (##ACT-LI+012)  (AD=ODL ) /*.01U049 A049 .
1070/
1080 002T ##TUTO.##MARK (##ACT-LI+013)  (AD=MILT'_' ) /*.99U001 A001 .
1090 004T ##TUTO.##VIEW (##ACT-LI+013)  (AD=ODL ) /*.01U016 A016 .
1100 021T ##TUTO.##PGM (##ACT-LI+013)  (AD=OIL ) /*.01U008 A008 .
1110 030T ##TUTO.##DESC (##ACT-LI+013)  (AD=ODL ) /*.01U049 A049 .
1120/
1130 002T ##TUTO.##MARK (##ACT-LI+014)  (AD=MILT'_' ) /*.99U001 A001 .
1140 004T ##TUTO.##VIEW (##ACT-LI+014)  (AD=ODL ) /*.01U016 A016 .
1150 021T ##TUTO.##PGM (##ACT-LI+014)  (AD=OIL ) /*.01U008 A008 .
1160 030T ##TUTO.##DESC (##ACT-LI+014)  (AD=ODL ) /*.01U049 A049 .
1170/
1180/
1190 002T 'E'(I)
1200 004T '= editieren'
1210 018T 'L'(I)
1220 020T '= anzeigen'
1230 033T 'X'(I)
1240 035T '= ausfuehren'
1250 050T 'V'(I)
1260 052T '= View anzeigen'
1270 070T 'H'(I)
1280 072T '= Hilfe'
1290* MAP2: VALIDATION *****************************************************
1300* MAP2: END OF MAP *****************************************************
1310END
