0010* >Natural Source Header 000000
0020* :Mode S
0030* :CP
0040* <Natural Source Header
0050* Name: not used/Google Map /*<RO>
0060*
0070DEFINE DATA LOCAL
00801 INFOPAGENAME (U) DYNAMIC INIT <'html/ctrlgooglemap.html'>
00901 LATITUDE  (U) DYNAMIC INIT <"49.814347">
01001 LONGITUDE (U) DYNAMIC INIT <"8.637528">
0110END-DEFINE
0120*
0130PROCESS PAGE USING "CTRGOO-A"
0140*
0150END
