0010* >Natural Source Header 000000
0020* :Mode S
0030* :CP
0040* <Natural Source Header
0050/** New Program CTRRTL-P.
0060/**
0070/** :author tsh
0080/* TODO: Enter your code here
0090SET CONTROL 'V'
0100END
