0010* >Natural Source Header 000000
0020* :Mode S
0030* :CP
0040* <Natural Source Header
0050IF *BROWSER-IO NE 'RICHGUI'
0060 WRITE 'Works only with NJX.'
0070ELSE
0080  FETCH "MENU-NJX"
0090END-IF
0100END
