0010DEFINE DATA
0020LOCAL USING RPCINFOL
0030END-DEFINE
0040CALLNAT 'RPCINFO' SERVER-PARMS CLIENT-PARMS
0050WRITE 'Server info' /
0060      S-BIKE /
0070      S-NODE /
0080      S-NAME /
0090      S-ERROR-TEXT (AL=79) /
0100      S-CON-ID (ZP=OFF)
0110      S-CON-OPEN /
0120      'Client info' /
0130      C-BIKE /
0140      C-NODE /
0150      C-NAME /
0160      C-ERROR-TEXT (AL=79) /
0170      C-CON-ID (ZP=OFF)
0180      C-CON-OPEN /
0190END
