0010DEFINE DATA PARAMETER
00201 #P001(A10)
00301 #P002(B10)
00401 REDEFINE #P002
0050  2 BI(I1/1:10)
00601 #P003(I2/3,5)
00701 #P004(F8)
00801 #P005(D)
00901 #P006(T)
01001 #P007(L)
0110LOCAL
01201 I(I4)
01301 J(I4)
0140END-DEFINE
0150ASSIGN #P001 = 'SERVER'
0160FOR I 1 10
0170  ADD 1 TO BI(I)
0180END-FOR
0190FOR I 1 3
0200  FOR J 1 5
0210    ADD 1 TO #P003(I,J)
0220  END-FOR
0230END-FOR
0240ASSIGN #P004 = -2222E44
0250ASSIGN #P005 = D'1993-12-12'
0260ASSIGN #P006 = *TIMX
0270ASSIGN #P007 = TRUE
0280END
