0010DEFINE DATA LOCAL
00201 USER(A8)
00301 OPSYS(A8)
00401 TIME(T)
00501 DATE(D)
0060END-DEFINE
0070ASSIGN USER = *USER
0080ASSIGN OPSYS = *OPSYS
0090ASSIGN TIME = *TIMX
0100ASSIGN DATE = *DATX
0110WRITE  'I''M' USER / 'CLIENT''S OPSYS IS ' OPSYS
0120                   / 'CLIENT''S TIME  IS ' TIME
0130                   / 'CLIENT''S DATE  IS ' DATE
0140CALLNAT 'TESTS4' USER OPSYS TIME DATE
0150WRITE  'HE''S' USER / 'SERVERS''S OPSYS IS ' OPSYS
0160WRITE  'HE''S' USER / 'SERVERS''S TIME  IS ' TIME
0170                    / 'SERVERS''S DATE  IS ' DATE
0180END
