0010* Program:  TEST6
0020* Library:  SYSRPC
0030* Purpose:  Example program for stub generation with groups.
0040*
0050DEFINE DATA
0060LOCAL
0070 01 GROUP-1(10)
0080   02 A (A20)
0090   02 B (A20)
0100   02 GROUP-2(20)
0110     03 C (A10/5)
0120     03 D (A10)
0130 01 LINE (A) DYNAMIC
0140END-DEFINE
0150*
0160MOVE ALL 'A' TO A(*)
0170MOVE ALL 'B' TO B(*)
0180MOVE ALL 'C11' TO C(*,1,1)
0190MOVE ALL 'C12' TO C(*,1,2)
0200MOVE ALL 'D' TO D(*,1)
0210*
0220LINE := 'Before the Callnat.'
0230*
0240WRITE LINE (AL=79)
0250   // A(*) / B(*) / GROUP-2(*,1) / D(*,1)
0260*
0270CALLNAT 'TESTS6' GROUP-1(*) LINE
0280*
0290WRITE LINE (AL=79)
0300   // A(*) / B(*) / GROUP-2(*,1) / D(*,1)
0310*
0320END
0330
0340
