0010DEFINE DATA LOCAL
00201 A(A10)
00301 B(B10)
00401 I(I2/1:3,1:5)
00501 F(F8)
00601 D(D)
00701 T(T)
00801 L(L)
00901 J(I4)
01001 K(I4)
0110END-DEFINE
0120ASSIGN A = 'CLIENT'
0130ASSIGN B = H'0123456789ABCDEF1011'
0140ASSIGN L = FALSE
0150ASSIGN D = *DATX
0160ASSIGN T = *TIMX
0170ASSIGN F = 1999E-22
0180FOR J 1 3
0190  FOR K 1 5
0200    COMPUTE I(J,K) = J * 10 + K
0210  END-FOR
0220END-FOR
0230WRITE 'VOR' /
0240      A B / I(1,*) / I(2,*) / I(3,*) / D T L
0250CALLNAT 'TESTS2' A B I(*,*) F D T L
0260WRITE 'NACH' /
0270      A B / I(1,*) / I(2,*) / I(3,*) / D T L
0280END
