0010* Program:  TEST7
0020* Library:  SYSRPC
0030* Purpose:  Example program for stub generation with extensible groups.
0040*
0050DEFINE DATA
0060LOCAL
007001 GROUP-1(10)
0080  02 A (A20)
0090  02 B (A20)
0100  02 GROUP-2(0:*)
0110    03 C (A10/5)
0120    03 D (A10)
013001 LINE (A) DYNAMIC
0140/*
01501 I (I4) /* running index
01601 J (I4) /* running index
0170END-DEFINE
0180*
0190MOVE  'A' TO A(*)
0200MOVE  'B' TO B(*)
0210*
0220EXPAND ARRAY GROUP-2 TO (*:*,0:1)
0230*
0240MOVE  'C11' TO C(*,1,1)
0250MOVE  'C12' TO C(*,1,2)
0260MOVE  'D'   TO D(*,1)
0270*
0280LINE := 'Before the Callnat.'
0290*
0300WRITE LINE (AL=79)
0310  // A(*) / B(*) / GROUP-2(*,1) / D(*,1)
0320*
0330CALLNAT 'TESTS7' GROUP-1(*) LINE
0340*
0350WRITE LINE (AL=79)
0360   // A(*) / B(*)
0370IF *UBOUND(C,2) > 1
0380THEN
0390  WRITE 001T 'C' 0012T 'N'
0400  FOR I 1 10
0410    FOR J 1 5
0420      WRITE C(I,1,J) C(I,2,J)
0430    END-FOR
0440  END-FOR
0450  WRITE D(*,1)
0460ELSE
0470  WRITE GROUP-2(*,1) / D(*,1)
0480END-IF
0490*
0500END
0510
0520
