0010* Program:  TESTS6
0020* Library:  SYSRPC
0030* Purpose:  Example subprogram for stub generation with extensible groups.
0040*
0050DEFINE DATA
0060PARAMETER
007001 GROUP-1(10)
0080  02 A (A20)
0090  02 B (A20)
0100  02 GROUP-2(20)
0110    03 C (A10/5)
0120    03 D (A10)
013001 LINE (A) DYNAMIC
0140LOCAL
01501 II (I4)
01601 I  (I4)
01701 J  (I4)
01801 K  (I4)
01901 N  (I4)      /* Counter
02001 T-A20 (A20)
02101 REDEFINE T-A20
0220  2 T-A (A1/20)
0230  2 REDEFINE T-A
0240    3 T-B (B1/20)
02501 T-N (N3/20)
0260END-DEFINE
0270/*
0280FOR I 1 10
0290  IF A(I) NE ' ' THEN
0300    MOVE A(I) TO T-A20
0310    PERFORM SHIFT
0320    MOVE T-A20 TO A(I)
0330  END-IF
0340  /*
0350  IF B(I) NE ' ' THEN
0360  MOVE B(I) TO T-A20
0370  PERFORM SHIFT
0380  MOVE T-A20 TO B(I)
0390  END-IF
0400  /*
0410  FOR J 1 20
0420    FOR K 1 5
0430      IF C(I,J,K) NE ' ' THEN
0440        MOVE C(I,J,K) TO T-A20
0450        PERFORM SHIFT
0460        MOVE T-A20 TO C(I,J,K)
0470      END-IF
0480    END-FOR
0490    /*
0500    IF D(I,J) NE ' ' THEN
0510      MOVE D(I,J) TO T-A20
0520      PERFORM SHIFT
0530      MOVE T-A20 TO D(I,J)
0540    END-IF
0550  END-FOR
0560END-FOR
0570/*
0580COMPRESS 'The subroutine SHIFT was invoked' N 'times.'
0590    INTO LINE
0600/*
0610DEFINE SUBROUTINE SHIFT
0620/* Translates upper case into lower case if value = 32
0630ADD 1 TO N
0640FOR II 1 20
0650  IF T-B(II) = H'41' THRU H'5A' THEN
0660    MOVE T-B(II) TO T-N(II)
0670    ADD 33 TO T-N(II)
0680    MOVE T-N(II) TO T-B(II)
0690  END-IF
0700END-FOR
0710END-SUBROUTINE
0720END
0730
0740
