0010DEFINE DATA
0020PARAMETER
00301 #IDENTIFIER  (A10)
00401 #N-OF-ID     (I4)
00501 #FREQ        (P5.2)
00601 #A100        (A100/5,4)
0070END-DEFINE
0080RESET #N-OF-ID #FREQ #A100(*,*)
0090*
0100DECIDE ON FIRST VALUE OF #IDENTIFIER
0110VALUE 'A'
0120  ASSIGN #A100(1,1) = #A100(1,2) = #A100(2,2) = #A100(2,3) = 'Anton'
0130  ASSIGN #A100(3,3) = #A100(3,4) = #A100(4,4)              = 'Anton'
0140VALUE 'B'
0150  ASSIGN #A100(1,1) = #A100(2,2) = #A100(3,3) = #A100(4,2) = 'Babette'
0160  ASSIGN #A100(5,1)                                        = 'Babette'
0170VALUE 'C'
0180  ASSIGN #A100(1,1) = #A100(1,2) = #A100(1,3) = #A100(1,4) = 'Charly'
0190  ASSIGN #A100(2,1) = #A100(2,4) = #A100(3,1) = #A100(3,4) = 'Charly'
0200  ASSIGN #A100(5,1) = #A100(5,2) = #A100(5,3) = #A100(5,4) = 'Charly'
0210  ASSIGN #A100(4,1) = #A100(4,4)                           = 'Charly'
0220VALUE 'D'
0230  ASSIGN #A100(1,4) = #A100(2,4) = #A100(4,4) = #A100(5,4) = 'Dustin'
0240VALUE 'E'
0250  ASSIGN #A100(2,2) = #A100(2,3) = #A100(3,2) = #A100(3,3) = 'Eleanor'
0260  ASSIGN #A100(4,2) = #A100(4,3)                           = 'Eleanor'
0270NONE VALUE
0280  #A100 (1,1) := 'No data.'
0290END-DECIDE
0300*
0310EXAMINE #A100(*,*) FOR #IDENTIFIER GIVING NUMBER IN #N-OF-ID
0320IF #N-OF-ID NE 0 THEN
0330  #FREQ := #N-OF-ID / 20.0
0340END-IF
0350END
