0010DEFINE DATA
0020PARAMETER
00301 #P001(A10)
00401 #P002(P3.4)
00501 #P003(I4/10)
00601 #P004(F4)
0070LOCAL
00801 I(I4)
0090END-DEFINE
0100ASSIGN #P001 = 'SERVER'
0110ASSIGN #P002 =  222.1234
0120FOR I 1 10
0130  ADD 1 TO #P003(I)
0140END-FOR
0150ASSIGN #P004 =   2222E-11
0160END
