0010DEFINE DATA LOCAL
00201 P1(A10)
00301 P2(P3.4)
00401 P3(I4/1:10)
00501 P4(F4)
0060END-DEFINE
0070ASSIGN P1='P1P1P1P1P1'
0080ASSIGN P2=123.4567
0090ASSIGN P3(1) = 11
0100ASSIGN P3(2) = 21
0110ASSIGN P3(3) = 31
0120ASSIGN P3(4) = 41
0130ASSIGN P3(5) = 51
0140ASSIGN P3(6) = 61
0150ASSIGN P3(7) = 71
0160ASSIGN P3(8) = 81
0170ASSIGN P3(9) = 91
0180ASSIGN P3(10) = 101
0190ASSIGN P4=222E12
0200WRITE 'VOR' / P1 P2 / P3(*) / P4
0210CALLNAT 'TESTS1' P1 P2 P3(1:10) P4
0220WRITE 'NACH' / P1 P2 / P3(*) / P4
0230END
