0010DEFINE DATA PARAMETER
00201 USER(A8)
00301 OPSYS(A8)
00401 TIME(T)
00501 DATE(D)
0060END-DEFINE
0070ASSIGN USER = *USER
0080ASSIGN OPSYS = *OPSYS
0090ASSIGN TIME = *TIMX
0100ASSIGN DATE = *DATX
0110END
