0010DEFINE PROTOTYPE SAGENC RETURNS (A) DYNAMIC
0020  DEFINE DATA PARAMETER
0030  1 P-DEC-STR (A) DYNAMIC BY VALUE
0040  END-DEFINE
0050END-PROTOTYPE
