0010/* This program serves as example how to design a user-defined
0020/* program to call 'USR4218N'
0030/***********************************************************************
0040/*---------------------------------------------------------------------
0050/*---------------- Compiler options -----------------------------------
0060/*---------------------------------------------------------------------
0070OPTIONS LOWSRCE=ON
0080/*---------------------------------------------------------------------
0090/*---------------- Data definitions -----------------------------------
0100/*---------------------------------------------------------------------
0110Define Data Local
0120/*---------------------------------------------------------------------
0130/* Parameters for USR4218N
0140/*---------------------------------------------------------------------
01501 P-Client-Type                   (A1)
01601 P-Client-Version                (I4)
01701 P-Private-Mode                  (A1)
01801 P-Return-Code                   (I4)
01901 P-Additional-Parameters         (A1/1:2)
02001 Redefine P-Additional-Parameters
0210  2 P-Add-Para-Version            (N2)
0220/*---------------------------------------------------------------------
0230/* other local variables
0240/*---------------------------------------------------------------------
02501 Text-Server                     (A35)
0260End-Define
0270/***********************************************************************
0280/*---------------------------------------------------------------------
0290/*---------------- Start of main program ------------------------------
0300/*---------------------------------------------------------------------
0310/*---------------------------------------------------------------------
0320/* Read the client infos with USR4218N
0330/*---------------------------------------------------------------------
0340Callnat 'USR4218N'
0350        P-Client-Type
0360        P-Client-Version
0370        P-Private-Mode
0380        P-Return-Code
0390        P-Additional-Parameters (*)
0400Decide on first value of P-Client-Type
0410  Value 'L'   Text-Server := '(running local, no client active)'
0420  Value 'S'   Text-Server := '(Natural Studio)'
0430  Value 'N'   Text-Server := '(NfN or ONE)'
0440  None Value  Text-Server := '(no info available)'
0450End-Decide
0460/*---------------------------------------------------------------------
0470/* Display returned data
0480/*---------------------------------------------------------------------
0490Input (AD=OI'_' IP=OFF CD=NE)
0500      18T 'USR4218N: Current Server Context' (YEI)
0510    / 18T '-' (32) (YEI) /
0520    / 10T 'Client type .......' (TU) P-Client-Type
0530      40T Text-Server
0540    / 10T 'Client version ....' (TU) P-Client-Version (AD=L)
0550    / 10T 'Client private mode' (TU) P-Private-Mode
0560   // 10T 'Return code .......' (TU) P-Return-Code (AD=L)
0570/*---------------------------------------------------------------------
0580/***********************************************************************
0590/***********************************************************************
0600END
