0010/* This program serves as example how to design a user-defined
0020/* program to call 'USR6308N'
0030/***********************************************************************
0040/*---------------------------------------------------------------------
0050/*---------------- Compiler options -----------------------------------
0060/*---------------------------------------------------------------------
0070OPTIONS LOWSRCE=ON
0080/*---------------------------------------------------------------------
0090/*---------------- Data definitions -----------------------------------
0100/*---------------------------------------------------------------------
0110Define Data
0120/*---------------------------------------------------------------------
0130/*---------------- Local data -----------------------------------------
0140/*---------------------------------------------------------------------
0150Local
0160/*---------------------------------------------------------------------
0170/* Parameters for USR6308N
0180/*---------------------------------------------------------------------
01901 USR6308-PARMS
0200  2 P-Number-System-Files             (I2)
0210  2 P-System-File-Table               (*)
0220    3 P-System-File-DBID              (N5)
0230    3 P-System-File-FNR               (N5)
0240    3 P-System-File-Path              (A) Dynamic
0250  2 P-Additionals                     (A1/1:2)
0260  2 Redefine P-Additionals
0270    3 P-Additionals-Version           (N2)
0280  2 P-Return-Msg                      (A250)
0290  2 P-Return-Code                     (I4)
0300/*---------------------------------------------------------------------
0310/* Other local data
0320/*---------------------------------------------------------------------
03301 Header-1                            (A20) Init
0340                                            <'Index DBID  FNR Path'>
03501 Header-2                            (A15) Init <'----- ---- ----'>
03601 IX1                                 (I4)
0370End-Define
0380/**********************************************************************
0390/**********************************************************************
0400/*---------------------------------------------------------------------
0410Format LS=240
0420/*---------------------------------------------------------------------
0430/*---------------------------------------------------------------------
0440/*---------------------------------------------------------------------
0450At Top of Page
0460  Print 'system files defined in Natconf.cfg'
0470      / Header-1
0480      / Header-2 '-' (63)
0490End-TopPage
0500/*---------------------------------------------------------------------
0510/* Get data
0520/*---------------------------------------------------------------------
0530P-Additionals-Version := 0
0540Callnat 'USR6308N'
0550        USR6308-PARMS
0560/*---------------------------------------------------------------------
0570/* Display the data
0580/*---------------------------------------------------------------------
0590If (P-Return-Code <> 0)
0600  Print
0610      / 'Return code' P-Return-Code 'from USR6308N, message:'
0620      / P-Return-Msg
0630Else
0640  For IX1 = 1 to P-Number-System-Files
0650    Print (SG=Off)
0660          IX1 (NL=5)
0670       7T P-System-File-DBID (IX1) (NL=4)
0680      12T P-System-File-FNR  (IX1) (NL=4)
0690      17T P-System-File-Path (IX1)
0700  End-For
0710End-If
0720/**********************************************************************
0730/**********************************************************************
0740End
