0010** Example 'ACCEPX02': ACCEPT IF ... AND ...
0020************************************************************************
0030DEFINE DATA LOCAL
00401 MYVIEW VIEW OF EMPLOYEES
0050  2 NAME
0060  2 JOB-TITLE
0070  2 CURR-CODE (1:1)
0080  2 SALARY    (1:1)
0090END-DEFINE
0100*
0110READ (20) MYVIEW BY NAME WHERE CURR-CODE (1) = 'USD'
0120  ACCEPT IF  SALARY (1) >= 40000
0130         AND SALARY (1) <= 45000
0140  DISPLAY NAME JOB-TITLE SALARY (1)
0150END-READ
0160END
