0010** Example 'ACCEPX04': ACCEPT IF ... LES THAN ...
0020************************************************************************
0030DEFINE DATA LOCAL
00401 EMPLOY-VIEW VIEW OF EMPLOYEES
0050  2 PERSONNEL-ID
0060  2 NAME
0070  2 JOB-TITLE
0080  2 SALARY (1)
0090END-DEFINE
0100*
0110LIMIT 20
0120READ EMPLOY-VIEW BY PERSONNEL-ID = '20017000'
0130  ACCEPT IF SALARY (1) LESS THAN 38000
0140  DISPLAY NOTITLE PERSONNEL-ID NAME JOB-TITLE SALARY (1)
0150END-READ
0160END
