0010** Example 'ATENDX01': AT END OF DATA
0020************************************************************************
0030DEFINE DATA LOCAL
00401 EMPLOY-VIEW VIEW OF EMPLOYEES
0050  2 PERSONNEL-ID
0060  2 NAME
0070  2 JOB-TITLE
0080END-DEFINE
0090*
0100READ (6) EMPLOY-VIEW BY PERSONNEL-ID FROM '20017000'
0110  DISPLAY NOTITLE NAME JOB-TITLE
0120  AT END OF DATA
0130    WRITE / 'LAST PERSON SELECTED:' OLD(NAME)
0140  END-ENDDATA
0150END-READ
0160END
