0010** Example 'DISPLX04': DISPLAY (with nX)
0020************************************************************************
0030DEFINE DATA LOCAL
00401 VIEWEMP VIEW OF EMPLOYEES
0050  2 PERSONNEL-ID
0060  2 NAME
0070  2 BIRTH
0080  2 JOB-TITLE
0090END-DEFINE
0100*
0110FORMAT SF=3
0120READ (3) VIEWEMP BY BIRTH
0130  DISPLAY PERSONNEL-ID NAME 5X JOB-TITLE
0140END-READ
0150END
