0010** Example 'DISPLX01': DISPLAY
0020************************************************************************
0030DEFINE DATA LOCAL
00401 VIEWEMP VIEW OF EMPLOYEES
0050  2 PERSONNEL-ID
0060  2 NAME
0070  2 BIRTH
0080  2 JOB-TITLE
0090END-DEFINE
0100*
0110READ (3) VIEWEMP BY BIRTH
0120  DISPLAY PERSONNEL-ID NAME JOB-TITLE
0130END-READ
0140END
