0010** Example 'DISPLX07': DISPLAY (with index notation)
0020************************************************************************
0030DEFINE DATA LOCAL
00401 VIEWEMP VIEW OF EMPLOYEES
0050  2 PERSONNEL-ID
0060  2 NAME
0070  2 BIRTH
0080  2 INCOME  (1:3)
0090    3 CURR-CODE
0100    3 SALARY
0110    3 BONUS (1:1)
0120END-DEFINE
0130*
0140READ (3) VIEWEMP BY BIRTH
0150  DISPLAY PERSONNEL-ID NAME INCOME (1:3)
0160  SKIP 1
0170END-READ
0180END
