0010** Example 'DISPLX20': DISPLAY (with NOTITLE)
0020************************************************************************
0030DEFINE DATA LOCAL
00401 EMPLOY-VIEW VIEW OF EMPLOYEES
0050  2 CITY
0060  2 NAME
0070  2 FIRST-NAME
0080END-DEFINE
0090*
0100READ (5) EMPLOY-VIEW BY CITY FROM 'BOSTON'
0110  DISPLAY NOTITLE NAME FIRST-NAME CITY
0120END-READ
0130END
