0010** Example 'DISPLX05': DISPLAY (with nT)
0020************************************************************************
0030DEFINE DATA LOCAL
00401 VIEWEMP VIEW OF EMPLOYEES
0050  2 NAME
0060  2 FIRST-NAME
0070END-DEFINE
0080*
0090READ (3) VIEWEMP BY NAME STARTING FROM 'JONES'
0100  DISPLAY 5T NAME 30T FIRST-NAME
0110END-READ
0120END
