0010** Example 'DISPLX09': DISPLAY  (without column title)
0020************************************************************************
0030DEFINE DATA LOCAL
00401 VIEWEMP VIEW OF EMPLOYEES
0050  2 NAME
0060  2 FIRST-NAME
0070  2 CITY
0080END-DEFINE
0090*
0100READ (3) VIEWEMP BY CITY STARTING FROM 'NEW YORK'
0110  DISPLAY VERT NAME FIRST-NAME / CITY
0120  SKIP 2
0130END-READ
0140END
