0010** Example 'DISPLX14': DISPLAY  (with AL, SF and nX)
0020************************************************************************
0030DEFINE DATA LOCAL
00401 EMPLOY-VIEW VIEW OF EMPLOYEES
0050  2 FIRST-NAME
0060  2 NAME
0070  2 ADDRESS-LINE (1)
0080  2 TELEPHONE
0090    3 AREA-CODE
0100    3 PHONE
0110  2 CITY
0120END-DEFINE
0130*
0140READ (3) EMPLOY-VIEW BY NAME STARTING FROM 'W'
0150  DISPLAY (AL=15 SF=5) NAME CITY / ADDRESS-LINE(1) 2X TELEPHONE
0160  SKIP 1
0170END-READ
0180END
