0010** Example 'DISPLX10': DISPLAY (with VERT as CAPTIONED and HORIZ clause)
0020************************************************************************
0030DEFINE DATA LOCAL
00401 VIEWEMP VIEW OF EMPLOYEES
0050  2 NAME
0060  2 FIRST-NAME
0070  2 CITY
0080  2 JOB-TITLE
0090  2 SALARY (1:1)
0100END-DEFINE
0110*
0120READ (3) VIEWEMP BY CITY STARTING FROM 'NEW YORK'
0130  DISPLAY VERT AS CAPTIONED NAME FIRST-NAME
0140          HORIZ JOB-TITLE SALARY (1:1)
0150  SKIP 1
0160END-READ
0170END
