0010** Example 'DISPLX08': DISPLAY  (with column title in 'text')
0020************************************************************************
0030DEFINE DATA LOCAL
00401 VIEWEMP VIEW OF EMPLOYEES
0050  2 PERSONNEL-ID
0060  2 NAME
0070  2 BIRTH
0080  2 JOB-TITLE
0090END-DEFINE
0100*
0110READ (3) VIEWEMP BY BIRTH
0120  DISPLAY PERSONNEL-ID
0130         'EMPLOYEE' NAME
0140         'POSITION' JOB-TITLE
0150END-READ
0160END
