0010** Example 'FINDX03': FIND
0020************************************************************************
0030DEFINE DATA LOCAL
00401 MYVIEW VIEW OF EMPLOYEES
0050  2 NAME
0060  2 FIRST-NAME
0070  2 CITY
0080END-DEFINE
0090*
0100FIND MYVIEW WITH NAME = 'ADKINSON'
0110  DISPLAY NAME FIRST-NAME CITY
0120END-FIND
0130END
