0010** Example 'FINDX02': FIND (with IF NO RECORDS FOUND)
0020************************************************************************
0030DEFINE DATA LOCAL
00401 MYVIEW VIEW OF EMPLOYEES
0050  2 NAME
0060  2 FIRST-NAME
0070END-DEFINE
0080*
0090FIND MYVIEW WITH NAME = 'BLACKSMITH'
0100  IF NO RECORDS FOUND
0110    WRITE 'NO PERSON FOUND.'
0120  END-NOREC
0130  DISPLAY NAME FIRST-NAME
0140END-FIND
0150END
