0010** Example 'FINDX01': FIND (with WHERE)
0020************************************************************************
0030DEFINE DATA LOCAL
00401 MYVIEW VIEW OF EMPLOYEES
0050  2 PERSONNEL-ID
0060  2 NAME
0070  2 JOB-TITLE
0080  2 CITY
0090END-DEFINE
0100*
0110FIND MYVIEW WITH CITY = 'PARIS'
0120            WHERE JOB-TITLE = 'INGENIEUR COMMERCIAL'
0130  DISPLAY NOTITLE CITY JOB-TITLE PERSONNEL-ID NAME
0140END-FIND
0150END
