0010** Example 'FORMAX06': FORMAT (with parameter IS
0020**                     and compare with FORMAX05)
0030************************************************************************
0040DEFINE DATA LOCAL
00501 VIEWEMP VIEW OF EMPLOYEES
0060  2 NAME
0070  2 FIRST-NAME
0080END-DEFINE
0090*
0100FORMAT IS=ON
0110*
0120READ (3) VIEWEMP BY NAME STARTING FROM 'JONES'
0130  DISPLAY NAME FIRST-NAME
0140END-READ
0150END
