0010** Example 'FORMAX03': FORMAT (without FORMAT and compare with FORMAX04)
0020************************************************************************
0030DEFINE DATA LOCAL
00401 VIEWEMP VIEW OF EMPLOYEES
0050  2 NAME
0060  2 FIRST-NAME
0070  2 SALARY (1:1)
0080  2 BONUS  (1:1,1:1)
0090END-DEFINE
0100*
0110READ (5) VIEWEMP BY NAME STARTING FROM 'JONES'
0120  DISPLAY NAME
0130          FIRST-NAME
0140          SALARY (1:1)
0150          BONUS  (1:1,1:1)
0160END-READ
0170END
