0010** Example 'FORMAX08': FORMAT (with parameters ES and ZP
0020**                     and compare with FORMAX07)
0030************************************************************************
0040DEFINE DATA LOCAL
00501 VIEWEMP VIEW OF EMPLOYEES
0060  2 NAME
0070  2 FIRST-NAME
0080  2 BONUS (1:2,1:1)
0090END-DEFINE
0100*
0110FORMAT ES=ON
0120*
0130READ (4) VIEWEMP BY NAME STARTING FROM 'JONES'
0140  DISPLAY NAME FIRST-NAME BONUS (1:2,1:1)(ZP=OFF)
0150END-READ
0160END
