0010** Example 'FORMAX01': FORMAT (with parameters FC, GC)
0020************************************************************************
0030DEFINE DATA LOCAL
00401 VIEWEMP VIEW OF EMPLOYEES
0050  2 NAME
0060  2 INCOME (1:1)
0070    3 CURR-CODE
0080    3 SALARY
0090    3 BONUS (1:1)
0100END-DEFINE
0110*
0120FORMAT FC=* GC=$
0130*
0140READ (3) VIEWEMP BY NAME
0150  DISPLAY NAME (FC==) INCOME (1)
0160END-READ
0170END
