0010** Example 'FORMAX02': FORMAT (with parameter UC)
0020************************************************************************
0030DEFINE DATA LOCAL
00401 VIEWEMP VIEW OF EMPLOYEES
0050  2 PERSONNEL-ID
0060  2 NAME
0070  2 BIRTH
0080  2 JOB-TITLE
0090END-DEFINE
0100*
0110FORMAT UC==
0120*
0130WRITE TITLE LEFT JUSTIFIED UNDERLINED 'EMPLOYEES REPORT'
0140SKIP 1
0150READ (3) VIEWEMP BY BIRTH
0160  DISPLAY PERSONNEL-ID (UC=*) NAME JOB-TITLE
0170END-READ
0180END
