0010** Example 'FUNCEX04': Function call  (Function)
0020************************************************************************
0030DEFINE FUNCTION F#EVEN
0040  RETURNS (L)
0050  DEFINE DATA
0060  PARAMETER
0070    1 #NUM  (N4) BY VALUE
0080  LOCAL
0090    1 #REST (I2)
0100  END-DEFINE
0110  /*
0120  DIVIDE 2 INTO #NUM REMAINDER #REST
0130  /*
0140  IF #REST = 0
0150    F#EVEN := TRUE
0160  ELSE
0170    F#EVEN := FALSE
0180  END-IF
0190  /*
0200END-FUNCTION
0210*
0220END
