0010** Example 'FUNCAX02': Calling a function  (Function)
0020************************************************************************
0030DEFINE FUNCTION F#ADD
0040  RETURNS #RESULT (I4)
0050  DEFINE DATA PARAMETER
0060    1 #SUMMAND1 (I4) BY VALUE
0070    1 #SUMMAND2 (I4) BY VALUE
0080  END-DEFINE
0090  /*
0100  #RESULT := #SUMMAND1 + #SUMMAND2
0110  /*
0120END-FUNCTION
0130*
0140END
