0010** Example 'HISTOX01': HISTOGRAM
0020************************************************************************
0030DEFINE DATA LOCAL
00401 MYVIEW VIEW OF EMPLOYEES
0050  2 CITY
0060END-DEFINE
0070*
0080LIMIT 8
0090HISTOGRAM MYVIEW CITY STARTING FROM 'M'
0100  DISPLAY NOTITLE CITY 'NUMBER OF/PERSONS' *NUMBER *COUNTER
0110END-HISTOGRAM
0120END
