0010** Example 'IFX01': IF
0020************************************************************************
0030DEFINE DATA LOCAL
00401 MYVIEW VIEW OF EMPLOYEES
0050  2 NAME
0060  2 BIRTH
0070  2 CITY
0080  2 SALARY (1:1)
0090END-DEFINE
0100*
0110LIMIT 7
0120READ MYVIEW BY CITY STARTING FROM 'C'
0130  IF SALARY (1) LT 40000 THEN
0140    WRITE NOTITLE '*****' NAME 30X 'SALARY LT 40000'
0150  ELSE
0160    DISPLAY NAME BIRTH (EM=YYYY-MM-DD) SALARY (1)
0170  END-IF
0180END-READ
0190END
