0010** Example 'LOGICX01': MASK option in logical condition
0020************************************************************************
0030DEFINE DATA LOCAL
00401 EMPLOY-VIEW VIEW OF EMPLOYEES
0050  2 CITY
0060END-DEFINE
0070*
0080HISTOGRAM EMPLOY-VIEW CITY
0090  IF CITY = MASK (....XX) '....NN'
0100    DISPLAY NOTITLE CITY *NUMBER
0110  END-IF
0120END-HISTOGRAM
0130*
0140END
