0010** Example 'LOGICX06': MODIFIED option in logical condition
0020************************************************************************
0030DEFINE DATA LOCAL
00401 #ATTR (C)
00501 #A    (A1)
00601 #B    (A1)
0070END-DEFINE
0080*
0090MOVE (AD=I) TO #ATTR
0100*
0110INPUT (CV=#ATTR) #A #B
0120IF #ATTR NOT MODIFIED
0130  WRITE NOTITLE 'FIELD #A OR #B HAS NOT BEEN MODIFIED'
0140END-IF
0150*
0160IF #ATTR MODIFIED
0170  WRITE NOTITLE 'FIELD #A OR #B HAS BEEN MODIFIED'
0180END-IF
0190*
0200END
