0010** Example 'NEWPAX01': NEWPAGE
0020************************************************************************
0030DEFINE DATA LOCAL
00401 VIEWEMP VIEW OF EMPLOYEES
0050  2 NAME
0060  2 CITY
0070  2 DEPT
0080END-DEFINE
0090*
0100FORMAT PS=20
0110READ (5) VIEWEMP BY CITY STARTING FROM 'M'
0120  DISPLAY NAME 'DEPT' DEPT 'LOCATION' CITY
0130  AT BREAK OF CITY
0140    NEWPAGE WITH TITLE LEFT JUSTIFIED
0150           'EMPLOYEES BY CITY - PAGE:' *PAGE-NUMBER
0160  END-BREAK
0170END-READ
0180END
