0010** Example 'READX03': READ (with LOGICAL clause)
0020************************************************************************
0030DEFINE DATA LOCAL
00401 EMPLOY-VIEW VIEW OF EMPLOYEES
0050  2 NAME
0060  2 PERSONNEL-ID
0070  2 JOB-TITLE
0080END-DEFINE
0090*
0100LIMIT 8
0110READ EMPLOY-VIEW LOGICAL BY PERSONNEL-ID
0120  DISPLAY NOTITLE  *ISN      NAME
0130                  'PERS-NO'  PERSONNEL-ID
0140                  'POSITION' JOB-TITLE
0150END-READ
0160END
