0010** Example 'READX01': READ
0020************************************************************************
0030DEFINE DATA LOCAL
00401 MYVIEW VIEW OF EMPLOYEES
0050  2 NAME
0060  2 PERSONNEL-ID
0070  2 JOB-TITLE
0080END-DEFINE
0090*
0100READ (6) MYVIEW BY NAME
0110  DISPLAY NAME PERSONNEL-ID JOB-TITLE
0120END-READ
0130END
