0010** Example 'WRITEX05': WRITE  (in combination with DISPLAY)
0020************************************************************************
0030DEFINE DATA LOCAL
00401 VIEWEMP VIEW OF EMPLOYEES
0050  2 NAME
0060  2 JOB-TITLE
0070  2 DEPT
0080  2 CITY
0090END-DEFINE
0100*
0110READ (3) VIEWEMP BY CITY STARTING FROM 'SAN FRANCISCO'
0120  DISPLAY NAME JOB-TITLE
0130  WRITE T*JOB-TITLE 'DEPT:' DEPT
0140  SKIP 1
0150END-READ
0160END
