0010** Example 'WRITEX03': WRITE (with index notation)
0020************************************************************************
0030DEFINE DATA LOCAL
00401 VIEWEMP VIEW OF EMPLOYEES
0050  2 PERSONNEL-ID
0060  2 NAME
0070  2 BIRTH
0080  2 JOB-TITLE
0090  2 SALARY (1:3)
0100END-DEFINE
0110*
0120READ (3) VIEWEMP BY BIRTH
0130  WRITE PERSONNEL-ID NAME / JOB-TITLE SALARY (1:3)
0140  SKIP 1
0150END-READ
0160END
