0010** Example 'WRITEX02': WRITE (with line advance)
0020************************************************************************
0030DEFINE DATA LOCAL
00401 VIEWEMP VIEW OF EMPLOYEES
0050  2 NAME
0060  2 FIRST-NAME
0070  2 DEPARTMENT
0080END-DEFINE
0090*
0100READ (3) VIEWEMP BY NAME STARTING FROM 'JONES'
0110  WRITE NAME / FIRST-NAME 'DEPART-/MENT' DEPARTMENT //
0120END-READ
0130END
