0010DEFINE DATA LOCAL
00201 #left  (A10)
00301 #right (A10)
0040END-DEFINE
0050**
0060DEFINE WINDOW WIN1
0070SIZE 5 * 20
0080BASE TOP LEFT
0090**
0100DEFINE WINDOW WIN2
0110SIZE 5 * 20
0120BASE TOP RIGHT
0130**
0140INPUT WINDOW='WIN1' (IP=OFF AD=M) #left #right
0150INPUT WINDOW='WIN2' (IP=OFF AD=M) #left #right
0160**
0170DISPLAY #left #right
0180END
